
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>談中小企業放款 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="27.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    我在飛向的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="26.html">
            
                <a href="26.html">
            
                    
                    談中小企業放款
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="27.html">
            
                <a href="27.html">
            
                    
                    獎助條例
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    在大公司打工的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="31.html">
            
                <a href="31.html">
            
                    
                    帝王
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="32.html">
            
                <a href="32.html">
            
                    
                    組織與企業章呈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="36.html">
            
                <a href="36.html">
            
                    
                    祖傳代碼與組織知識的傳承
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="38.html">
            
                <a href="38.html">
            
                    
                    靠數據指標（KPI）引導團隊
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    矽谷雜談
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="41.html">
            
                <a href="41.html">
            
                    
                    併聘 Acquhire
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="42.html">
            
                <a href="42.html">
            
                    
                    企業併購產品整合問題
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    大齡工程師的挑戰
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="51.html">
            
                <a href="51.html">
            
                    
                    程式設計師潛水夫症
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="52.html">
            
                <a href="52.html">
            
                    
                    工程師年齡歧視的真象
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    給年輕人的建議
            
                </span>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >談中小企業放款</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x8AC7;&#x4E2D;&#x5C0F;&#x4F01;&#x696D;&#x653E;&#x6B3E;">&#x8AC7;&#x4E2D;&#x5C0F;&#x4F01;&#x696D;&#x653E;&#x6B3E;</h1>
<p>&#x6211;&#x5728;&#x98DB;&#x5411;&#x6642;&#xFF0C;&#x767C;&#x73FE;&#x516C;&#x53F8;&#x7684;&#x6709;&#x4E9B;&#x696D;&#x52D9;&#xFF0C;&#x7ADF;&#x7136;&#x662F;&#x900F;&#x904E;&#x6211;&#x5011;&#x7684;&#x5F80;&#x4F86;&#x9280;&#x884C;&#x4ECB;&#x7D39;&#x7684;&#xFF0C;&#x5728;&#x4E2D;&#x5C0F;&#x4F01;&#x696D;&#x8CB8;&#x6B3E;&#x4E0A;&#xFF0C;&#x767C;&#x89BA;&#x53F0;&#x7F8E;&#x5169;&#x5730;&#x6709;&#x5F88;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x5728;&#x9019;&#x908A;&#xFF0C;&#x6211;&#x89BA;&#x5F97;&#x5F88;&#x5927;&#x7684;&#x4E00;&#x584A;&#x5DEE;&#x7570;&#x5C31;&#x662F;&#x5728;&#x8CC7;&#x672C;&#x5E02;&#x5834;&#x53CA;&#x8CC7;&#x8A0A;&#x6D41;&#x9019;&#x4E00;&#x584A;&#xFF0C;&#x9280;&#x884C;&#x7684;&#x696D;&#x52D9;&#x6709;&#x516D;&#x5927;&#x584A;&#xFF0C;&#x9664;&#x4E86;&#x5927;&#x5BB6;&#x719F;&#x6089;&#x7684;&#x5E7E;&#x6A23;&#x5546;&#x696D;&#x9280;&#x884C;&#x8DDF;&#x6295;&#x8CC7;&#x9280;&#x884C;&#x5916;&#xFF0C;&#x6709;</p>
<ul>
<li>&#x5546;&#x696D;&#x9280;&#x884C;&#xFF1A;&#x505A;&#x4E00;&#x822C;&#x5B58;&#x653E;&#x6B3E;&#x3001;&#x623F;&#x8CB8;&#x696D;&#x52D9;&#x7684;</li>
<li>&#x6295;&#x8CC7;&#x9280;&#x884C;&#xFF1A;&#x5354;&#x52A9;&#x5927;&#x578B;&#x516C;&#x53F8;&#x8CE3;&#x516C;&#x50B5;&#x6216;&#x662F; IPO &#x7684;&#x696D;&#x52D9;</li>
<li>&#x81EA;&#x71DF;&#x90E8;&#x9580;&#xFF1A;&#x628A;&#x9280;&#x884C;&#x6536;&#x4F86;&#x7684;&#x8CC7;&#x91D1;&#xFF0C;&#x62FF;&#x4F86;&#x505A;&#x80A1;&#x7968;&#x53CA;&#x5916;&#x532F;&#x7684;&#x64CD;&#x4F5C;&#x3002;</li>
<li>&#x79C1;&#x4EBA;&#x9280;&#x884C;&#xFF1A;&#x5354;&#x52A9;&#x5BA2;&#x6236;&#x505A;&#x8CC7;&#x7522;&#x7BA1;&#x7406;&#xFF0C;&#x505A;&#x6295;&#x8CC7;&#x7406;&#x8CA1;&#x3002;</li>
<li>&#x79C1;&#x52DF;&#x57FA;&#x91D1;</li>
<li>&#x4E2D;&#x5C0F;&#x4F01;&#x696D;&#x90E8;&#x9580;&#xFF1A;&#x5C0D;&#x4E2D;&#x5C0F;&#x4F01;&#x696D;&#x653E;&#x6B3E;&#x7684;&#x55AE;&#x4F4D;&#xFF0C;&#x4E5F;&#x662F;&#x4ECA;&#x5929;&#x8981;&#x8B1B;&#x7684;&#x91CD;&#x9EDE;&#x3002;</li>
</ul>
<p>&#x6211;&#x9032;&#x5165;&#x98DB;&#x5411;&#x6642;&#xFF0C;&#x516C;&#x53F8;&#x7B97;&#x662F; A &#x8F2A;&#x4E4B;&#x524D;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x53EA;&#x6709;&#x8001;&#x95C6;&#x53CA;&#x4E00;&#x4E9B;&#x5929;&#x4F7F;&#x6295;&#x8CC7;&#x4EBA;&#x6295;&#x8CC7;&#xFF0C;&#x8CC7;&#x91D1;&#x5C31;&#x653E;&#x5728;&#x6211;&#x5011;&#x7684;&#x9280;&#x884C;&#x7576;&#x4E2D;&#xFF0C;&#x540C;&#x6642;&#xFF0C;&#x6211;&#x5011;&#x7684;&#x9280;&#x884C;&#x540C;&#x6642;&#x4E5F;&#x662F;&#x6211;&#x5011;&#x7684;&#x6295;&#x8CC7;&#x4EBA;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x6211;&#x5011;&#x8A31;&#x591A;&#x7684;&#x5408;&#x7D04;&#xFF0C;&#x662F;&#x900F;&#x904E;&#x6211;&#x5011;&#x7684;&#x9280;&#x884C;&#x62FF;&#x5230;&#x7684;&#xFF0C;&#x751A;&#x81F3;&#x4E00;&#x4E9B;&#x4F75;&#x8CFC;&#x6848;&#xFF0C;&#x4E5F;&#x662F;&#x6211;&#x5011;&#x9280;&#x884C;&#x4EF2;&#x4ECB;&#x4F86;&#x7684;&#xFF1B;&#x6211;&#x5011;&#x5408;&#x4F5C;&#x7684;&#x4E2D;&#x5C0F;&#x4F01;&#x9280;&#x6709;&#x591A;&#x653E;&#x6B3E;&#x7684;&#x5C0D;&#x50CF;&#xFF0C;&#x70BA;&#x4E86;&#x78BA;&#x4FDD;&#x50B5;&#x6B0A;&#x56DE;&#x6536;&#xFF0C;&#x6240;&#x4EE5;&#x6703;&#x7576;&#x505A;&#x8CC7;&#x8A0A;&#x6D41;&#x901A;&#x7684;&#x4E2D;&#x4ECB;&#x5A92;&#x4ECB;&#xFF0C;&#x5E6B;&#x5FD9;&#x4ECB;&#x7D39;&#x4E00;&#x4E9B;&#x6F5B;&#x5728;&#x7684;&#x5BA2;&#x6236;&#x7D66;&#x6211;&#x5011;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#x98DB;&#x5411;&#x5728;&#x88AB;&#x4F75;&#x8CFC;&#x524D;&#x7684;&#x6700;&#x5F8C;&#x4E00;&#x500B;&#x7522;&#x54C1;&#x7DDA; SpendScore &#x662F;&#x6211;&#x5011;&#x8DDF;&#x6211;&#x5011;&#x7684;&#x5F80;&#x4F86;&#x9280;&#x884C;&#x8CB7;&#x4F86;&#x7684;&#xFF0C; SpendScore &#x662F;&#x53E6;&#x4E00;&#x9593;&#x65B0;&#x5275;&#x516C;&#x53F8; InboundScore &#x7684;&#x7522;&#x54C1;&#xFF0C; InboundScore &#x6709;&#x56DB;&#x5E74;&#x7684;&#x6B77;&#x53F2;&#xFF0C;&#x5728;&#x88AB;&#x4F75;&#x8CFC;&#x524D; CEO &#x5DF2;&#x7D93;&#x6490;&#x4E0D;&#x4E0B;&#x53BB;&#x4E86;&#xFF0C;&#x5269; CTO &#x5E36;&#x8457;&#x5E7E;&#x500B;&#x54E1;&#x5DE5;&#xFF0C;&#x8981;&#x6E05;&#x7B97;&#x516C;&#x53F8;&#x5269;&#x9918;&#x8CC7;&#x7522;&#x3002;&#x9280;&#x884C;&#x70BA;&#x4E86;&#x56DE;&#x6536;&#x50B5;&#x6B0A;&#xFF0C;&#x6240;&#x4EE5;&#x958B;&#x59CB;&#x515C;&#x552E;&#x516C;&#x53F8;&#x8CC7;&#x7522;&#x800C;&#x627E;&#x4E0A;&#x6211;&#x5011;&#x7684;&#xFF0C;&#x9280;&#x884C;&#x628A;&#x516C;&#x53F8;&#x7684;&#x6578;&#x4F4D;&#x8CC7;&#x7522;&#x3001;&#x5546;&#x52D9;&#x5408;&#x7D04;&#x3001;&#x53CA;&#x4EBA;&#x529B;&#x8CC7;&#x6E90;&#x62FF;&#x4F86;&#x515C;&#x552E;&#xFF0C;&#x5C31;&#x9019;&#x6A23;&#xFF0C;&#x6211;&#x5011;&#x7528;&#x5F88;&#x4F4E;&#x7684;&#x50F9;&#x9322;&#x6536;&#x8CFC;&#x4E86; InboundScore &#x7684;&#x7522;&#x54C1;&#xFF0C;&#x4EE5;&#x53CA;&#x4ED6;&#x5011;&#x4E00;&#x5F35;&#x5F88;&#x6709;&#x50F9;&#x503C;&#x7684;&#x5546;&#x696D;&#x5408;&#x7D04;&#x3002;</p>
<p>&#x9019;&#x5F35;&#x5546;&#x696D;&#x5408;&#x7D04;&#xFF0C;&#x662F;&#x8207; Intuit &#x9019;&#x9593;&#x5927;&#x578B;&#x8EDF;&#x9AD4;&#x516C;&#x53F8;&#x7684;&#x5408;&#x7D04;&#xFF0C;&#x70BA; Intuit &#x5C07;&#x6F5B;&#x5728;&#x7684;&#x5BA2;&#x6236;&#x5206;&#x7D1A;&#xFF0C;&#x8B93;&#x4ED6;&#x5011;&#x7684;&#x92B7;&#x552E;&#x5718;&#x968A;&#x53EF;&#x4EE5;&#x628A;&#x6642;&#x9593;&#x8DDF;&#x7CBE;&#x529B;&#x82B1;&#x8F03;&#x53EF;&#x80FD;&#x6210;&#x4EA4;&#x7684;&#x5BA2;&#x6236;&#x8EAB;&#x4E0A;&#xFF0C;&#x98DB;&#x5411;&#x4F86;&#x8AAA;&#x8CB7;&#x4E0B;&#x4E86;&#x9019;&#x500B;&#x6307;&#x6A19;&#x6027;&#x7684;&#x5BA2;&#x6236;&#x5F8C;&#xFF0C;&#x53EF;&#x4EE5;&#x8B93;&#x6211;&#x5011;&#x66F4;&#x7C21;&#x55AE;&#x7684;&#x8AAA;&#x670D;&#x5176;&#x5B83;&#x5BA2;&#x6236;&#x4F86;&#x63A1;&#x7528;&#x6211;&#x5011;&#x7684;&#x7522;&#x54C1;&#x3002;</p>
<p>&#x5728;&#x9019;&#x7B46;&#x4F75;&#x8CFC;&#x6697;&#x4E0A;&#x6211;&#x5011;&#x4E26;&#x6C92;&#x6709;&#x4ED8;&#x51FA;&#x4EFB;&#x4F55;&#x7684;&#x73FE;&#x91D1;&#xFF0C;&#x53EA;&#x662F;&#x7528;&#x516C;&#x53F8;&#x7684;&#x80A1;&#x7968;&#xFF0C;&#x53BB;&#x63DB;&#x4F86;&#x4E86;&#x9019;&#x9593;&#x516C;&#x53F8;&#xFF0C;&#x5C0D;&#x65BC;&#x9280;&#x884C;&#x4F86;&#x8AAA;&#xFF0C;&#x4ED6;&#x5011;&#x4E5F;&#x5F88;&#x6A02;&#x898B;&#x53EF;&#x4EE5;&#x5C07;&#x50B5;&#x6B0A;&#xFF0C;&#x63DB;&#x6210;&#x5C0D;&#x53E6;&#x4E00;&#x9593;&#x516C;&#x53F8;&#x7684;&#x80A1;&#x4EFD;&#xFF0C;&#x53EF;&#x4EE5;&#x53C3;&#x8207;&#x4E0B;&#x4E00;&#x8F2A;&#x7684;&#x6A02;&#x900F;&#x958B;&#x734E;&#x3002;&#x5BE6;&#x969B;&#x4E0A;&#x9280;&#x884C;&#x9019;&#x4E00;&#x7B46;&#x8CED;&#x5C0D;&#x4E86;&#xFF0C;&#x5728;&#x4E00;&#x5E74;&#x534A;&#x5F8C;&#xFF0C;&#x98DB;&#x5411;&#x8CE3;&#x6389;&#x5F8C;&#xFF0C;&#x4ED6;&#x5011;&#x7528;&#x6578;&#x500D;&#x7684;&#x50F9;&#x503C;&#x56DE;&#x6536;&#x4E86;&#x9019;&#x7B46;&#x50B5;&#x6B0A;&#x3002;</p>
<h1 id="&#x4FE1;&#x7528;&#x8CB8;&#x6B3E;">&#x4FE1;&#x7528;&#x8CB8;&#x6B3E;</h1>
<p>&#x5728;&#x4E0A;&#x4E00;&#x7AE0;&#x6211;&#x63D0;&#x5230;&#xFF0C;&#x5728;&#x53F0;&#x7063;&#x4E2D;&#x5C0F;&#x4F01;&#x696D;&#x5411;&#x9280;&#x884C;&#x8CB8;&#x6B3E;&#xFF0C;&#x662F;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x623F;&#x5730;&#x7522;&#x7576;&#x62B5;&#x62BC;&#x54C1;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x7F8E;&#x570B;&#xFF0C;&#x4E2D;&#x5C0F;&#x4F01;&#x696D;&#x53EF;&#x4EE5;&#x900F;&#x904E;&#x8DDF;&#x9280;&#x884C;&#x9593;&#x7684;&#x5F80;&#x4F86;&#xFF0C;&#x5EFA;&#x7ACB;&#x300C;&#x4FE1;&#x7528;&#x984D;&#x5EA6;&#x300D;&#xFF0C;&#x4E0D;&#x7528;&#x63D0;&#x4F9B;&#x62B5;&#x62BC;&#x54C1;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x8F03;&#x9AD8;&#x7684;&#x5229;&#x7387;&#x8DDF;&#x9280;&#x884C;&#x8CB8;&#x6B3E;&#x3002;&#x50CF;&#x662F;&#x4E0A;&#x8FF0;&#x7684; InboundScore &#xFF0C;&#x5C31;&#x8DDF;&#x9280;&#x884C;&#x501F;&#x4E86;&#x4E03;&#x5341;&#x842C;&#x7F8E;&#x91D1;&#x7684;&#x4FE1;&#x7528;&#x8CB8;&#x6B3E;&#x3002;&#x4FD7;&#x8A71;&#x8AAA;&#x6709;&#x501F;&#x6709;&#x9084;&#x518D;&#x501F;&#x4E0D;&#x96E3;&#xFF0C;&#x5275;&#x696D;&#x4E0D;&#x662F;&#x6BCF;&#x4E00;&#x6B21;&#x90FD;&#x6703;&#x6709;&#x597D;&#x7D50;&#x679C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6536;&#x5C3E;&#x4E0B;&#x53F0;&#x8981;&#x505A;&#x7684;&#x6F02;&#x4EAE;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6536;&#x5C3E;&#x6536;&#x5F97;&#x597D;&#xFF0C;&#x9280;&#x884C;&#x89BA;&#x5F97;&#x4F60;&#x662F;&#x500B;&#x53EF;&#x4FE1;&#x8CF4;&#x7684;&#x7D93;&#x71DF;&#x8005;&#xFF0C;&#x90A3;&#x9EBC;&#x672A;&#x4F86;&#x624D;&#x6709;&#x7E7C;&#x7E8C;&#x4EA4;&#x6613;&#x7684;&#x53EF;&#x80FD;&#x3002;</p>
<p>&#x6211;&#x66FE;&#x554F;&#x904E;&#x53F0;&#x7063;&#x7684;&#x9280;&#x884C;&#x7684;&#x4E2D;&#x5C0F;&#x4F01;&#x696D;&#x4F01;&#x696D;&#x8655;&#xFF0C;&#x6709;&#x6C92;&#x6709;&#x5728;&#x7D93;&#x71DF;&#x300C;&#x4F01;&#x696D;&#x8CC7;&#x8A0A;&#x4EA4;&#x6D41;&#x300D;&#x9019;&#x4E00;&#x584A;&#xFF0C;&#x5E6B;&#x5F80;&#x4F86;&#x7684;&#x4E2D;&#x5C0F;&#x4F01;&#x696D;&#x4ECB;&#x5C11;&#x5BA2;&#x6236;&#xFF0C;&#x7B54;&#x6848;&#x662F;&#x6C92;&#x6709;&#xFF1B;&#x6211;&#x731C;&#x60F3;&#x539F;&#x56E0;&#x662F;&#x53F0;&#x7063;&#x9019;&#x908A;&#x9280;&#x884C;&#x4E0D;&#x6D41;&#x884C;&#x4FE1;&#x7528;&#x8CB8;&#x6B3E;&#x7684;&#x56E0;&#x7D20;&#x3002;</p>
<p>&#x5728;&#x570B;&#x5916;&#xFF0C;&#x65B0;&#x5275;&#x516C;&#x53F8;&#x662F;&#x53EF;&#x4EE5;&#x9760;&#x8DDF;&#x9280;&#x884C;&#x9577;&#x671F;&#x7684;&#x5408;&#x4F5C;&#xFF0C;&#x6162;&#x6162;&#x7684;&#x7D2F;&#x7A4D;&#x4FE1;&#x7528;&#xFF0C;&#x62FF;&#x5230;&#x4E0D;&#x5C11;&#x7684;&#x4FE1;&#x7528;&#x984D;&#x5EA6;&#xFF0C;&#x8B93;&#x516C;&#x53F8;&#x53EF;&#x4EE5;&#x505A;&#x77ED;&#x671F;&#x7684;&#x8CC7;&#x91D1;&#x8ABF;&#x5EA6;&#xFF0C;&#x50CF;&#x662F;&#x4E0A;&#x8FF0;&#x7684; InboundScore &#xFF0C;&#x5C31;&#x8DDF;&#x9280;&#x884C;&#x501F;&#x4E86;&#x4E03;&#x5341;&#x842C;&#x7F8E;&#x91D1;&#x7684;&#x4FE1;&#x7528;&#x8CB8;&#x6B3E;&#xFF0C;&#x800C;&#x6211;&#x518D;&#x524D;&#x4E00;&#x9593;&#x65B0;&#x5275;&#x516C;&#x53F8;&#x5C31;&#x8DDF;&#x9280;&#x884C;&#x6709;&#x300C;&#x516D;&#x767E;&#x842C;&#x7F8E;&#x91D1;&#x300D;&#x7684;&#x984D;&#x5EA6;&#x53EF;&#x4EE5;&#x8ABF;&#x52D5;&#xFF0C;&#x5728; 2008 &#x91D1;&#x878D;&#x5371;&#x6A5F;&#x6642;&#xFF0C;&#x6211;&#x5011;&#x9760;&#x9019;&#x7B46;&#x8CC7;&#x91D1;&#x6E21;&#x904E;&#x4E86;&#x4E00;&#x6B21;&#x73FE;&#x91D1;&#x7F3A;&#x53E3;&#x3002;</p>
<p>&#x5C0D;&#x300C;&#x4FE1;&#x7528;&#x984D;&#x5EA6;&#x300D;&#x4E0D;&#x719F;&#x6089;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x5047;&#x8A2D;&#x4F60;&#x662F;&#x4E00;&#x9593;&#x9910;&#x5EF3;&#x7684;&#x8001;&#x95C6;&#xFF0C;&#x5E73;&#x6642;&#x5C31;&#x662F;&#x65E9;&#x4E0A;&#x8CB7;&#x6771;&#x897F;&#x9032;&#x4F86;&#x665A;&#x4E0A;&#x8CE3;&#xFF0C;&#x8CFA;&#x9EDE;&#x5FAE;&#x8584;&#x7684;&#x5229;&#x6F64;&#xFF1B;&#x4F46;&#x662F;&#x4ECA;&#x5929;&#x78B0;&#x4E0A;&#x904E;&#x5E74;&#xFF0C;&#x4F11;&#x5E02;&#x4E94;&#x5929;&#xFF0C;&#x8981;&#x589E;&#x52A0;&#x5EAB;&#x5B58;&#x4F46;&#x6C92;&#x8CC7;&#x91D1;&#x600E;&#x9EBC;&#x8FA6;&#xFF1B;&#x9019;&#x6642;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x9760;&#x904E;&#x53BB;&#x8DDF;&#x9280;&#x884C;&#x7684;&#x5F80;&#x4F86;&#xFF0C;&#x9760;&#x8457;&#x4FE1;&#x7528;&#x5C31;&#x8DDF;&#x9280;&#x884C;&#x501F;&#x8CC7;&#x91D1;&#x4F86;&#x9031;&#x8F49;&#x3002;</p>
<p>&#x7576;&#x7136;&#x9019;&#x4FE1;&#x7528;&#x984D;&#x5EA6;&#x4E0D;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x4E00;&#x6B21;&#x62FF;&#x592A;&#x591A;&#x4F86;&#x7528;&#x7684;&#xFF0C;&#x82E5;&#x662F;&#x4F60;&#x4E00;&#x6B21;&#x63D0;&#x9818;&#x592A;&#x591A;&#xFF0C;&#x9280;&#x884C;&#x5C31;&#x6703;&#x628A;&#x984D;&#x5EA6;&#x6536;&#x6E1B;&#x3002;</p>
<p>&#x7531;&#x65BC;&#x9019;&#x4E9B;&#x8CB8;&#x6B3E;&#x662F;&#x4FE1;&#x7528;&#x8CB8;&#x6B3E;&#xFF0C;&#x6240;&#x4EE5;&#x82E5;&#x662F;&#x516C;&#x53F8;&#x5012;&#x9589;&#xFF0C;&#x516C;&#x53F8;&#x7684;&#x80A1;&#x6771;&#x8001;&#x95C6;&#x662F;&#x4E0D;&#x7528;&#x8CA0;&#x8CAC;&#x627F;&#x64D4;&#x7684;&#x8CA0;&#x50B5;&#x7684;&#xFF0C;&#x4F46;&#x4FD7;&#x8A71;&#x8AAA;&#x6709;&#x501F;&#x6709;&#x9084;&#x518D;&#x501F;&#x4E0D;&#x96E3;&#xFF0C;&#x5275;&#x696D;&#x4E0D;&#x662F;&#x6BCF;&#x4E00;&#x6B21;&#x90FD;&#x6703;&#x6709;&#x597D;&#x7D50;&#x679C;&#x7684;&#xFF0C;&#x70BA;&#x4E86;&#x4E0B;&#x6B21;&#x5275;&#x696D;&#x80FD;&#x518D;&#x8DDF;&#x9280;&#x884C;&#x501F;&#x5230;&#x9322;&#xFF0C;&#x516C;&#x53F8;&#x7684;&#x8001;&#x95C6;&#x5728;&#x516C;&#x53F8;&#x5012;&#x9589;&#x6642;&#xFF0C;&#x4E5F;&#x6703;&#x6536;&#x5C3E;&#x6536;&#x7684;&#x6F02;&#x4EAE;&#x7684;&#xFF1B;&#x50CF;&#x662F;&#x5E6B;&#x8CB7;&#x4E0B;&#x516C;&#x53F8;&#x8CC7;&#x7522;&#x7684;&#x516C;&#x53F8;&#x518D;&#x5DE5;&#x4F5C;&#x500B;&#x534A;&#x5E74;&#xFF0C;&#x8B93;&#x8CC7;&#x7522;&#x7684;&#x8F49;&#x79FB;&#x9806;&#x5229;&#x9032;&#x884C;&#x3002;</p>
<p>&#x5728;&#x53F0;&#x7063;&#x5C31;&#x6C92;&#x6709;&#x9019;&#x4E00;&#x56DE;&#x4E8B;&#x4E86;&#xFF0C;&#x4E2D;&#x5C0F;&#x4F01;&#x696D;&#x653E;&#x6B3E;&#xFF0C;&#x9084;&#x662F;&#x591A;&#x662F;&#x8981;&#x6C42;&#x4F01;&#x696D;&#x7684;&#x7D93;&#x71DF;&#x8005;&#xFF0C;&#x7528;&#x500B;&#x4EBA;&#x8CC7;&#x7522;&#xFF08;&#x623F;&#x5B50;&#xFF09;&#x505A;&#x62B5;&#x62BC;&#xFF0C;&#x56E0;&#x70BA;&#x516C;&#x53F8;&#x7684;&#x50B5;&#x52D9;&#x53D7;&#x5230;&#x4E86;&#x4FDD;&#x969C;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x6C92;&#x6709;&#x653E;&#x90A3;&#x9EBC;&#x591A;&#x5FC3;&#x529B;&#x5728;&#x4EF2;&#x4ECB;&#x5BA2;&#x6236;&#x696D;&#x52D9;&#x3001;&#x78BA;&#x4FDD;&#x50B5;&#x6B0A;&#x80FD;&#x56DE;&#x6536;&#x4E4B;&#x4E0A;&#x3002;&#x6B64;&#x5916;&#x53F0;&#x7063;&#x591A;&#x662F;&#x88FD;&#x9020;&#x696D;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x6A5F;&#x53F0;&#x5C31;&#x53EF;&#x4EE5;&#x751F;&#x7522;&#x53EF;&#x4EE5;&#x6436;&#x5BA2;&#x6236;&#xFF0C;&#x5546;&#x52D9;&#x5408;&#x7D04;&#x4E0D;&#x503C;&#x9322;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x7576;&#x6210;&#x516C;&#x53F8;&#x8CC7;&#x7522;&#x4F86;&#x770B;&#x3002;</p>
<h1 id="&#x7D50;&#x8A9E;">&#x7D50;&#x8A9E;</h1>
<p>&#x77FD;&#x8C37;&#x5C31;&#x9019;&#x6A23;&#xFF0C;&#x4E0D;&#x53EA;&#x662F;&#x6280;&#x8853;&#x6D41;&#x901A;&#x7684;&#x5FEB;&#xFF0C;&#x5546;&#x52D9;&#x8CC7;&#x8A0A;&#x6D41;&#x901A;&#x7684;&#x901F;&#x5EA6;&#x4E5F;&#x5FEB;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x624D;&#x9020;&#x5C31;&#x4E86;&#x5275;&#x696D;&#x7684;&#x571F;&#x58E4;&#x3002;&#x4E0D;&#x77E5;&#x9053;&#x53F0;&#x7063;&#x9019;&#x9EBC;&#x591A;&#x9280;&#x884C;&#xFF0C;&#x90A3;&#x5929;&#x624D;&#x6703;&#x6709;&#x4E00;&#x5BB6;&#x8DF3;&#x4E0B;&#x4F86;&#x958B;&#x59CB;&#x73A9;&#x300C;&#x8CC7;&#x8A0A;&#x670D;&#x52D9;&#x7522;&#x696D;&#x653E;&#x6B3E;&#x300D;&#x7684;&#x9019;&#x4E00;&#x584A;&#xFF0C;&#x9664;&#x4E86;&#x8CC7;&#x91D1;&#x5916;&#xFF0C;&#x4E5F;&#x505A;&#x8CC7;&#x8A0A;&#x50B3;&#x64AD;&#x7684;&#x4E2D;&#x9593;&#x4EBA;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="27.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 獎助條例">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"談中小企業放款","level":"1.2.1","depth":2,"next":{"title":"獎助條例","level":"1.2.2","depth":2,"path":"27.md","ref":"27.md","articles":[]},"previous":{"title":"我在飛向的日子","level":"1.2","depth":1,"ref":"","articles":[{"title":"談中小企業放款","level":"1.2.1","depth":2,"path":"26.md","ref":"26.md","articles":[]},{"title":"獎助條例","level":"1.2.2","depth":2,"path":"27.md","ref":"27.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"26.md","mtime":"2020-10-02T23:32:31.359Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-02T23:33:11.086Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

