
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>獎助條例 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="26.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    我在飛向的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="26.html">
            
                <a href="26.html">
            
                    
                    談中小企業放款
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.2" data-path="27.html">
            
                <a href="27.html">
            
                    
                    獎助條例
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    在大公司打工的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="31.html">
            
                <a href="31.html">
            
                    
                    帝王
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="32.html">
            
                <a href="32.html">
            
                    
                    組織與企業章呈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="36.html">
            
                <a href="36.html">
            
                    
                    祖傳代碼與組織知識的傳承
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="38.html">
            
                <a href="38.html">
            
                    
                    靠數據指標（KPI）引導團隊
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    矽谷雜談
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="41.html">
            
                <a href="41.html">
            
                    
                    併聘 Acquhire
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="42.html">
            
                <a href="42.html">
            
                    
                    企業併購產品整合問題
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    大齡工程師的挑戰
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="51.html">
            
                <a href="51.html">
            
                    
                    程式設計師潛水夫症
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="52.html">
            
                <a href="52.html">
            
                    
                    工程師年齡歧視的真象
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    給年輕人的建議
            
                </span>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >獎助條例</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x734E;&#x52A9;&#x689D;&#x4F8B;">&#x734E;&#x52A9;&#x689D;&#x4F8B;</h1>
<p><a href="https://zh.m.wikipedia.org/zh-hant/%E6%AD%A3%E7%BE%A9%EF%BC%9A%E4%B8%80%E5%A0%B4%E6%80%9D%E8%BE%A8%E4%B9%8B%E6%97%85" target="_blank">&#x9081;&#x514B;&#x723E;&#xFF0E;&#x6851;&#x5FB7;&#x723E;&#x7684;&#x300C;&#x6B63;&#x7FA9;&#xFF1A;&#x4E00;&#x5834;&#x601D;&#x8FA8;&#x4E4B;&#x65C5;&#x300D;</a> &#x662F;&#x54C8;&#x4F5B;&#x5927;&#x5B78;&#x516C;&#x958B;&#x653E;&#x5728;&#x7DB2;&#x8DEF;&#x4E0A;&#x7684;&#x7DDA;&#x4E0A;&#x8AB2;&#x7A0B;&#xFF0C;&#x5728;&#x7B2C;&#x4E00;&#x5802;&#x8AB2;&#x6642;&#xFF0C;&#x8B1B;&#x5E2B;&#x5C31;&#x8AAA;&#xFF0C;&#x9019;&#x662F;&#x4E00;&#x9580;&#x6703;&#x5F71;&#x97FF;&#x4F60;&#x4E00;&#x8F29;&#x5B50;&#x7684;&#x8AB2;&#x7A0B;&#xFF0C;&#x5C07;&#x6539;&#x8B8A;&#x4F60;&#x770B;&#x4E8B;&#x60C5;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5982;&#x679C;&#x6C92;&#x6709;&#x6E96;&#x5099;&#x597D;&#x7684;&#x8A71;&#xFF0C;&#x4E0D;&#x8981;&#x4E0A;&#x9019;&#x9580;&#x8AB2;&#x7A0B;&#x3002;&#x679C;&#x771F;&#xFF0C;&#x9019;&#x5802;&#x8AB2;&#x6210;&#x70BA;&#x5F71;&#x97FF;&#x6211;&#x4E00;&#x8F29;&#x5B50;&#x6700;&#x6DF1;&#x7684;&#x4E00;&#x5802;&#x8AB2;&#x7A0B;&#x3002;</p>
<p>&#x9019;&#x5802;&#x8AB2;&#x7A0B;&#x662F;&#x8B1B;&#x54F2;&#x5B78;&#x53F2;&#x7684;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x5802;&#x5BA2;&#x4E0A;&#x5230;&#x4E9E;&#x91CC;&#x65AF;&#x591A;&#x5FB7;&#x7684;&#x300C;&#x76EE;&#x7684;&#x8AD6;&#x300D;&#xFF0C;&#x76EE;&#x7684;&#x8AD6;&#x8A8D;&#x70BA;<a href="https://zh.m.wikipedia.org/wiki/%E7%9B%AE%E7%9A%84%E8%AB%96#%E5%A4%96%E5%9C%A8%E5%92%8C%E5%85%A7%E5%9C%A8" target="_blank">&#x300C;&#x67D0;&#x6771;&#x897F;&#x7684;&#x5B58;&#x5728;&#x76EE;&#x7684;&#xFF0C;&#x662F;&#x70BA;&#x4E86;&#x81EA;&#x7136;&#x800C;&#x7136;&#x9054;&#x6210;&#x5B8C;&#x5584;&#x81EA;&#x5DF1;&#x9019;&#x500B;&#x76EE;&#x7684;&#x300D;</a>&#xFF0C;&#x5728;&#x8AB2;&#x5802;&#x4E0A;&#x63A2;&#x8A0E;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x500B;&#x7A00;&#x6709;&#x7684;&#x7269;&#x8CC7;&#xFF0C;&#x5012;&#x5E95;&#x8A72;&#x662F;&#x7D66;&#x8AB0;&#x7528;&#x624D;&#x597D;&#xFF0C;&#x50CF;&#x662F;&#x4E00;&#x500B;&#x7DB2;&#x7403;&#x5834;&#xFF0C;&#x5012;&#x5E95;&#x662F;&#x8A72;&#x8B93;&#x6BCF;&#x500B;&#x4EBA;&#x5E73;&#x5747;&#x5206;&#x6524;&#x4F7F;&#x7528;&#x6642;&#x9593;&#xFF0C;&#x9084;&#x662F;&#x8AAA;&#x8A72;&#x7559;&#x7D66;&#x80FD;&#x5920;&#x6210;&#x70BA;&#x8077;&#x696D;&#x7DB2;&#x7403;&#x9078;&#x624B;&#x7684;&#x4EBA;&#x4F7F;&#x7528;&#x5462;&#xFF1F;&#x4EE5;&#x76EE;&#x5730;&#x8AD6;&#x4F86;&#x8AAA;&#xFF0C;&#x6211;&#x5011;&#x61C9;&#x8A72;&#x628A;&#x7403;&#x5834;&#x7559;&#x7D66;&#x80FD;&#x5920;&#x767C;&#x63EE;&#x5834;&#x5730;&#x6700;&#x5927;&#x6548;&#x7528;&#x7684;&#x4EBA;&#x4F7F;&#x7528;&#x624D;&#x5C0D;&#x3002;</p>
<p>&#x9019;&#x7A2E;&#x54F2;&#x5B78;&#x4E0A;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x7576;&#x6642;&#x5C31;&#x8B93;&#x6211;&#x9023;&#x60F3;&#x5230;&#x53F0;&#x7063;&#x7684;&#x9F4A;&#x982D;&#x5F0F;&#x5E73;&#x7B49;&#x7684;&#x7522;&#x696D;&#x734E;&#x52A9;&#x689D;&#x4F8B;&#xFF0C;&#x734E;&#x52F5;&#x8DDF;&#x88DC;&#x52A9;&#x672C;&#x662F;&#x5169;&#x4EF6;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x53F0;&#x7063;&#x5E38;&#x5E38;&#x88AB;&#x6DF7;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6210;&#x70BA;&#x300C;&#x734E;&#x52A9;&#x689D;&#x4F8B;&#x300D;&#x3002;</p>
<p>&#x653F;&#x5E9C;&#x767C;&#x9322;&#x6709;&#x5169;&#x7A2E;&#x65B9;&#x5F0F;&#xFF1A;</p>
<ol>
<li>&#x734E;&#x52F5;&#xFF1A;&#x505A;&#x7684;&#x662F;&#x63D0;&#x9AD8;&#x52DD;&#x5229;&#x597D;&#x8655;&#xFF0C;&#x589E;&#x52A0;&#x53C3;&#x8207;&#x7AF6;&#x722D;&#x7684;&#x8A98;&#x56E0;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x80FD;&#x53D7;&#x734E;&#x7684;&#x8981;&#x5C11;&#xFF0C;&#x734E;&#x91D1;&#x8981;&#x9AD8;&#xFF0C;&#x67D0;&#x7A2E;&#x7A0B;&#x5EA6;&#x4E0A;&#x4F86;&#x8B1B;&#x662F;&#x8B93;&#x5F37;&#x8005;&#x8D8A;&#x5F37;&#xFF0C;&#xFF0C;&#x8B93;&#x4ED6;&#x5011;&#x6709;&#x66F4;&#x591A;&#x7684;&#x8CC7;&#x6E90;&#xFF0C;&#x8907;&#x88FD;&#x6210;&#x529F;&#x7684;&#x6848;&#x4F8B;&#x3002;</li>
<li>&#x88DC;&#x52A9;&#xFF1A;&#x5247;&#x662F;&#x964D;&#x4F4E;&#x7AF6;&#x722D;&#x7684;&#x9580;&#x574E;&#xFF0C;&#x8B93;&#x80FD;&#x6709;&#x66F4;&#x591A;&#x4EBA;&#x53C3;&#x8207;&#x7AF6;&#x722D;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x88DC;&#x52A9;&#x7684;&#x9580;&#x574E;&#x8981;&#x4F4E;&#xFF0C;&#x91D1;&#x984D;&#x4E0D;&#x7528;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x4EF6;&#x6578;&#x8981;&#x662F;&#x4EBA;&#x4EBA;&#x6709;&#x734E;&#x3002;&#x9F4A;&#x982D;&#x5F0F;&#x6295;&#x6CE8;&#x5728;&#x8CC7;&#x6E90;&#x994B;&#x4E4F;&#x7684;&#x5C0F;&#x578B;&#x516C;&#x53F8;&#xFF0C;&#x5E0C;&#x671B;&#x6709;&#x671D;&#x4E00;&#x65E5;&#x6703;&#x9577;&#x5927;&#x3002;</li>
</ol>
<p>&#x5F9E;&#x5927;&#x5B78;&#x5C0F;&#x5B78;&#x5728;&#x904B;&#x52D5;&#x8CC7;&#x6E90;&#x7684;&#x6295;&#x6CE8;&#x7684;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#x7684;&#x4F8B;&#x5B50;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x5E6B;&#x5927;&#x5BB6;&#x7406;&#x89E3;&#x6211;&#x6240;&#x8AAA;&#x7684;&#x3002;</p>
<p>&#x5C0F;&#x5B78;&#x7684;&#x904B;&#x52D5;&#x8CC7;&#x6E90;&#xFF0C;&#x662F;&#x7D66;&#x5927;&#x5BB6;&#x90FD;&#x6709;&#x63A5;&#x89F8;&#x7684;&#x6A5F;&#x6703;&#xFF0C;&#x8B93;&#x4EBA;&#x6709;&#x6A5F;&#x6703;&#x9069;&#x6027;&#x767C;&#x63EE;&#x3002;
&#x5927;&#x5B78;&#x7684;&#x904B;&#x52D5;&#x8CC7;&#x6E90;&#xFF0C;&#x8CC7;&#x6E90;&#x662F;&#x7D66;&#x6709;&#x5F97;&#x734E;&#x6A5F;&#x6703;&#x4EBA;&#x4F7F;&#x7528;&#x7684;&#xFF0C;&#x662F;&#x8B93;&#x6709;&#x80FD;&#x4E4B;&#x4EBA;&#x80FD;&#x5F80;&#x66F4;&#x9AD8;&#x5C64;&#x6B21;&#x767C;&#x5C55;&#x3002;</p>
<p>&#x734E;&#x52F5;&#x3001;&#x88DC;&#x52A9;&#x662F;&#x5169;&#x4EF6;&#x4E8B;&#xFF0C;&#x4E0D;&#x80FD;&#x6DF7;&#x70BA;&#x4E00;&#x8AC7;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x6DF7;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x597D;&#x90FD;&#x4E0D;&#x8981;&#x7528;&#x3002;</p>
<p>&#x524D;&#x8005;&#x90FD;&#x662F;&#x9055;&#x53CD;&#x7D0D;&#x7A05;&#x4EBA;&#x7684;&#x60C5;&#x611F;&#x7684;&#xFF0C;&#x6211;&#x66FE;&#x53C3;&#x5BB6;&#x4E00;&#x5834;&#x53F0;&#x5317;&#x5E02;&#x653F;&#x5E9C;&#x88DC;&#x52A9;&#x5916;&#x5546;&#x7684;&#x6D3B;&#x52D5;&#xFF0C;&#x5728;&#x6D3B;&#x52D5;&#x4E0A;&#xFF0C;&#x53F0;&#x5317;&#x5E02;&#x653F;&#x5E9C;&#x8ACB;&#x5169;&#x500B;&#x53D7;&#x734E;&#x52A9;&#x7684;&#x5EE0;&#x5546;&#x4E0A;&#x53F0;&#x6F14;&#x8B1B;&#xFF0C;&#x53D7;&#x88DC;&#x52A9;&#x8005;&#x4E00;&#x5BB6;&#x662F;&#x81CD;&#x5E36;&#x8840;&#x5E02;&#x5834;&#x9F8D;&#x982D;&#x3001;&#x53E6;&#x4E00;&#x5BB6;&#x5247;&#x662F;App&#x65B0;&#x9032;&#x5546;&#x5BB6;&#x3002;</p>
<p>&#x5C0D;&#x5E74;&#x8CFA;&#x4E0A;&#x5104;&#x7684;&#x81CD;&#x5E36;&#x8840;&#x9F8D;&#x982D;&#x4F86;&#x8AAA;&#xFF0C;&#x90A3;&#x5E7E;&#x767E;&#x842C;&#x7684;&#x88DC;&#x52A9;&#x81EA;&#x7136;&#x662F;&#x9326;&#x4E0A;&#x6DFB;&#x82B1;&#xFF1B;&#x53E6;&#x4E00;&#x8005;App&#x5546;&#x5BB6;&#xFF0C;&#x505A;&#x4E86;&#x5341;&#x96BB;&#x7A0B;&#x5F0F;&#x5427;&#xFF0C;&#x7E3D;&#x4E0B;&#x8F09;&#x91CF;&#x4E0D;&#x6284;&#x904E;&#x4E00;&#x842C;&#x6B21;&#xFF0C;&#x4ECD;&#x662F;&#x53D7;&#x88DC;&#x52A9;&#xFF0C;&#x7576;&#x7136;&#x60C5;&#x611F;&#x4E0A;&#x5C31;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x9019;&#x4E5F;&#x662F;&#x70BA;&#x4EC0;&#x9EBC;&#x53F0;&#x7063;&#x734E;&#x52A9;&#x689D;&#x4F8B;&#x57F7;&#x884C;&#x4E0B;&#x4F86;&#x6703;&#x8B8A;&#x4ECA;&#x65E5;&#x7684;&#x72C0;&#x6CC1;&#xFF0C;&#x56E0;&#x70BA;&#xFF0C;&#x5927;&#x773E;&#x90FD;&#x89BA;&#x5F97;&#x53D7;&#x88DC;&#x52A9;&#x7684;&#x4EBA;&#x505A;&#x7684;&#x4E0D;&#x597D;&#xFF0C;&#x600E;&#x9EBC;&#x53EF;&#x4EE5;&#x53D7;&#x88DC;&#x52A9;&#xFF1B;&#x4E45;&#x4E86;&#xFF0C;&#x81EA;&#x7136;&#x516C;&#x52D9;&#x54E1;&#x70BA;&#x4E86;&#x4E0D;&#x88AB;&#x7F75;&#xFF0C;&#x6700;&#x5F8C;&#x4E5F;&#x53EA;&#x6703;&#x9326;&#x4E0A;&#x6DFB;&#x82B1;&#xFF0C;&#x53EA;&#x6703;&#x9080;&#x5DF2;&#x7D93;&#x6210;&#x529F;&#x7684;&#x5546;&#x5BB6;&#x4F86;&#x53D7;&#x88DC;&#x52A9;&#x3002;</p>
<p>&#x6700;&#x5F8C;&#x8AC7;&#x8AC7;&#xFF0C;&#x70BA;&#x4EC0;&#x9EBC;&#x4E0D;&#x767C;&#x88DC;&#x52A9;&#x6BD4;&#x8F03;&#x597D;&#x5462;&#xFF1F;&#x66FE;&#x6709;&#x670B;&#x53CB;&#x554F;&#x6211;&#xFF0C;&#x300E;&#x96E3;&#x5230;&#x7F8E;&#x570B;&#x4E0D;&#x6703;&#x50CF;&#x53F0;&#x7063;&#x4E00;&#x6A23;&#xFF0C;&#x6709;&#x4E00;&#x5806;&#x5438;&#x7F8E;&#x570B;&#x653F;&#x5E9C;&#x8840;&#x7684;&#x516C;&#x53F8;&#x55CE;&#xFF1F;&#x300F;</p>
<p>&#x6211;&#x7684;&#x56DE;&#x61C9;&#x662F;&#xFF0C;&#x4E00;&#x5730;&#x7684;&#x5275;&#x696D;&#x571F;&#x56B7;&#x597D;&#xFF0C;&#x5438;&#x8840;&#x9B3C;&#x5C31;&#x5C11;&#xFF0C;&#x6709;&#x500B;&#x5DF2;&#x5931;&#x806F;&#x7684;&#x670B;&#x53CB;&#x7533;&#x8ACB; NSF Grant &#xFF0C;&#x5BEB;&#x4E86;&#x5E7E;&#x5341;&#x9801;&#x7684;&#x6587;&#x7AE0;&#x8DDF;&#x653F;&#x5E9C;&#x8981;&#x7533;&#x8ACB;25&#x842C;&#x7F8E;&#x91D1;&#x7684;&#x88DC;&#x52A9;&#xFF1B;&#x73FE;&#x5728;&#x6211;&#x56DE;&#x60F3;&#x8D77;&#x4F86;&#xFF0C;&#x82E5;&#x662F;&#x628A;&#x6642;&#x9593;&#x7701;&#x4E0B;&#x4F86;&#x6539;&#x627E; Angle Funding, VC &#xFF0C;&#x4ED6;&#x61C9;&#x8A72;&#x53EF;&#x4EE5;&#x5F04;&#x5230;&#x500B;&#x5169;&#x767E;&#x842C;&#x7F8E;&#x91D1;&#x7684;&#x3002;&#x7576;&#x7136;&#x627E;VC&#x7684;&#x80A1;&#x6B0A;&#x7D50;&#x69CB;&#x6703;&#x6709;&#x8B8A;&#xFF0C;&#x4F46;&#x662F;VC&#x80FD;&#x5E36;&#x4F86;&#x7684;&#x696D;&#x52D9;&#x95DC;&#x4FC2;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x653F;&#x5E9C;&#x88DC;&#x52A9;&#x80FD;&#x5E6B;&#x4E0A;&#x5FD9;&#x7684;&#x3002;</p>
<p>&#x4E00;&#x5730;&#x7684;&#x5546;&#x696D;&#x6D3B;&#x52D5;&#x8D8A;&#x6D3B;&#x7D61;&#xFF0C;&#x8981;&#x9760;&#x653F;&#x5E9C;&#x95DC;&#x4FC2;&#x5403;&#x98EF;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x8D8A;&#x5C11;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="26.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 談中小企業放款">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"獎助條例","level":"1.2.2","depth":2,"next":{"title":"在大公司打工的日子","level":"1.3","depth":1,"ref":"","articles":[{"title":"帝王","level":"1.3.1","depth":2,"path":"31.md","ref":"31.md","articles":[]},{"title":"組織與企業章呈","level":"1.3.2","depth":2,"path":"32.md","ref":"32.md","articles":[]},{"title":"祖傳代碼與組織知識的傳承","level":"1.3.3","depth":2,"path":"36.md","ref":"36.md","articles":[]},{"title":"靠數據指標（KPI）引導團隊","level":"1.3.4","depth":2,"path":"38.md","ref":"38.md","articles":[]}]},"previous":{"title":"談中小企業放款","level":"1.2.1","depth":2,"path":"26.md","ref":"26.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"27.md","mtime":"2020-10-02T23:35:57.128Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-02T23:36:34.685Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

