
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>祖傳代碼與組織知識的傳承 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="38.html" />
    
    
    <link rel="prev" href="32.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    我在飛向的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="26.html">
            
                <a href="26.html">
            
                    
                    談中小企業放款
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="27.html">
            
                <a href="27.html">
            
                    
                    獎助條例
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    在大公司打工的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="31.html">
            
                <a href="31.html">
            
                    
                    帝王
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="32.html">
            
                <a href="32.html">
            
                    
                    組織與企業章呈
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.3" data-path="36.html">
            
                <a href="36.html">
            
                    
                    祖傳代碼與組織知識的傳承
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="38.html">
            
                <a href="38.html">
            
                    
                    靠數據指標（KPI）引導團隊
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    矽谷雜談
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="41.html">
            
                <a href="41.html">
            
                    
                    併聘 Acquhire
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="42.html">
            
                <a href="42.html">
            
                    
                    企業併購產品整合問題
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    大齡工程師的挑戰
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="51.html">
            
                <a href="51.html">
            
                    
                    程式設計師潛水夫症
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="52.html">
            
                <a href="52.html">
            
                    
                    工程師年齡歧視的真象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="53.html">
            
                <a href="53.html">
            
                    
                    遠端工作與工作環境研究
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    給年輕人的建議
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="62.html">
            
                <a href="62.html">
            
                    
                    該不該念博士
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >祖傳代碼與組織知識的傳承</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7956;&#x50B3;&#x4EE3;&#x78BC;&#x8207;&#x7D44;&#x7E54;&#x77E5;&#x8B58;&#x7684;&#x50B3;&#x627F;">&#x7956;&#x50B3;&#x4EE3;&#x78BC;&#x8207;&#x7D44;&#x7E54;&#x77E5;&#x8B58;&#x7684;&#x50B3;&#x627F;</h1>
<p>&#x5728;&#x77FD;&#x8C37;&#x9019;&#x908A;&#x8A31;&#x591A;&#x516C;&#x53F8;&#x5BA3;&#x50B3;&#x8AAA;&#x8981;&#x5DE5;&#x7A0B;&#x5E2B;&#x5169;&#x5E74;&#x63DB;&#x4E00;&#x6B21;&#x5DE5;&#x4F5C;&#xFF0C;&#x50CF;&#x662F;&#x9818;&#x82F1;&#x5E73;&#x5747;&#x5E74;&#x8CC7;&#x662F;&#x5169;&#x5E74;&#x591A;&#xFF0C;&#x6EFE;&#x77F3;&#x4E0D;&#x751F;&#x82D4;&#xFF0C;&#x7406;&#x7531;&#x662F;&#x5169;&#x5E74;&#x63DB;&#x4E00;&#x6B21;&#x5DE5;&#x4F5C;&#xFF0C;&#x5B78;&#x5230;&#x7684;&#x6771;&#x897F;&#x624D;&#x591A;&#xFF0C;&#x9032;&#x6B65;&#x7684;&#x624D;&#x5FEB;&#xFF0C;&#x6211;&#x5E74;&#x8F15;&#x7684;&#x6642;&#x5019;&#x4E5F;&#x771F;&#x7684;&#x5C31;&#x5169;&#x5E74;&#x63DB;&#x4E00;&#x6B21;&#x5DE5;&#x4F5C;&#xFF0C;&#x505A;&#x4E86;&#x8A31;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x6771;&#x897F;&#x3002;</p>
<p>&#x4E0D;&#x904E;&#x5E74;&#x7D00;&#x6F38;&#x9577;&#x4E4B;&#x5F8C;&#x53C8;&#x767C;&#x73FE;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x5B78;&#x518D;&#x5FEB;&#xFF0C;&#x771F;&#x6B63;&#x5728;&#x516C;&#x53F8;&#x5167;&#x6709;&#x751F;&#x7522;&#x529B;&#xFF0C;&#x662F;&#x4E00;&#x5E74;&#x4E4B;&#x5F8C;&#x7684;&#x4E8B;&#x4E86;&#xFF0C;&#x7576;&#x4F60;&#x4E86;&#x89E3;&#x516C;&#x53F8;&#x7684;&#x7A0B;&#x5F0F;&#x67B6;&#x69CB;&#x3001;&#x5546;&#x696D;&#x6A21;&#x5F0F;&#x3001;&#x5167;&#x90E8;&#x4EBA;&#x4E8B;&#x5F8C;&#x3001;&#x8207;&#x5718;&#x968A;&#x78E8;&#x5408;&#x597D;&#x5F8C;&#xFF0C;&#x624D;&#x771F;&#x6B63;&#x7684;&#x80FD;&#x5920;&#x9054;&#x5230;&#x9AD8;&#x751F;&#x7522;&#x529B;&#xFF0C;&#x9019;&#x6642;&#x5DF2;&#x7D93;&#x4E00;&#x5E74;&#x904E;&#x53BB;&#x4E86;&#xFF0C;&#x90A3;&#x70BA;&#x4EC0;&#x9EBC;&#x516C;&#x53F8;&#x8981;&#x5BA3;&#x5C0E;&#x8981;&#x9019;&#x4E9B;&#x6709;&#x9AD8;&#x751F;&#x7522;&#x529B;&#x7684;&#x54E1;&#x5DE5;&#x96E2;&#x958B;&#x5462;&#xFF1F;</p>
<p>&#x6211;&#x8A8D;&#x70BA;&#x4E00;&#x90E8;&#x4EFD;&#x7684;&#x539F;&#x56E0;&#x662F;&#x8981;&#x6E1B;&#x5C11;&#x300C;&#x7956;&#x50B3;&#x4EE3;&#x78BC;&#x300D;&#xFF08;Legacy Code&#xFF09;&#x7684;&#x6578;&#x91CF;&#xFF0C;&#x5BEB;&#x7A0B;&#x5F0F;&#x4E0D;&#x7BA1;&#x4E00;&#x958B;&#x59CB;&#x7684;&#x67B6;&#x69CB;&#x8A2D;&#x8A08;&#x7684;&#x518D;&#x7CBE;&#x826F;&#xFF0C;&#x514D;&#x4E0D;&#x4E86;&#x5728;&#x7A2E;&#x7A2E;&#x7684;&#x8B8A;&#x66F4;&#x4E4B;&#x5F8C;&#xFF0C;&#x958B;&#x59CB;&#x51FA;&#x73FE;&#x4E00;&#x4E9B;&#x4E0D;&#x662F;&#x90A3;&#x9EBC;&#x7CBE;&#x826F;&#x7684;&#x90E8;&#x4EFD;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x300C;&#x5FAE;&#x670D;&#x52D9;&#x300D;&#x7684;&#x67B6;&#x69CB;&#x4E0B;&#xFF0C;&#x5169;&#x500B;&#x670D;&#x52D9;&#x7684;&#x6E9D;&#x901A;&#xFF0C;&#x53EF;&#x80FD;&#x4E00;&#x958B;&#x59CB;&#x662F;&#x5728;&#x540C;&#x4E00;&#x500B;&#x4E3B;&#x6A5F;&#x4E0A;&#xFF0C;&#x50CF;&#x662F;&#x5E33;&#x865F;&#x7CFB;&#x7D71;&#x8DDF;&#x5E33;&#x52D9;&#x7CFB;&#x7D71;&#xFF0C;&#x4E00;&#x958B;&#x59CB;&#x662F;&#x5728;&#x4E00;&#x8D77;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5F8C;&#x4F86;&#x624D;&#x5207;&#x958B;&#xFF0C;&#x5728;&#x524D;&#x7AEF;&#x4E0A;&#x9084;&#x662F;&#x5047;&#x8A2D;&#x5169;&#x8005;&#x8CC7;&#x6599;&#x662F;&#x540C;&#x90E8;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5F8C;&#x7AEF;&#x7684;&#x5BE6;&#x4F5C;&#x5DF2;&#x7D93;&#x662F;&#x975E;&#x540C;&#x6B65;&#xFF0C;&#x4E2D;&#x9593;&#x900F;&#x904E;&#x67D0;&#x7A2E;&#x6A5F;&#x5236;&#x4F86;&#x4EA4;&#x63DB;&#x8CC7;&#x6599;&#xFF0C;&#x6709;&#x6642;&#x5019;&#x70BA;&#x4E86;&#x8D95;&#x4E0A;&#x7DDA;&#x5BE6;&#x7A0B;&#xFF0C;&#x5C31;&#x6703;&#x6709;&#x5F88;&#x591A;&#x300C;&#x79D8;&#x5BC6;&#x7684;&#x63E1;&#x624B;&#x65B9;&#x5F0F;&#x300D;&#x4F86;&#x4EA4;&#x63DB;&#x8CC7;&#x6599;&#xFF0C;&#x50CF;&#x662F;&#x5169;&#x500B;&#x5FAE;&#x670D;&#x52D9;&#x5C0D;&#x540C;&#x4E00;&#x500B;&#x8CC7;&#x6599;&#x5EAB;&#x505A;&#x8B80;&#x5BEB;&#xFF0C;&#x9019;&#x7A2E;&#x300C;&#x79D8;&#x5BC6;&#x7684;&#x63E1;&#x624B;&#x65B9;&#x5F0F;&#x300D;&#x901A;&#x5E38;&#x53EA;&#x6709;&#x5BE6;&#x4F5C;&#x7684;&#x5DE5;&#x7A0B;&#x5E2B;&#x6703;&#x6E05;&#x695A;&#x5169;&#x8005;&#x662F;&#x600E;&#x9EBC;&#x4E92;&#x52D5;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x4EBA;&#x4E00;&#x8D70;&#xFF0C;&#x90A3;&#x9EBC;&#x9019;&#x500B;&#x7279;&#x6B8A;&#x7684;&#x904B;&#x4F5C;&#x65B9;&#x5F0F;&#x5C31;&#x6C92;&#x6709;&#x4EBA;&#x6E05;&#x695A;&#x4E86;&#x3002;</p>
<p>&#x300C;&#x7956;&#x50B3;&#x4EE3;&#x78BC;&#x300D;&#x7684;&#x6642;&#x9593;&#x8D8A;&#x4E45;&#xFF0C;&#x9019;&#x7A2E;&#x79D8;&#x5BC6;&#x8D8A;&#x591A;&#xFF0C;&#x90A3;&#x9EBC;&#x8981;&#x907F;&#x514D;&#x9019;&#x500B;&#x72C0;&#x6CC1;&#x7522;&#x751F;&#xFF0C;&#x53EA;&#x6709;&#x5169;&#x500B;&#x65B9;&#x5F0F;&#x89E3;&#x6C7A;&#xFF0C;&#x7B2C;&#x4E00;&#x500B;&#x662F;&#x6709;&#x8D85;&#x4F4E;&#x96E2;&#x8077;&#x7387;&#xFF0C;&#x7B2C;&#x4E8C;&#x500B;&#x5247;&#x662F;&#x9AD8;&#x96E2;&#x8077;&#x7387;&#x4E0D;&#x65B7;&#x7684;&#x91CD;&#x5BEB;&#x7A0B;&#x5F0F;&#x78BC;&#x3002;&#x7B2C;&#x4E00;&#x500B;&#x65B9;&#x793A;&#x662F;&#x4E0D;&#x5207;&#x5BE6;&#x969B;&#x7684;&#xFF0C;&#x4E0D;&#x7BA1;&#x600E;&#x6A23;&#x54E1;&#x5DE5;&#x90FD;&#x662F;&#x6703;&#x8D70;&#x7684;&#xFF0C;&#x964D;&#x4F4E;&#x96E2;&#x8077;&#x7387;&#x53EA;&#x662F;&#x5EF6;&#x7DE9;&#x707D;&#x96E3;&#x7684;&#x7522;&#x751F;&#xFF0C;&#x4E00;&#x500B;&#x4E03;&#x500B;&#x4EBA;&#x7684;&#x5718;&#x968A;&#xFF0C;&#x5728;&#x5169;&#x6210;&#x7684;&#x96E2;&#x8077;&#x7387;&#x4E0B;&#xFF0C;&#x4E94;&#x5E74;&#x5F8C;&#x53EF;&#x80FD;&#x53EA;&#x5269;&#x4E00;&#x500B;&#x54E1;&#x5DE5;&#x9084;&#x5728;&#x90A3;&#xFF0C;&#x9818;&#x82F1;&#x6211;&#x5728;&#x7684;&#x90E8;&#x9580;&#x7684;&#x96E2;&#x8077;&#x7387;&#x5728; 18% &#xFF0C;&#x6211;&#x9032;&#x53BB;&#x7684;&#x6642;&#x5019;&#x90E8;&#x9580;&#x5DF2;&#x6709;&#x4E8C;&#x5341;&#x591A;&#x4EBA;&#xFF0C;&#x4F46;&#x5230;&#x6211;&#x4E09;&#x5E74;&#x534A;&#x96E2;&#x8077;&#x6642;&#xFF0C;&#x53EA;&#x6709;&#x4E94;&#x4EBA;&#x9084;&#x5728;&#x540C;&#x4E00;&#x500B;&#x90E8;&#x9580;&#x3002;&#x964D;&#x4F4E;&#x96E2;&#x8077;&#x7387;&#xFF0C;&#x907F;&#x514D;&#x571F;&#x5730;&#x516C;&#x571F;&#x5730;&#x5A46;&#x96E2;&#x958B;&#x5718;&#x968A;&#xFF0C;&#x5728;&#x7D93;&#x71DF;&#x7BA1;&#x7406;&#x4E0A;&#x662F;&#x4E0D;&#x5207;&#x5BE6;&#x969B;&#x7684;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x500B;&#x65B9;&#x5F0F;&#x5247;&#x662F;&#x4E0D;&#x65B7;&#x7684;&#x91CD;&#x69CB;&#x4EE3;&#x78BC;&#xFF0C;&#x6BCF;&#x4E94;&#x5E74;&#x5C31;&#x91CD;&#x5BEB;&#x4E00;&#x6B21;&#xFF0C;&#x8AAA;&#x7684;&#x597D;&#x807D;&#x4E00;&#x9EDE;&#x662F;&#x8981;&#x6E05;&#x9664;&#x6280;&#x8853;&#x50B5;&#xFF0C;&#x4F46;&#x662F;&#x5F9E;&#x7BA1;&#x7406;&#x968E;&#x5C64;&#x7684;&#x89D2;&#x5EA6;&#x4F86;&#x770B;&#xFF0C;&#x662F;&#x628A;&#x300C;&#x7D44;&#x7E54;&#x77E5;&#x8B58;&#x300D;&#x7684;&#x50B3;&#x905E;&#x505A;&#x500B;&#x7E3D;&#x6AA2;&#x9A57;&#xFF0C;&#x96D6;&#x7136;&#x6BCF;&#x4E00;&#x500B;&#x65B0;&#x7CFB;&#x7D71;&#x5728;&#x958B;&#x59CB;&#x524D;&#xFF0C;&#x90FD;&#x6703;&#x5BEB;&#x300C;&#x8A2D;&#x8A08;&#x6587;&#x4EF6;&#x300D;&#xFF08;Design Doc&#xFF09;&#x4E26;&#x4EA4;&#x7531;&#x5718;&#x968A;&#x505A;&#x5BE9;&#x95B1;&#xFF0C;&#x9664;&#x4E86;&#x770B;&#x770B;&#x8A2D;&#x8A08;&#x6709;&#x6C92;&#x6709;&#x554F;&#x984C;&#x5916;&#xFF0C;&#x9084;&#x628A;&#x9019;&#x4E9B;&#x77E5;&#x8B58;&#x50B3;&#x905E;&#x7D66;&#x90E8;&#x9580;&#x5167;&#x5176;&#x5B83;&#x7684;&#x5DE5;&#x7A0B;&#x4EBA;&#x54E1;&#xFF1B;&#x7136;&#x800C;&#x5728;&#x5C08;&#x6848;&#x4E00;&#x76F4;&#x9032;&#x884C;&#x7684;&#x72C0;&#x6CC1;&#x4E0B;&#xFF0C;&#x9019;&#x4E9B;&#x8A2D;&#x8A08;&#x6587;&#x4EF6;&#x4E0D;&#x514D;&#x8DDF;&#x4E0D;&#x4E0A;&#x73FE;&#x6CC1;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x8A31;&#x591A;&#x7684;&#x5BE6;&#x4F5C;&#x7D30;&#x7BC0;&#x5728;&#x8A2D;&#x8A08;&#x6587;&#x4EF6;&#x4E0A;&#x662F;&#x6C92;&#x6709;&#x7684;&#x3002;</p>
<blockquote>
<p>&#x4F8B;&#x5982;&#xFF1A; Scala &#x9019;&#x500B;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00;&#x7684;&#x898F;&#x5247;&#x66F8;&#x6709; 200 &#x9801;&#x5DE6;&#x53F3;&#xFF0C;&#x4F46;&#x662F;&#x8DDF;&#x64DA; Scala &#x7DE8;&#x8B6F;&#x5668;&#x7684;&#x7DAD;&#x8B77;&#x8005; Paul Philips &#x7684;&#x8AAA;&#x6CD5;&#xFF0C;&#x8A9E;&#x8A00;&#x7684;&#x898F;&#x5247;&#x66F8;&#x53EA;&#x6709;&#x5BEB;&#x6E05;&#x695A;&#x4E5D;&#x6210;&#x7684;&#x898F;&#x5247;&#x800C;&#x4EE5;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x7D30;&#x7BC0;&#x662F;&#x4ED6;&#x5728;&#x5BE6;&#x4F5C;&#x6642;&#x5236;&#x5B9A;&#x7684;&#x3002;&#x4F8B;&#x5982; Scala &#x7684; <code>Map</code> &#x6709; <code>toList</code> &#x9019;&#x500B;&#x51FD;&#x6578;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xFF0C;&#x800C; <code>List</code> &#x4E0A;&#x4E5F;&#x6709; <code>toMap</code> &#x53EF;&#x4EE5;&#x547C;&#x53EB;&#x3002;&#x4F46;&#x662F; <code>Map</code> &#x7684;&#x5BE6;&#x4F5C;&#x6709; <code>HashMap</code> &#x8DDF; <code>TreeMap</code> &#x5169;&#x7A2E;&#xFF0C;&#x5728; <code>TreeMap</code> &#x4E0A;&#x547C;&#x53EB; <code>toList</code> &#x7522;&#x751F;&#x7684;&#x6771;&#x897F;&#x7684;&#x6392;&#x5E8F;&#x662F;&#x5982;&#x4F55;&#xFF1F;&#x5728; <code>TreeMap</code> &#x4E0A;&#x547C;&#x53EB; <code>toList</code> . <code>toMap</code> &#x5F8C;&#xFF0C;&#x50B3;&#x56DE;&#x4F86;&#x7684; <code>Map</code> &#x8A72;&#x4E0D;&#x8A72;&#x9084;&#x662F; <code>TreeMap</code> &#x5462;&#xFF1F;
&#x9019;&#x7A2E;&#x898F;&#x5247;&#x4E0D;&#x6703;&#x5BEB;&#x5728;&#x898F;&#x5247;&#x66F8;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5BE6;&#x4F5C;&#x4E0A;&#x6703;&#x88AB;&#x505A;&#x9032;&#x53BB;&#xFF0C;&#x800C;&#x4E14;&#x53EA;&#x8981;&#x516C;&#x958B;&#x7D66;&#x5927;&#x773E;&#x4F7F;&#x7528;&#x5F8C;&#xFF0C;&#x5C31;&#x8B8A;&#x6210;&#x4E0D;&#x6210;&#x6587;&#x7684;&#x898F;&#x5247;&#xFF0C;&#x4E0D;&#x80FD;&#x518D;&#x4FEE;&#x6539;&#x4E86;&#x3002;</p>
<p>&#x67D0;&#x9280;&#x884C;&#x7528;&#x7684;&#x5BC6;&#x78BC;&#x7522;&#x751F;&#x5668;&#x88E1;&#x9762;&#x6709;&#x4E00;&#x884C; sleep 1ms &#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x3002;&#x63A5;&#x624B;&#x7DAD;&#x8B77;&#x7684;&#x4EBA;&#xFF0C;&#x56E0;&#x70BA;&#x9280;&#x884C;&#x696D;&#x52D9;&#x4E00;&#x8DEF;&#x5F9E;&#x5730;&#x5340;&#x5C0F;&#x9280;&#x884C;&#x8B8A;&#x6210;&#x5168;&#x570B;&#x6027;&#x7684;&#x9280;&#x884C;&#xFF0C;&#x7CFB;&#x7D71;&#x78B0;&#x4E0A;&#x74F6;&#x9838;&#xFF0C;&#x4E00;&#x8DEF;&#x8FFD;&#x5230;&#x9019;&#x4E00;&#x884C;&#x4F86;&#xFF0C;&#x60F3;&#x4E0D;&#x901A;&#x70BA;&#x4EC0;&#x9EBC;&#x8981;&#x9019;&#x9EBC;&#x505A;&#xFF0C;&#x65BC;&#x662F;&#x628A;&#x9019;&#x4E00;&#x884C;&#x62FF;&#x6389;&#xFF0C;&#x628A;&#x7CFB;&#x7D71;&#x7684;&#x6548;&#x80FD;&#x589E;&#x52A0;&#x4E86;&#x6578;&#x767E;&#x500D;&#x3002;
&#x6C92;&#x60F3;&#x5230;&#x904E;&#x4E86;&#x5E7E;&#x500B;&#x6708;&#x5F8C;&#xFF0C;&#x767C;&#x73FE;&#x6709;&#x8A31;&#x591A;&#x5BA2;&#x6236;&#x7684;&#x5E33;&#x865F;&#x88AB;&#x5165;&#x4FB5;&#xFF0C;&#x554F;&#x984C;&#x662F;&#x4EC0;&#x9EBC;&#x5462;&#xFF1F;&#x554F;&#x984C;&#x662F; Linux &#x7684;&#x4E82;&#x6578;&#x7522;&#x751F;&#x5668;&#x7684;&#x6700;&#x5C0F;&#x7DAD;&#x5EA6;&#x662F; ms &#xFF0C;&#x5728;&#x540C;&#x5FAE;&#x79D2;&#x5167;&#x8DDF; Linux &#x8981;&#x4E82;&#x6578;&#xFF0C;&#x8981;&#x56DE;&#x4F86;&#x7684;&#x4E82;&#x6578;&#x662F;&#x6709;&#x898F;&#x5247;&#x7684;&#x3002;</p>
</blockquote>
<p>&#x8981;&#x6E1B;&#x5C11;&#x9019;&#x4E9B;&#x300C;&#x7956;&#x50B3;&#x4EE3;&#x78BC;&#x300D;&#x5728;&#x8B8A;&#x52D5;&#x6642;&#x7522;&#x751F;&#x7684;&#x98A8;&#x96AA;&#xFF0C;&#x53EA;&#x80FD;&#x5920;&#x9760;&#x4E0D;&#x65B7;&#x7684;&#x91CD;&#x5BEB;&#xFF0C;&#x5728;&#x5718;&#x968A;&#x7684;&#x571F;&#x5730;&#x516C;&#x571F;&#x5730;&#x5A46;&#x9084;&#x6C92;&#x6709;&#x96E2;&#x8077;&#x524D;&#xFF0C;&#x5F37;&#x8FEB;&#x6574;&#x500B;&#x5718;&#x968A;&#x91CD;&#x5BEB;&#x4E00;&#x6B21;&#x5C08;&#x6848;&#xFF0C;&#x628A;&#x5C08;&#x6848;&#x7684;&#x7D30;&#x7BC0;&#x4E00;&#x500B;&#x500B;&#x62FF;&#x51FA;&#x4F86;&#x6AA2;&#x9A57;&#xFF0C;&#x628A;&#x77E5;&#x8B58;&#x50B3;&#x7D66;&#x65B0;&#x4EBA;&#xFF0C;&#x624D;&#x80FD;&#x5920;&#x907F;&#x514D;&#x300C;&#x7D44;&#x7E54;&#x77E5;&#x8B58;&#x300D;&#x7684;&#x6D41;&#x5931;&#x3002;</p>
<div id="fb-root"></div>
<script async defer crossorigin="anonymous" src="https://connect.facebook.net/en_US/sdk.js#xfbml=1&amp;version=v8.0&amp;appId=206989179619&amp;autoLogAppEvents=1" nonce="b5OFChIo"></script>

<div class="fb-comments" data-href="https://elderengineer.github.io/book-sillicon-valley/36.html" data-numposts="10" data-width="" lazy="true"></div>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="32.html" class="navigation navigation-prev " aria-label="Previous page: 組織與企業章呈">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="38.html" class="navigation navigation-next " aria-label="Next page: 靠數據指標（KPI）引導團隊">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"祖傳代碼與組織知識的傳承","level":"1.3.3","depth":2,"next":{"title":"靠數據指標（KPI）引導團隊","level":"1.3.4","depth":2,"path":"38.md","ref":"38.md","articles":[]},"previous":{"title":"組織與企業章呈","level":"1.3.2","depth":2,"path":"32.md","ref":"32.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"36.md","mtime":"2020-10-13T08:03:25.972Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-13T08:04:02.917Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

