
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>靠數據指標（KPI）引導團隊 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="36.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    我在飛向的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="26.html">
            
                <a href="26.html">
            
                    
                    談中小企業放款
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="27.html">
            
                <a href="27.html">
            
                    
                    獎助條例
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    在大公司打工的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="31.html">
            
                <a href="31.html">
            
                    
                    帝王
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="32.html">
            
                <a href="32.html">
            
                    
                    組織與企業章呈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="36.html">
            
                <a href="36.html">
            
                    
                    祖傳代碼與組織知識的傳承
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.4" data-path="38.html">
            
                <a href="38.html">
            
                    
                    靠數據指標（KPI）引導團隊
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    矽谷雜談
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="41.html">
            
                <a href="41.html">
            
                    
                    併聘 Acquhire
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="42.html">
            
                <a href="42.html">
            
                    
                    企業併購產品整合問題
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    大齡工程師的挑戰
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="51.html">
            
                <a href="51.html">
            
                    
                    程式設計師潛水夫症
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="52.html">
            
                <a href="52.html">
            
                    
                    工程師年齡歧視的真象
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    給年輕人的建議
            
                </span>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >靠數據指標（KPI）引導團隊</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x9760;&#x6578;&#x64DA;&#x6307;&#x6A19;&#xFF08;kpi&#xFF09;&#x5F15;&#x5C0E;&#x5718;&#x968A;">&#x9760;&#x6578;&#x64DA;&#x6307;&#x6A19;&#xFF08;KPI&#xFF09;&#x5F15;&#x5C0E;&#x5718;&#x968A;</h1>
<p>&#x9818;&#x82F1;&#x662F;&#x500B;&#x6578;&#x64DA;&#x516C;&#x53F8;&#xFF0C;&#x516C;&#x53F8;&#x4E0A;&#x4E0A;&#x4E0B;&#x4E0B;&#x7684;&#x6240;&#x6709;&#x6C7A;&#x7B56;&#x90FD;&#x662F;&#x9760; KPI &#x4F86;&#x5F15;&#x5C0E;&#x7684;&#xFF0C;&#x50CF;&#x662F;&#x6BCF;&#x6708;&#x7368;&#x7ACB;&#x8A2A;&#x5BA2;&#x3001;&#x5BA2;&#x6236;&#x7559;&#x5B58;&#x7387;&#x3001;&#x5404;&#x529F;&#x80FD;&#x7684;&#x4F7F;&#x7528;&#x4EBA;&#x6578;&#x7B49;&#x7B49;&#xFF0C;&#x90FD;&#x662F;&#x6211;&#x5011;&#x9019;&#x500B;&#x55AE;&#x4F4D;&#x6700;&#x95DC;&#x5FC3;&#x7684;&#x6578;&#x64DA;&#x6307;&#x6A19;&#x3002;</p>
<p>&#x5C0D;&#x65BC;&#x600E;&#x9EBC;&#x9760;&#x6578;&#x64DA;&#x6307;&#x6A19;&#x5F15;&#x5C0E;&#x5718;&#x968A;&#xFF0C;&#x6211;&#x6709;&#x500B;&#x89AA;&#x8EAB;&#x7684;&#x9AD4;&#x6703;&#x3002;&#x5728;&#x6211;&#x5728;&#x9818;&#x82F1;&#x7684;&#x524D;&#x5169;&#x5E74;&#xFF0C;&#x6211;&#x5011;&#x7684; CI &#x74B0;&#x5883;&#x6709;&#x7A2E;&#x7A2E;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x5E38;&#x5E38;&#x56E0;&#x70BA;&#x5404;&#x7A2E;&#x4E0D;&#x540C;&#x7684;&#x539F;&#x56E0;&#xFF0C;CI&#x6703;&#x5931;&#x6557;</p>
<ul>
<li>git checkout &#x5931;&#x6557;&#xFF1A;&#x9818;&#x82F1;&#x7684; CI &#x74B0;&#x5883;&#x6709;&#x5169;&#x5343;&#x53F0;&#x6A5F;&#x5668;&#xFF0C;&#x96A8;&#x6642;&#x90FD;&#x6709;&#x4EBA;&#x5728;&#x5C0D; git &#x505A;&#x8B80;&#x53D6;&#x53CA;&#x5BEB;&#x5165;&#xFF0C;&#x8D85;&#x904E;&#x4E86;&#x55AE;&#x4E00;&#x53F0;&#x6A5F;&#x5668;&#x80FD;&#x5920;&#x8655;&#x7406;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;</li>
<li>maven repo &#x7684;&#x541E;&#x5410;&#x91CF;&#x554F;&#x984C;&#xFF1A;&#x8DDF;&#x4E0A;&#x9762;&#x7684;&#x554F;&#x984C;&#x5F88;&#x50CF;&#xFF0C;&#x56E0;&#x70BA;&#x540C;&#x6642;&#x5728;&#x8DD1;&#x7684; CI &#x6A5F;&#x5668;&#x592A;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x96A8;&#x6642;&#x90FD;&#x6709;&#x6A5F;&#x5668;&#x5728;&#x8DDF; maven repo &#x62C9; jar &#x4E0B;&#x4F86;&#xFF0C;&#x8D85;&#x904E;&#x4E86;&#x6211;&#x5011; maven repo &#x80FD;&#x8655;&#x7406;&#x7684;&#x4E0A;&#x9650;&#x3002;</li>
<li>&#x6E2C;&#x8A66;&#x7528;&#x7684;&#x6574;&#x5408;&#x74B0;&#x5883;&#x4E0D;&#x7A69;&#xFF1A;&#x6709;&#x4E9B;&#x6E2C;&#x8A66;&#x4E26;&#x6C92;&#x6709;&#x4F7F;&#x7528; mock &#x4F86;&#x7DE8;&#x5BEB;&#xFF0C;&#x800C;&#x662F;&#x76F4;&#x63A5;&#x6253;&#x6574;&#x5408;&#x74B0;&#x5883;&#xFF0C;&#x5982;&#x679C;&#x9019;&#x500B;&#x74B0;&#x5883;&#x7684;&#x67D0;&#x500B;&#x5E95;&#x5C64;&#x670D;&#x52D9;&#x51FA;&#x4E86;&#x554F;&#x984C;&#xFF0C;&#x90A3;&#x9EBC;&#x9019;&#x4E9B;&#x6574;&#x5408;&#x6E2C;&#x8A66;&#x5C31;&#x6703;&#x5931;&#x6557;&#x3002;</li>
<li>&#x6E2C;&#x8A66;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x5EAB;&#x4E0D;&#x7A69;&#xFF1A;&#x6211;&#x5011;&#x7528;&#x5728;&#x524D;&#x7AEF;&#x6E2C;&#x8A66;&#x7684;&#x67D0;&#x500B;&#x51FD;&#x5F0F;&#x5EAB;&#x6709;&#x300C;&#x8A18;&#x61B6;&#x9AD4;&#x6F0F;&#x5931;&#x300D;&#xFF08;Memory Leak&#xFF09;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x5076;&#x723E;&#x6703;&#x51FA;&#x73FE;&#x932F;&#x8AA4;&#xFF0C;&#x4F46;&#x662F;&#x91CD;&#x8DD1;&#x5C31;&#x597D;&#x3002;</li>
<li>&#x968A;&#x53CB;&#x4E92;&#x76F8;&#x8E10;&#x8E0F;&#x7684;&#x554F;&#x984C;&#xFF1A;&#x6211;&#x5011;&#x7684; CI &#x662F;&#x8A2D;&#x5B9A;&#x6210;&#xFF0C;&#x67D0;&#x500B;&#x7248;&#x672C;&#xFF08;commit&#xFF09;&#x5982;&#x679C;&#x5931;&#x6557;&#xFF0C; CI &#x6703;&#x81EA;&#x52D5;&#x518D;&#x5207;&#x63DB;&#x56DE;&#x4E0A;&#x4E00;&#x500B;&#x7248;&#x672C;&#xFF0C;&#x5728;&#x91CD;&#x65B0;&#x6E2C;&#x8A66;&#x4E00;&#x6B21;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x5728;&#x77ED;&#x6642;&#x9593;&#x5167;&#x6709;&#x6578;&#x500B; commit &#x4F8B;&#x5982; <code>v0 --&gt; v1 --&gt; v2</code> &#xFF0C;&#x4F46;&#x662F;&#x82E5; <code>v1</code> &#x662F;&#x6709;&#x554F;&#x984C;&#x7684;&#xFF0C; CI &#x6703;&#x628A;&#x7248;&#x672C;&#x56DE;&#x6EAF;&#x56DE; <code>v0</code> &#x7684;&#xFF0C;&#x65E2;&#x4F7F; <code>v2</code> &#x6E2C;&#x8A66;&#x662F;&#x6C92;&#x6709;&#x554F;&#x984C;&#x7684;&#xFF0C;&#x9084;&#x662F;&#x6703;&#x88AB; CI &#x84CB;&#x6389; <code>v0 --&gt; v1 --&gt; v2 --&gt; v0</code> &#xFF0C;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x518D;&#x9001;&#x51FA;&#x4E00;&#x6B21;&#x3002;</li>
<li>CI &#x6392;&#x7A0B;&#x554F;&#x984C;&#xFF1A;&#x96D6;&#x7136;&#x9818;&#x82F1;&#x7684; CI &#x6709;&#x5169;&#x5343;&#x53F0;&#x6A5F;&#x5668;&#xFF0C;&#x4F46;&#x662F;&#x7576;&#x5169;&#x5343;&#x53F0;&#x6A5F;&#x5668;&#x90FD;&#x5728;&#x5FD9;&#x6642;&#xFF0C;&#x65B0;&#x7684;&#x7248;&#x672C;&#x53EA;&#x597D;&#x653E;&#x5728;&#x67D0;&#x500B; Queue &#x88E1;&#x9762;&#x6392;&#x968A;&#xFF0C;&#x56E0;&#x70BA;&#x67D0;&#x4E9B;&#x6B77;&#x53F2;&#x907A;&#x7559;&#x554F;&#x984C;&#xFF0C;&#x9019;&#x500B; Queue &#x5927;&#x5C0F;&#x53EA;&#x6709; 10 &#x500B;&#x7A7A;&#x4F4D;&#xFF0C;&#x5982;&#x679C;&#x6EFF;&#x4E86;&#xFF0C;&#x4F7F;&#x7528;&#x8005;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x91CD;&#x9001;&#x3002;&#x800C;&#x4E14;&#x9019;&#x500B; Queue &#x662F;&#x6709;&#x5169;&#x53F0;&#x6A5F;&#x5668;&#x505A; DNS round robin&#xFF0C;&#x4F46;&#x662F;&#x9019;&#x5169;&#x53F0;&#x6A5F;&#x5668;&#x5F88;&#x4E0D;&#x7A69;&#x5B9A;&#xFF0C;&#x5E38;&#x5E38;&#x6703;&#x6709;&#x4E00;&#x53F0;&#x6B7B;&#x6389;&#x9700;&#x8981;&#x91CD;&#x958B;&#xFF0C;&#x800C;&#x4E14;&#x5169;&#x53F0;&#x6A5F;&#x5668;&#x4E4B;&#x9593;&#x4E0D;&#x5171;&#x4EAB;&#x8CC7;&#x6599;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x6642;&#x5019;&#x96D6;&#x7136; submit &#x6210;&#x529F;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x70BA;&#x6A5F;&#x5668;&#x7576;&#x6389;&#x4E86;&#xFF0C;&#x9019;&#x500B; submit &#x5C31;&#x6D88;&#x5931;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x662F; DNS &#x525B;&#x597D;&#x62FF;&#x5230;&#x7684;&#x662F;&#x6B7B;&#x6389;&#x7684;&#x6A5F;&#x5668;&#x7684; IP &#xFF0C;&#x90A3;&#x9EBC; submit &#x6703;&#x5931;&#x6557;&#xFF0C;&#x9700;&#x8981;&#x518D;&#x91CD;&#x9001;&#x4E00;&#x6B21;&#x3002;</li>
</ul>
<p>&#x4EE5;&#x4E0A;&#x7A2E;&#x7A2E;&#x554F;&#x984C;&#x7684;&#x767C;&#x751F;&#x7387;&#x4E26;&#x4E0D;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x500B;&#x7CFB;&#x7D71;&#x7684;&#x53EF;&#x7528;&#x5EA6;&#xFF08;availability&#xFF09;&#x662F;&#x6240;&#x6709;&#x5B50;&#x7CFB;&#x7D71;&#x7684;&#x4E58;&#x7A4D;&#xFF0C;&#x4F8B;&#x5982;&#x5047;&#x8A2D;&#x4EE5;&#x4E0A;&#x516D;&#x500B;&#x554F;&#x984C;&#x7684;&#x767C;&#x751F;&#x7387;&#x5404;&#x662F; 1% &#xFF0C;&#x90A3;&#x9EBC;&#x9019;&#x500B; CI &#x7684;&#x53EF;&#x7528;&#x5EA6;&#x662F; <code>99%^5 = 95%</code>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8AAA;&#x4E8C;&#x5341;&#x6B21; commit &#x6703;&#x767C;&#x751F;&#x4E00;&#x6B21;&#x554F;&#x984C;&#xFF0C;&#x7B49;&#x65BC;&#x5169;&#x4E09;&#x5929;&#x5C31;&#x6703;&#x78B0;&#x4E0A;&#x4E00;&#x6B21;&#x3002;&#x6709;&#x6642;&#x5019;&#x5728;&#x5348;&#x9910;&#x524D;&#x9001;&#x51FA; commit &#xFF0C;&#x60F3;&#x8AAA;&#x5348;&#x9910;&#x4E4B;&#x5F8C;&#x56DE;&#x4F86;&#x770B;&#xFF0C;&#x6C92;&#x60F3;&#x5230;&#x56E0;&#x70BA;&#x74B0;&#x5883;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x91CD;&#x9001;&#x4E00;&#x6B21;&#xFF0C;&#x9577;&#x4E45;&#x4E0B;&#x4F86;&#xFF0C;&#x5927;&#x5BB6;&#x7A4D;&#x6028;&#x5F88;&#x6DF1;&#x3002;</p>
<p>&#x9818;&#x82F1;&#x6BCF;&#x4E09;&#x500B;&#x6708;&#x6703;&#x505A;&#x4E00;&#x6B21;&#x554F;&#x5377;&#x8ABF;&#x67E5;&#xFF0C;&#x554F;&#x554F;&#x770B;&#x6240;&#x6709;&#x5DE5;&#x7A0B;&#x5E2B;&#x5C0D;&#x5167;&#x90E8;&#x7684;&#x958B;&#x767C;&#x5DE5;&#x5177;&#x7684;&#x8A55;&#x50F9;&#xFF0C;&#x6BCF;&#x4E00;&#x5E74;&#x4E5F;&#x6703;&#x505A;&#x4E00;&#x6B21;&#x5C0D;&#x516C;&#x53F8;&#x7684;&#x6EFF;&#x610F;&#x5EA6;&#x8ABF;&#x5BDF;&#xFF0C;&#x770B;&#x770B;&#x6240;&#x6709;&#x54E1;&#x5DE5;&#x5C0D;&#x516C;&#x53F8;&#x7684;&#x62B1;&#x6028;&#x6709;&#x90A3;&#x4E9B;&#x3002;&#x5728;&#x5DE5;&#x7A0B;&#x55AE;&#x4F4D;&#x62B1;&#x6028;&#x4E86;&#x8D85;&#x904E;&#x4E00;&#x5E74;&#x4E4B;&#x5F8C;&#xFF0C;&#x7E3D;&#x7B97;&#x9AD8;&#x5C64;&#x6253;&#x7B97;&#x5C0D;&#x9019;&#x500B;&#x72C0;&#x6CC1;&#x505A;&#x51FA;&#x53CD;&#x61C9;&#xFF0C;&#x6210;&#x7ACB;&#x4E86;&#x8DE8;&#x90E8;&#x9580;&#x7684;&#x300C;&#x827E;&#x56E0;&#x65AF;&#x5766;&#x300D;&#x8A08;&#x5283;&#xFF0C;&#x5404;&#x5718;&#x968A;&#x6D3E;&#x51FA;&#x58EB;&#x5927;&#x592B;&#x5DE5;&#x7A0B;&#x5E2B;&#xFF0C;&#x4F86;&#x652F;&#x63F4;&#x9019;&#x8A08;&#x5283;&#xFF0C;&#x8EAB;&#x70BA; CI &#x7684;&#x53D7;&#x5BB3;&#x8005;&#xFF0C;&#x6211;&#x81EA;&#x7136;&#x81EA;&#x9858;&#x53C3;&#x8207;&#x4E86;&#x9019;&#x500B;&#x8A08;&#x5283;&#x3002;</p>
<p>&#x5728;&#x6211;&#x5011;&#x62DB;&#x958B;&#x7B2C;&#x4E00;&#x6B21;&#x6703;&#x8B70;&#x6642;&#xFF0C;&#x6211;&#x662F;&#x5F88;&#x8208;&#x596E;&#x7684;&#xFF0C;&#x56E0;&#x70BA;&#x53EF;&#x4EE5;&#x8DDF;&#x516C;&#x53F8;&#x5176;&#x5B83;&#x7684;&#x58EB;&#x5927;&#x592B;&#x53CA;&#x5DE5;&#x7A0B;&#x7E3D;&#x76E3;&#x5408;&#x4F5C;&#xFF0C;&#x5176;&#x4E2D;&#x9084;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4F4D;&#x9EBB;&#x7701;&#x7406;&#x5DE5;&#x7684;&#x8CC7;&#x8A0A;&#x535A;&#x58EB;&#xFF0C;&#x60F3;&#x8AAA;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x4E00;&#x8D77;&#x52D5;&#x624B;&#x505A;&#xFF0C;&#x8207;&#x5DE5;&#x5177;&#x90E8;&#x9580;&#x4E00;&#x8D77;&#x89E3;&#x6389;&#x9019;&#x4E9B;&#x554F;&#x984C;&#x3002;&#x4F46;&#x662F;&#x958B;&#x5E7E;&#x6B21;&#x6703;&#x4E4B;&#x5F8C;&#x767C;&#x73FE;&#xFF0C;&#x6211;&#x5011;&#x4E26;&#x4E0D;&#x6703;&#x5BE6;&#x969B;&#x52D5;&#x624B;&#x53BB;&#x5BEB;&#x7A0B;&#x5F0F;&#x6216;&#x5BEB;&#x8A2D;&#x8A08;&#x7A3F;&#xFF0C;&#x53CD;&#x800C;&#x662F;&#x6211;&#x5011;&#x82B1;&#x4E86;&#x4E09;&#x500B;&#x6708;&#x7684;&#x6642;&#x9593;&#xFF0C;&#x53BB;&#x8A02;&#x4E00;&#x500B;&#x65B0;&#x7684;&#x6578;&#x64DA;&#x6307;&#x6A19; &#xFF08;KPI&#xFF09;&#x51FA;&#x4F86;&#xFF0C;&#x8A02;&#x51FA;&#x90A3;&#x4E9B;&#x7684;&#x932F;&#x8AA4;&#x662F;&#x53EF;&#x4EE5;&#x5C31;&#x8CAC;&#x65BC; CI &#xFF0C;&#x90A3;&#x4E9B;&#x7684;&#x932F;&#x8AA4;&#x662F;&#x8981;&#x6B78;&#x7A76;&#x65BC;&#x5176;&#x4ED6;&#x7684;&#x958B;&#x767C;&#x5DE5;&#x5177;&#x55AE;&#x4F4D;&#x3002;</p>
<p>&#x7576;&#x6642;&#x6211;&#x662F;&#x975E;&#x5E38;&#x7684;&#x5931;&#x671B;&#x7684;&#xFF0C;&#x4E09;&#x500B;&#x6708;&#x7684;&#x6642;&#x9593;&#x53EA;&#x6709;&#x5728;&#x958B;&#x6703;&#xFF0C;&#x6C92;&#x6A5F;&#x6703;&#x771F;&#x7684;&#x53BB;&#x89E3;&#x554F;&#x984C;&#xFF1B;&#x5F8C;&#x4F86;&#x53C8;&#x8DDF;&#x6211;&#x5011;&#x55AE;&#x4F4D;&#x501F;&#x4E86;&#x4E00;&#x500B;&#x5DE5;&#x7A0B;&#x5E2B;&#xFF0C;&#x53BB;&#x5BEB;&#x4E86;&#x4E00;&#x5806;&#x7684;&#x6B63;&#x898F;&#x8868;&#x793A;&#x5F0F;&#xFF08;regular expression&#xFF09;&#xFF0C;&#x53BB;&#x628A;&#x932F;&#x8AA4;&#x8A0A;&#x606F;&#x5206;&#x985E;&#xFF1B;&#x4F46;&#x662F;&#xFF0C;&#x6C92;&#x60F3;&#x5230;&#x5728;&#x8A02;&#x51FA;&#x9019;&#x4E9B;&#x6578;&#x64DA;&#x6307;&#x6A19;&#x7684;&#x4E00;&#x5E74;&#x4E4B;&#x5F8C;&#xFF0C;&#x6211;&#x5011;&#x6240;&#x6709;&#x7684; CI &#x554F;&#x984C;&#x90FD;&#x89E3;&#x6C7A;&#x6389;&#x4E86;&#xFF0C;&#x5982;&#x679C; submit &#x5931;&#x6557;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x81EA;&#x5DF1;&#x7A0B;&#x5F0F;&#x78BC;&#x51FA;&#x932F;&#x4E86;&#xFF0C;&#x518D;&#x4E5F;&#x4E0D;&#x6703;&#x770B;&#x5230;&#x4E00;&#x5806;&#x4EBA;&#x5728;&#x4E0B;&#x73ED;&#x524D; submit &#x4E92;&#x76F8;&#x8E10;&#x8E0F;&#xFF0C;&#x7136;&#x5F8C;&#x56DE;&#x5BB6;&#x5F8C;&#x767C;&#x73FE; CI &#x5931;&#x6557;&#xFF0C;&#x53C8;&#x7E7C;&#x7E8C;&#x4E92;&#x76F8;&#x8E10;&#x8E0F;&#x7684;&#x72C0;&#x6CC1;&#x4E86;&#x3002;</p>
<p>&#x5728;&#x5927;&#x516C;&#x53F8;&#x5167;&#xFF0C;&#x9084;&#x662F;&#x6709;&#x90E8;&#x9580;&#x672C;&#x4F4D;&#x4E3B;&#x7FA9;&#x7684;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x8B93;&#x5176;&#x5B83;&#x55AE;&#x4F4D;&#x7684;&#x4EBA;&#xFF0C;&#x4F86;&#x4FEE;&#x6539;&#x81EA;&#x5DF1;&#x55AE;&#x4F4D;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#xFF0C;&#x7B2C;&#x4E00;&#x662F;&#x5916;&#x4EBA;&#x5C0D;&#x6574;&#x9AD4;&#x67B6;&#x69CB;&#x7684;&#x767C;&#x5C55;&#x8A08;&#x5283;&#x4E0D;&#x6703;&#x6E05;&#x8655;&#xFF0C;&#x53EA;&#x6703;&#x505A;&#x4E9B;&#x5C0D;&#x81EA;&#x5DF1;&#x6709;&#x7528;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x800C;&#x53BB;&#x5FFD;&#x7565;&#x9019;&#x4E9B;&#x8B8A;&#x52D5;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x7B2C;&#x4E8C;&#x662F;&#x5916;&#x4EBA;&#x505A;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x9084;&#x662F;&#x8981;&#x81EA;&#x5DF1;&#x55AE;&#x4F4D;&#x4F86;&#x505A;&#x672A;&#x4F86;&#x7684;&#x7DAD;&#x8B77;&#xFF0C;&#x70BA;&#x4E86;&#x6B0A;&#x8CAC;&#x76F8;&#x7B26;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x8B93;&#x5916;&#x4EBA;&#x4F86;&#x505A;&#x4E0D;&#x7528;&#x8CA0;&#x8CAC;&#x7684;&#x6539;&#x52D5;&#xFF0C;&#x7B2C;&#x4E09;&#x9084;&#x6709;&#x81EA;&#x5DF1;&#x5718;&#x968A;&#x7684;&#x4EBA;&#x6750;&#x57F9;&#x80B2;&#x554F;&#x984C;&#xFF0C;&#x6709;&#x5371;&#x6A5F;&#x624D;&#x6709;&#x65B0;&#x5C08;&#x6848;&#xFF0C;&#x6709;&#x65B0;&#x5C08;&#x6848;&#x624D;&#x6709;&#x65B0;&#x4EBA;&#x767C;&#x6062;&#x7684;&#x7A7A;&#x9593;&#xFF0C;&#x9019;&#x7A2E;&#x6A5F;&#x6703;&#x7576;&#x7136;&#x8981;&#x7559;&#x7D66;&#x90E8;&#x9580;&#x5167;&#x7684;&#x4EBA;&#x529B;&#x4F86;&#x505A;&#x624D;&#x5C0D;&#x3002;&#x6211;&#x5011;&#x9019;&#x4E9B;&#x5916;&#x4EBA;&#xFF0C;&#x9084;&#x662F;&#x628A;&#x6642;&#x9593;&#x82B1;&#x5728;&#x628A;&#x9700;&#x6C42;&#x63CF;&#x8FF0;&#x6E05;&#x695A;&#x4E0A;&#x9762;&#x5C31;&#x597D;&#x3002;</p>
<p>&#x9019;&#x500B;&#x662F;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x89AA;&#x8EAB;&#x53C3;&#x8207;&#x7528;&#x6578;&#x64DA;&#x7BA1;&#x7406;&#x7684;&#x6848;&#x5B50;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89F8;&#x5230;&#xFF0C;&#x600E;&#x9EBC;&#x6A23;&#x53BB;&#x6A39;&#x7ACB;&#x4E00;&#x500B;&#x76EE;&#x6A19;&#x51FA;&#x4F86;&#xFF0C;&#x7136;&#x5F8C;&#x6C92;&#x6709;&#x7D66;&#x51FA;&#x5177;&#x9AD4;&#x8A08;&#x5283;&#xFF0C;&#x8B93;&#x5E95;&#x4E0B;&#x6578;&#x767E;&#x4EBA;&#x7684;&#x5718;&#x968A;&#x81EA;&#x5DF1;&#x53BB;&#x8A02;&#x5B9A;&#x5BE6;&#x884C;&#x8A08;&#x5283;&#xFF0C;&#x5404;&#x55AE;&#x4F4D;&#x81EA;&#x5DF1;&#x5F80;&#x7D42;&#x9EDE;&#x7684;&#x65B9;&#x5411;&#x53BB;&#x524D;&#x9032;&#x3002;&#x4E8B;&#x5F8C;&#x7AD9;&#x5728;&#x9AD8;&#x5C64;&#x7684;&#x89D2;&#x5EA6;&#x4F86;&#x770B;&#xFF0C;&#x8D8A;&#x5F80;&#x9AD8;&#x5C64;&#x8D70;&#xFF0C;&#x53EA;&#x80FD;&#x9760;&#x8D8A;&#x300C;&#x62BD;&#x8C61;&#x300D;&#x7684;&#x65B9;&#x5F0F;&#x4F86;&#x505A;&#x4E8B;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x771F;&#x7684;&#x81EA;&#x5DF1;&#x8DF3;&#x4E0B;&#x53BB;&#x5B9A;&#x8A08;&#x5283;&#xFF0C;&#x5165;&#x9580;&#x5DE5;&#x7A0B;&#x5E2B;&#x9760;&#x5BEB;&#x7A0B;&#x5F0F;&#x78BC;&#x904E;&#x6D3B;&#xFF0C;&#x58EB;&#x5927;&#x592B;&#x5DE5;&#x7A0B;&#x5E2B;&#x9760;&#x5BEB;&#x898F;&#x683C;&#x66F8;&#x904E;&#x6D3B;&#xFF0C;&#x5230;&#x4E86;&#x526F;&#x7E3D;&#x7684;&#x9AD8;&#x5EA6;&#xFF0C;&#x5C31;&#x53EA;&#x80FD;&#x9760;&#x8A02;&#x6578;&#x64DA;&#x6307;&#x6A19;&#x4F86;&#x904E;&#x6D3B;&#x4E86;&#x3002;&#x95DC;&#x65BC;&#x62BD;&#x50CF;&#x601D;&#x8003;&#xFF0C;&#x672A;&#x4F86;&#x6703;&#x6709;&#x5C08;&#x7AE0;&#x8A0E;&#x8AD6;&#x3002;</p>
<blockquote>
<p>&#x8A3B;&#xFF1A;&#x9019;&#x500B;&#x300C;&#x827E;&#x56E0;&#x65AF;&#x5766;&#x300D;&#x8A08;&#x5283;&#x4E5F;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x6210;&#x529F;&#xFF0C;&#x53E6;&#x4E00;&#x500B;&#x5B50;&#x8A08;&#x5283;&#x662F;&#x8981;&#x628A;&#x6211;&#x5011;&#x7684;&#x6574;&#x5408;&#x74B0;&#x5883;&#x7D66;&#x5F04;&#x7A69;&#x5B9A;&#x4E00;&#x4E9B;&#xFF0C;&#x7136;&#x800C;&#x9019;&#x500B;&#x5B50;&#x8A08;&#x5283;&#x6C92;&#x6709;&#x5F04;&#x6E05;&#x695A;&#xFF0C;&#x6574;&#x5408;&#x74B0;&#x5883;&#x4E0D;&#x7A69;&#x5B9A;&#x4E43;&#x662F;&#x56E0;&#x70BA;&#x5927;&#x5BB6;&#x6C92;&#x6709;&#x628A;&#x6574;&#x5408;&#x74B0;&#x5883;&#x4E5F;&#x7576;&#x6210;&#x751F;&#x7522;&#x74B0;&#x5883;&#xFF08;Production&#xFF09;&#x4F86;&#x7DAD;&#x8B77;&#xFF0C;&#x628A;&#x4E0A;&#x9762;&#x7684;&#x57FA;&#x5132;&#x670D;&#x52D9;&#x5F04;&#x5230; 99.9% &#x7684;&#x9AD8;&#x53EF;&#x7528;&#x5EA6;&#xFF0C;&#x6240;&#x4EE5;&#x624D;&#x6703;&#x767C;&#x751F;&#x518D;&#x4E4B;&#x4E0A;&#x7684;&#x61C9;&#x7528;&#x5C64;&#x4E0D;&#x7A69;&#x5B9A;&#x3002;&#x9019;&#x500B;&#x5B50;&#x8A08;&#x5283;&#x53BB;&#x5F04;&#x4E86;&#x5E7E;&#x5343;&#x842C;&#x7F8E;&#x91D1;&#xFF0C;&#x84CB;&#x4E86;&#x53E6;&#x4E00;&#x500B;&#x8CC7;&#x6599;&#x4E2D;&#x5FC3;&#x51FA;&#x4F86;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x70BA;&#x6C92;&#x6709;&#x591A;&#x7D66;&#x4EBA;&#x529B;&#x7D93;&#x8CBB;&#x7D66;&#x5404;&#x55AE;&#x4F4D;&#x53BB;&#x7167;&#x9867;&#x4E0A;&#x9762;&#x7684;&#x61C9;&#x7528;&#x5C64;&#xFF0C;&#x6240;&#x4EE5;&#x9019;&#x74B0;&#x5883;&#x5F88;&#x5FEB;&#x5C31;&#x5EE2;&#x68C4;&#x6389;&#xFF0C;&#x6700;&#x5F8C;&#x9019;&#x500B;&#x65B0;&#x8CC7;&#x6599;&#x4E2D;&#x5FC3;&#x4E5F;&#x8B8A;&#x6210;&#x6211;&#x5011;&#x751F;&#x7522;&#x74B0;&#x5883;&#x7684;&#x4E00;&#x90E8;&#x4EFD;&#xFF0C;&#x5B50;&#x8A08;&#x5283;&#x5BA3;&#x544A;&#x5931;&#x6557;&#x3002;</p>
<p>&#x8A3B;&#x4E8C;&#xFF1A;&#x5F8C;&#x4F86;&#x9818;&#x82F1;&#x7684; git &#x8B8A;&#x6210;&#x4E3B;&#x5F9E;&#x5F0F;&#x67B6;&#x69CB;&#xFF0C;&#x6709;&#x4E00;&#x53F0;&#x4E3B;&#x4F3A;&#x670D;&#x5668;&#xFF0C;&#x4E94;&#x53F0;&#x5B50;&#x4F3A;&#x670D;&#x5668;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5BEB;&#x5165;&#x662F;&#x5BEB;&#x5230;&#x4E3B;&#x4F3A;&#x670D;&#x5668;&#x4E0A;&#xFF0C;&#x7136;&#x5F8C;&#x900F;&#x904E; commit hook &#x7ACB;&#x523B;&#x540C;&#x6B65;&#x5230;&#x53E6;&#x5916;&#x4E94;&#x53F0;&#x6A5F;&#x5668;&#x4E0A;&#x3002;&#x96D6;&#x7136;&#x4ECD;&#x6709;&#x53EF;&#x80FD;&#x767C;&#x751F; CI &#x8DDF;&#x5B50;&#x4F3C;&#x670D;&#x5668;&#x62C9;&#x4E0D;&#x5230;&#x65B0;&#x7248;&#x672C;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x4F46;&#x662F;&#x65E2;&#x4F7F;&#x767C;&#x751F;&#x4E86;&#xFF0C;&#x6211;&#x5011;&#x7684;&#x6B63;&#x898F;&#x8868;&#x793A;&#x5F0F;&#x53EF;&#x4EE5;&#x6293;&#x5230;&#x9019;&#x4E9B;&#x554F;&#x984C;&#xFF0C;&#x4E26;&#x81EA;&#x52D5;&#x7D71;&#x8A08;&#x767C;&#x751F;&#x7684;&#x983B;&#x7387;&#xFF0C;&#x518D;&#x53BB;&#x770B;&#x9700;&#x4E0D;&#x9700;&#x8981;&#x82B1;&#x4EBA;&#x529B;&#x4E0B;&#x53BB;&#x89E3;&#x6C7A;&#x554F;&#x984C;&#x3002;</p>
</blockquote>
<h1 id="todo">TODO</h1>
<p>&#x88DC;&#x4E0A; PROD - STAGING - INT - TEST - DEV &#x74B0;&#x5883;&#x7684;&#x4ECB;&#x7D39;</p>
<div id="fb-root"></div>
<script async defer crossorigin="anonymous" src="https://connect.facebook.net/en_US/sdk.js#xfbml=1&amp;version=v8.0&amp;appId=206989179619&amp;autoLogAppEvents=1" nonce="b5OFChIo"></script>

<div class="fb-comments" data-href="https://elderengineer.github.io/book-sillicon-valley/38.html" data-numposts="10" data-width="" lazy="true"></div>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="36.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 祖傳代碼與組織知識的傳承">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"靠數據指標（KPI）引導團隊","level":"1.3.4","depth":2,"next":{"title":"矽谷雜談","level":"1.4","depth":1,"ref":"","articles":[{"title":"併聘 Acquhire","level":"1.4.1","depth":2,"path":"41.md","ref":"41.md","articles":[]},{"title":"企業併購產品整合問題","level":"1.4.2","depth":2,"path":"42.md","ref":"42.md","articles":[]}]},"previous":{"title":"祖傳代碼與組織知識的傳承","level":"1.3.3","depth":2,"path":"36.md","ref":"36.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"38.md","mtime":"2020-10-02T01:46:27.516Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-02T01:47:03.986Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

