
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>併聘 Acquhire · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="42.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    我在飛向的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="26.html">
            
                <a href="26.html">
            
                    
                    談中小企業放款
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    在大公司打工的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="31.html">
            
                <a href="31.html">
            
                    
                    帝王
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="32.html">
            
                <a href="32.html">
            
                    
                    組織與企業章呈
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    矽谷雜談
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.4.1" data-path="41.html">
            
                <a href="41.html">
            
                    
                    併聘 Acquhire
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="42.html">
            
                <a href="42.html">
            
                    
                    企業併購產品整合問題
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    大齡工程師的挑戰
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="51.html">
            
                <a href="51.html">
            
                    
                    程式設計師潛水夫症
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="52.html">
            
                <a href="52.html">
            
                    
                    工程師年齡歧視的真象
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    給年輕人的建議
            
                </span>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >併聘 Acquhire</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4F75;&#x8058;-acquhire">&#x4F75;&#x8058; Acquhire</h1>
<p>&#x300C;&#x4F75;&#x8CFC;&#x517C;&#x8058;&#x7528;&#x300D;&#x662F;&#x77FD;&#x8C37;&#x5E38;&#x898B;&#x7684;&#x4E00;&#x7A2E;&#x65B0;&#x5275;&#x516C;&#x53F8;&#x51FA;&#x5834;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x81EA;&#x5F9E;&#x91D1;&#x878D;&#x98A8;&#x66B4;&#x4E4B;&#x5F8C;&#xFF0C;&#x6295;&#x8CC7;&#x9280;&#x884C;&#x53D7;&#x5230;&#x6CD5;&#x898F;&#x9650;&#x5236;&#xFF0C;&#x9700;&#x8981;&#x8B8A;&#x5546;&#x696D;&#x9280;&#x884C;&#xFF0C;&#x4E0D;&#x80FD;&#x518D;&#x50CF;&#x904E;&#x53BB;&#x4E00;&#x6A23;&#xFF0C;&#x958B;&#x4E09;&#x5341;&#x4E8C;&#x500D;&#x7684;&#x69D3;&#x687F;&#x4F86;&#x64CD;&#x4F5C;&#x8CC7;&#x91D1;&#x5F8C;&#xFF0C;&#x5546;&#x5B78;&#x9662;&#x7684;&#x5B78;&#x751F;&#x7D1B;&#x7D1B;&#x8DD1;&#x4F86;&#x77FD;&#x8C37;&#x638F;&#x91D1;&#xFF0C;&#x505A;&#x8D77;&#x4F01;&#x696D;&#x4F75;&#x8CFC;&#x7684;&#x751F;&#x610F;&#x3002;</p>
<p>&#x6211;&#x5728;&#x9818;&#x82F1;&#x6642;&#x53C3;&#x8207;&#x904E;&#x4E09;&#x6B21;&#x7684;&#x4F75;&#x8CFC;&#x6D3B;&#x52D5;&#xFF0C;&#x6211;&#x5011;&#x5167;&#x90E8;&#x7684;&#x300C;&#x5546;&#x696D;&#x62D3;&#x5C55;&#x300D;Buesiness Development&#x55AE;&#x4F4D;&#xFF0C;&#x6703;&#x53BB;&#x7814;&#x7A76;&#x6211;&#x5011;&#x6240;&#x5728;&#x8457;&#x7522;&#x696D;&#x53EF;&#x4EE5;&#x7D30;&#x5206;&#x70BA;&#x90A3;&#x4E9B;&#x5C0F;&#x5E02;&#x5834;&#xFF0C;&#x6BCF;&#x4E00;&#x500B;&#x5E02;&#x5834;&#x5167;&#xFF0C;&#x518D;&#x5217;&#x51FA;&#x9019;&#x500B;&#x5E02;&#x5834;&#x7684;&#x7AF6;&#x722D;&#x5EE0;&#x5546;&#xFF0C;&#x5C0D;&#x65BC;&#x6BCF;&#x4E00;&#x500B;&#x65B0;&#x8208;&#x5E02;&#x5834;&#xFF0C;&#x6211;&#x5011;&#x7814;&#x7A76;&#x4ED6;&#x5011;&#x7684;&#x6F5B;&#x529B;&#xFF0C;&#x7136;&#x5F8C;&#x5236;&#x505A;&#x6211;&#x5011;&#x7684;&#x5C0D;&#x7B56;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x53C3;&#x8207;&#x9019;&#x500B;&#x5E02;&#x5834;&#x7AF6;&#x722D;&#xFF0C;&#x6216;&#x8005;&#x4F75;&#x8CFC;&#x5C0D;&#x624B;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x6301;&#x7E8C;&#x89C0;&#x5BDF;&#x9019;&#x500B;&#x5E02;&#x5834;&#x7684;&#x8D70;&#x5411;&#x3002;</p>
<p><img src="images/marketing_technology_jan2014.png" alt="&#x5E02;&#x5834;&#x5206;&#x6790;&#x5831;&#x544A;"></p>
<p>&#x70BA;&#x4EC0;&#x9EBC;&#x9019;&#x5E7E;&#x5E74;&#x4F86;&#xFF0C;&#x77FD;&#x8C37;&#x6703;&#x8D8A;&#x4F86;&#x8D8A;&#x50BE;&#x5411;&#x65BC;&#x63A1;&#x7528;&#x4F75;&#x8CFC;&#xFF0C;&#x800C;&#x975E;&#x5167;&#x90E8;&#x5275;&#x696D;&#x5462;&#xFF1F;&#x4EE5;&#x5167;&#x90E8;&#x5275;&#x696D;&#x4F86;&#x8AAA;&#xFF0C;&#x53D7;&#x5230;&#x7684;&#x9650;&#x5236;&#x975E;&#x5E38;&#x591A;&#xFF0C;&#x7B2C;&#x4E00;&#xFF0C;&#x5167;&#x90E8;&#x5275;&#x696D;&#x7684;&#x76EE;&#x6A19;&#x5E02;&#x5834;&#x82E5;&#x662F;&#x592A;&#x5C0F;&#xFF0C;&#x5728;&#x516C;&#x53F8;&#x5167;&#x8DDF;&#x672C;&#x62FF;&#x4E0D;&#x5230;&#x6AAF;&#x9762;&#x4E0A;&#x4F86;&#x8A0E;&#x8AD6;&#xFF0C;&#x4EE5;&#x5FAE;&#x8EDF;&#x4F86;&#x8AAA;&#xFF0C;&#x4E00;&#x500B;&#x6848;&#x5B50;&#x5982;&#x679C;&#x6C92;&#x6709;&#x5169;&#x767E;&#x4EBA;&#x4EE5;&#x4E0A;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x4E0D;&#x6703;&#x5728;&#x9AD8;&#x5C64;&#x6703;&#x8B70;&#x4E0A;&#x88AB;&#x8A0E;&#x8AD6;&#x5230;&#xFF0C;&#x5169;&#x767E;&#x4EBA;&#x5C31;&#x662F; C &#x8F2A;&#x65B0;&#x5275;&#x516C;&#x53F8;&#x7684;&#x5927;&#x5C0F;&#x4E86;&#xFF0C;&#x4E00;&#x500B;&#x6848;&#x5B50;&#x4E00;&#x958B;&#x59CB;&#x5C31;&#x8981;&#x90A3;&#x9EBC;&#x591A;&#x4EBA;&#x53C3;&#x8207;&#xFF0C;&#x90A3;&#x9EBC;&#x4E0D;&#x53EF;&#x80FD;&#x8D70; MVP &#x6700;&#x5C0F;&#x53EF;&#x884C;&#x6027;&#x7522;&#x54C1;&#x7684;&#x4F5C;&#x6CD5;&#x4F86;&#x8A66;&#x63A2;&#x5E02;&#x5834;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4E0A;&#x5E02;&#x516C;&#x53F8;&#x9084;&#x6709;&#x7A2E;&#x7A2E;&#x7684;&#x6CD5;&#x898F;&#x9650;&#x5236;&#xFF0C;&#x5F71;&#x97FF;&#x5230;&#x958B;&#x767C;&#x7684;&#x901F;&#x5EA6;&#x8DDF;&#x53EF;&#x884C;&#x6027;&#xFF1B;&#x6700;&#x5F8C;&#x9084;&#x6709;&#x5167;&#x90E8;&#x90E8;&#x9580;&#x5354;&#x8ABF;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x5728;&#x5927;&#x516C;&#x53F8;&#x8A2D;&#x8A08;&#x4E00;&#x500B;&#x7522;&#x54C1;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x8D70;&#x5167;&#x90E8;&#x7684;&#x5BE9;&#x67E5;&#x6D41;&#x7A0B;&#xFF0C;&#x9019;&#x4E9B;&#x6280;&#x8853;&#x5BE9;&#x67E5;&#x8DDF;&#x6CD5;&#x898F;&#x5BE9;&#x67E5;&#x7684;&#x904E;&#x7A0B;&#x975E;&#x5E38;&#x7684;&#x6C89;&#x91CD;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x6280;&#x8853;&#x4E0A;&#xFF0C;&#x9069;&#x5408;&#x793E;&#x4EA4;&#x7DB2;&#x8DEF;&#x7684;&#x6280;&#x8853;&#xFF0C;&#x4E26;&#x4E0D;&#x4E00;&#x5B9A;&#x9069;&#x5408;&#x7528;&#x5728; B2B &#x7684;&#x7522;&#x54C1;&#x4E0A;&#x9762;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x70BA;&#x8981;&#x8D70;&#x5167;&#x90E8;&#x5275;&#x696D;&#xFF0C;&#x53EA;&#x597D;&#x8207;&#x9019;&#x4E9B;&#x67B7;&#x9396;&#x59A5;&#x5354;&#x3002;</p>
<p>&#x4E5F;&#x56E0;&#x6B64;&#xFF0C;&#x9019;&#x5E7E;&#x5E74;&#x4F86;&#x77FD;&#x8C37;&#x7684;&#x5167;&#x90E8;&#x5275;&#x696D;&#xFF0C;&#x662F;&#x50BE;&#x5411;&#x65BC;&#x8B93;&#x54E1;&#x5DE5;&#x96E2;&#x8077;&#x81EA;&#x5DF1;&#x958B;&#x696D;&#xFF0C;&#x4F46;&#x662F;&#x524D;&#x516C;&#x53F8;&#x6703;&#x6295;&#x8CC7;&#x9019;&#x500B;&#x65B0;&#x5275;&#x516C;&#x53F8;&#xFF0C;&#x5982;&#x679C;&#x65B0;&#x5275;&#x516C;&#x53F8;&#x9577;&#x5927;&#x4E86;&#xFF0C;&#x90A3;&#x9EBC;&#x5927;&#x516C;&#x53F8;&#x6703;&#x518D;&#x628A;&#x4ED6;&#x6536;&#x8CFC;&#x9032;&#x4F86;&#xFF0C;&#x800C;&#x4E14;&#x96D9;&#x65B9;&#x7684;&#x9818;&#x5C0E;&#x5718;&#x968A;&#x4E0D;&#x6703;&#x6709;&#x4F01;&#x696D;&#x6587;&#x5316;&#x7684;&#x5DEE;&#x7570;&#xFF0C;&#x9019;&#x7A2E;&#x505A;&#x6CD5;&#x96D6;&#x7136;&#x91D1;&#x984D;&#x4E0A;&#x770B;&#x4F3C;&#x6602;&#x8CB4;&#xFF0C;&#x4F46;&#x6210;&#x529F;&#x6A5F;&#x7387;&#x9AD8;&#x591A;&#x4E86;&#x3002;</p>
<p>&#x5927;&#x516C;&#x53F8;&#x9032;&#x5165;&#x4E00;&#x500B;&#x65B0;&#x7522;&#x696D;&#x9664;&#x4E86;&#x4F75;&#x8CFC;&#x5916;&#xFF0C;&#x9084;&#x53EF;&#x4EE5;&#x9078;&#x64C7;&#x5167;&#x90E8;&#x958B;&#x767C;&#x7522;&#x54C1;&#xFF0C;&#x4F46;&#x662F;&#x65E2;&#x4F7F;&#x662F;&#x9078;&#x64C7;&#x5167;&#x90E8;&#x958B;&#x767C;&#xFF0C;&#x5F88;&#x591A;&#x6642;&#x5019;&#xFF0C;&#x5927;&#x516C;&#x53F8;&#x6703;&#x63A1;&#x7528;&#x300C;&#x4F75;&#x8058;&#x300D;&#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x7D44;&#x7E54;&#x4E00;&#x500B;&#x65B0;&#x7684;&#x5718;&#x968A;&#x3002;&#x76EE;&#x524D;&#x77FD;&#x8C37;&#x300C;&#x4F75;&#x8058;&#x300D;&#x7684;&#x884C;&#x60C5;&#x662F;&#x4E00;&#x500B;&#x5DE5;&#x7A0B;&#x5E2B;&#x4E00;&#x767E;&#x842C;&#x7F8E;&#x91D1;&#x7684;&#x91D1;&#x984D;&#xFF0C;&#x5047;&#x8A2D;&#x4E00;&#x500B;&#x5C0F;&#x516C;&#x53F8;&#x6709; 20 &#x500B;&#x54E1;&#x5DE5;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x534A;&#x662F;&#x5DE5;&#x7A0B;&#x5E2B;&#xFF0C;&#x90A3;&#x4F75;&#x8CFC;&#x7684;&#x91D1;&#x984D;&#x5C31;&#x662F;&#x4E00;&#x5343;&#x842C;&#x7F8E;&#x91D1;&#x3002;&#x9019;&#x6A23;&#x5B50;&#x770B;&#x4F3C;&#x5F88;&#x6602;&#x8CB4;&#xFF0C;&#x56E0;&#x70BA;&#x5927;&#x516C;&#x53F8;&#x539F;&#x672C;&#x5C31;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x62DB;&#x8058;&#x7A0B;&#x5E8F;&#x5728;&#x627E;&#x4EBA;&#xFF0C;&#x627E; 10 &#x500B;&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x5E2B;&#x4E26;&#x4E0D;&#x9700;&#x8981;&#x82B1;&#x4E00;&#x5343;&#x842C;&#x7F8E;&#x91D1;&#xFF0C;&#x800C;&#x4E14;&#x9019;&#x4E00;&#x5343;&#x842C;&#x7F8E;&#x91D1;&#x9084;&#x4E0D;&#x7B97;&#x627E;&#x4EBA;&#x9032;&#x4F86;&#x5F8C;&#x7684;&#x85AA;&#x6C34;&#xFF0C;&#x90A3;&#x70BA;&#x4EC0;&#x9EBC;&#x4F75;&#x8058;&#x6703;&#x6D41;&#x884C;&#x5462;&#xFF1F;&#x70BA;&#x4EC0;&#x9EBC;&#x5927;&#x516C;&#x53F8;&#x8981;&#x4F75;&#x8CFC;&#x7D93;&#x71DF;&#x5931;&#x6557;&#x7684;&#x65B0;&#x5275;&#x5718;&#x968A;&#x5462;&#xFF1F;</p>
<p>&#x56E0;&#x70BA;&#x65B0;&#x5275;&#x5718;&#x968A;&#x5931;&#x6557;&#x6709;&#x5F88;&#x591A;&#x7A2E;&#x53EF;&#x80FD;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x5E02;&#x5834;&#x4E0D;&#x5C0D;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x6642;&#x6A5F;&#x4E0D;&#x5C0D;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x884C;&#x92B7;&#x624B;&#x6CD5;&#x554F;&#x984C;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x8CC7;&#x91D1;&#x8DDF;&#x4E0D;&#x4E0A;&#x7B49;&#x7B49;&#x56E0;&#x7D20;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x9019;&#x4E00;&#x500B;&#x5718;&#x968A;&#x662F;&#x6709;&#x628A;&#x67D0;&#x4E00;&#x500B;&#x9EDE;&#x5B50;&#x8B8A;&#x6210;&#x5BE6;&#x969B;&#x7684;&#x7522;&#x54C1;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x90A3;&#x9EBC;&#xFF0C;&#x9019;&#x500B;&#x5718;&#x968A;&#x5C31;&#x662F;&#x6709;&#x50F9;&#x503C;&#x7684;&#x3002;&#x5927;&#x516C;&#x53F8;&#x5982;&#x679C;&#x5167;&#x90E8;&#x627E;&#x4E00;&#x500B;&#x5DE5;&#x7A0B;&#x7D93;&#x7406;&#xFF0C;&#x518D;&#x62DB;&#x5341;&#x500B;&#x5DE5;&#x7A0B;&#x5E2B;&#x9032;&#x4F86;&#xFF0C;&#x7B49;&#x5230;&#x4E00;&#x5E74;&#x4E4B;&#x5F8C;&#x5927;&#x5BB6;&#x78E8;&#x5408;&#x597D;&#x4E86;&#xFF0C;&#x5718;&#x968A;&#x6230;&#x529B;&#x51FA;&#x4F86;&#x6642;&#xFF0C;&#x5E02;&#x5834;&#x6642;&#x6A5F;&#x53EF;&#x80FD;&#x5C31;&#x5DF2;&#x7D93;&#x8DD1;&#x6389;&#x4E86;&#x3002;&#x4E0A;&#x5E02;&#x516C;&#x53F8;&#x6700;&#x4E0D;&#x7F3A;&#x7684;&#x5C31;&#x662F;&#x8CC7;&#x91D1;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x9760;&#x8CC7;&#x91D1;&#x52A0;&#x901F;&#x9032;&#x5EA6;&#xFF0C;&#x90A3;&#x9EBC;&#x82B1;&#x91CD;&#x91D1;&#x53BB;&#x627E;&#x4E00;&#x500B;&#x5373;&#x6230;&#x529B;&#x7684;&#x5718;&#x968A;&#xFF0C;&#x4E0D;&#x662F;&#x5F88;&#x5408;&#x7406;&#x55CE;&#xFF1F;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="42.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 企業併購產品整合問題">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"併聘 Acquhire","level":"1.4.1","depth":2,"next":{"title":"企業併購產品整合問題","level":"1.4.2","depth":2,"path":"42.md","ref":"42.md","articles":[]},"previous":{"title":"矽谷雜談","level":"1.4","depth":1,"ref":"","articles":[{"title":"併聘 Acquhire","level":"1.4.1","depth":2,"path":"41.md","ref":"41.md","articles":[]},{"title":"企業併購產品整合問題","level":"1.4.2","depth":2,"path":"42.md","ref":"42.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"41.md","mtime":"2020-09-24T21:46:02.060Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-09-24T21:46:46.380Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

