
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>企業併購產品整合問題 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="41.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    我在飛向的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="26.html">
            
                <a href="26.html">
            
                    
                    談中小企業放款
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="27.html">
            
                <a href="27.html">
            
                    
                    獎助條例
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    在大公司打工的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="31.html">
            
                <a href="31.html">
            
                    
                    帝王
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="32.html">
            
                <a href="32.html">
            
                    
                    組織與企業章呈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="36.html">
            
                <a href="36.html">
            
                    
                    祖傳代碼與組織知識的傳承
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="38.html">
            
                <a href="38.html">
            
                    
                    靠數據指標（KPI）引導團隊
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    矽谷雜談
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="41.html">
            
                <a href="41.html">
            
                    
                    併聘 Acquhire
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.2" data-path="42.html">
            
                <a href="42.html">
            
                    
                    企業併購產品整合問題
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    大齡工程師的挑戰
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="51.html">
            
                <a href="51.html">
            
                    
                    程式設計師潛水夫症
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="52.html">
            
                <a href="52.html">
            
                    
                    工程師年齡歧視的真象
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    給年輕人的建議
            
                </span>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >企業併購產品整合問題</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4F01;&#x696D;&#x4F75;&#x8CFC;&#x7522;&#x54C1;&#x6574;&#x5408;&#x554F;&#x984C;">&#x4F01;&#x696D;&#x4F75;&#x8CFC;&#x7522;&#x54C1;&#x6574;&#x5408;&#x554F;&#x984C;</h1>
<p>&#x5728;&#x6211;&#x5728;&#x9818;&#x82F1;&#x7684;&#x4E09;&#x5E74;&#x534A;&#x9593;&#xFF0C;&#x53C3;&#x8207;&#x4E86;&#x4E09;&#x500B;&#x4F75;&#x8CFC;&#x6848;&#xFF0C;&#x4E09;&#x500B;&#x6848;&#x5B50;&#x7684;&#x7522;&#x54C1;&#x6574;&#x5408;&#x65B9;&#x5F0F;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x4EC0;&#x9EBC;&#x56E0;&#x7D20;&#xFF0C;&#x525B;&#x597D;&#x8D70;&#x4E0A;&#x4E86;&#x4E09;&#x689D;&#x4E0D;&#x4E00;&#x6A23;&#x7684;&#x9053;&#x8DEF;&#xFF0C;&#x53EF;&#x4EE5;&#x8B93;&#x5927;&#x5BB6;&#x6BD4;&#x8F03;&#x770B;&#x770B;&#xFF0C;&#x770B;&#x90A3;&#x4E00;&#x689D;&#x662F;&#x6700;&#x597D;&#x7684;&#x9053;&#x8DEF;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x689D;&#x7684;&#x9053;&#x8DEF;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x6848;&#x5B50;&#xFF0C;&#x300C;&#x98DB;&#x5411;&#x300D;&#x7684;&#x4F75;&#x8CFC;&#x6848;&#xFF0C;&#x5728;&#x9818;&#x82F1;&#x6536;&#x8CFC;&#x98DB;&#x5411;&#x4E4B;&#x5F8C;&#xFF0C;&#x9664;&#x4E86;&#x6536;&#x8CFC;&#x6642;&#x7684;&#x6280;&#x8853;&#x5BE9;&#x67E5;&#xFF08;Due Diligence&#xFF09;&#x5916;&#xFF0C;&#x6211;&#x5011;&#x53C8;&#x82B1;&#x4E86;&#x4E00;&#x500B;&#x6708;&#x7684;&#x6642;&#x9593;&#xFF0C;&#x901A;&#x904E;&#x5167;&#x90E8;&#x5DE5;&#x7A0B;&#x5718;&#x968A;&#x8DDF;&#x6CD5;&#x52D9;&#x5718;&#x968A;&#x7684;&#x5BE9;&#x67E5;&#x5F8C;&#xFF0C;&#x6253;&#x7B97;&#x628A;&#x539F;&#x672C;&#x7684;&#x7522;&#x54C1;&#x63A5;&#x4E0A;&#x9818;&#x82F1;&#x7684;&#x76AE;&#xFF0C;&#x5F8C;&#x7AEF;&#x5247;&#x662F;&#x7A0D;&#x70BA;&#x5C0F;&#x6539;&#xFF0C;&#x642C;&#x9032;&#x9818;&#x82F1;&#x7684;&#x8CC7;&#x6599;&#x4E2D;&#x5FC3;&#x5F8C;&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x4E0A;&#x7DDA;&#x3002;&#x7E3D;&#x5171;&#x82B1;&#x4E86;&#x516D;&#x500B;&#x6708;&#x7684;&#x6642;&#x7A0B;&#x5C31;&#x5B8C;&#x6210;&#xFF0C;&#x5728;&#x4E0A;&#x7DDA;&#x5F8C;&#x534A;&#x5E74;&#x5F8C;&#xFF0C;&#x6709;&#x4E00;&#x5343;&#x500B;&#x820A;&#x4F01;&#x696D;&#x7528;&#x6236;&#x4F7F;&#x7528;&#xFF0C;&#x5728;&#x4E00;&#x5E74;&#x9593;&#x589E;&#x52A0;&#x5230;&#x5169;&#x5343;&#x500B;&#x4F01;&#x696D;&#x7528;&#x6236;&#xFF0C;&#x9019;&#x4E9B;&#x4F01;&#x696D;&#x7528;&#x6236;&#x4F9B;&#x737B;&#x4E86;&#x5169;&#x5104;&#x7F8E;&#x91D1;&#x7684;&#x71DF;&#x696D;&#x984D;&#xFF0C;&#x56E0;&#x70BA;&#x6211;&#x5011;&#x7522;&#x54C1;&#x589E;&#x52A0;&#x4E86; 10% &#x7684;&#x5BA2;&#x6236;&#x7559;&#x5B58;&#x7387;&#xFF0C;&#x5BE6;&#x969B;&#x4E0A;&#x5C0D;&#x71DF;&#x696D;&#x984D;&#x7684;&#x8CA2;&#x737B;&#x5EA6;&#x662F;&#x4E00;&#x5E74;&#x5169;&#x5343;&#x842C;&#x7F8E;&#x91D1;&#x3002;</p>
<p>&#x5FEB;&#x6A02;&#x7684;&#x6545;&#x4E8B;&#x5C31;&#x5230;&#x6B64;&#x7D50;&#x675F;&#xFF0C;&#x5728;&#x6211;&#x5011;&#x8B49;&#x660E;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x7522;&#x54C1;&#x662F;&#x6709;&#x7528;&#x6236;&#x7684;&#x4E4B;&#x5F8C;&#xFF0C;&#x5C31;&#x662F;&#x8981;&#x628A;&#x6574;&#x500B;&#x7522;&#x54C1;&#xFF0C;&#x7528;&#x9818;&#x82F1;&#x7684;&#x6280;&#x8853;&#x91CD;&#x65B0;&#x5BEB;&#x4E00;&#x904D;&#x3002;&#x9019;&#x500B;&#x904E;&#x7A0B;&#x5F8C;&#x4F86;&#x82B1;&#x4E86;&#x6211;&#x5011;&#x5718;&#x968A;&#x4E09;&#x5E74;&#x7684;&#x6642;&#x9593;&#xFF0C;&#x5230;&#x6211;&#x96E2;&#x958B;&#x7684;&#x4E00;&#x5E74;&#x4E4B;&#x5F8C;&#xFF0C;&#x539F;&#x672C;&#x7684;&#x4F75;&#x8CFC;&#x9032;&#x4F86;&#x7684;&#x5718;&#x968A;&#x90FD;&#x8D70;&#x5149;&#x4E4B;&#x5F8C;&#xFF0C;&#x624D;&#x771F;&#x6B63;&#x628A;&#x98DB;&#x5411;&#x7B2C;&#x4E00;&#x7248;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x4E0B;&#x7DDA;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x500B;&#x6536;&#x8CFC;&#x662F;&#x65E2;&#x98DB;&#x5411;&#x4E4B;&#x5F8C;&#xFF0C;&#x6536;&#x8CFC;&#x7684;&#x300C;&#x9A45;&#x52D5;&#x9EDE;&#x300D;&#xFF0C;&#x9A45;&#x52D5;&#x9EDE;&#x8DDF;&#x98DB;&#x5411;&#x4E00;&#x6A23;&#x662F;&#x628A;&#x7A0B;&#x5F0F;&#x8DD1;&#x5728; AWS &#x96F2;&#x7AEF;&#x7684;&#xFF0C;&#x540C;&#x6A23;&#x4E5F;&#x662F;&#x5728;&#x63DB;&#x76AE;&#x4E4B;&#x5F8C;&#xFF0C;&#x516D;&#x500B;&#x6708;&#x5167;&#x7522;&#x54C1;&#x4E0A;&#x7DDA;&#xFF0C;&#x7136;&#x800C;&#x7522;&#x54C1;&#x5728;&#x4E0A;&#x5E02;&#x4E4B;&#x5F8C;&#x53CD;&#x61C9;&#x4E0D;&#x4F73;&#xFF0C;&#x6211;&#x5011;&#x5728;&#x7E7C;&#x7E8C;&#x7DAD;&#x8B77;&#x4E00;&#x5E74;&#x4E4B;&#x5F8C;&#xFF0C;&#x5C31;&#x628A;&#x4EBA;&#x529B;&#x62BD;&#x8D70;&#x4E86;&#x3002;</p>
<p>&#x524D;&#x9762;&#x5169;&#x500B;&#x4F75;&#x8CFC;&#x6848;&#xFF0C;&#x90FD;&#x7B97;&#x662F;&#x6210;&#x529F;&#x7684;&#x4F75;&#x8CFC;&#x6848;&#xFF0C;&#x9818;&#x82F1;&#x5728;&#x4F75;&#x8CFC;&#x5F8C;&#xFF0C;&#x534A;&#x5E74;&#x5C31;&#x628A;&#x7522;&#x54C1;&#x4E0A;&#x5E02;&#xFF0C;&#x900F;&#x904E;&#x9818;&#x82F1;&#x7684;&#x884C;&#x92B7;&#x80FD;&#x529B;&#xFF0C;&#x5FEB;&#x901F;&#x7684;&#x6E2C;&#x8A66;&#x5E02;&#x5834;&#x53CD;&#x61C9;&#xFF0C;&#x4E0D;&#x7BA1;&#x6700;&#x5F8C;&#x5E02;&#x5834;&#x53CD;&#x61C9;&#x5982;&#x4F55;&#xFF0C;&#x9019;&#x5169;&#x500B;&#x4F75;&#x8CFC;&#x6848;&#x90FD;&#x7B97;&#x662F;&#x6210;&#x529F;&#x7684;&#x4F75;&#x8CFC;&#x6848;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x500B;&#x6536;&#x8CFC;&#x6848;&#x300C;&#x589E;&#x9577;&#x300D;&#x5247;&#x662F;&#x6BD4;&#x8F03;&#x4E0D;&#x5E78;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5728;&#x4F75;&#x8058;&#x4E4B;&#x5F8C;&#xFF0C;&#x6211;&#x5011;&#x4E26;&#x6C92;&#x6709;&#x63A1;&#x7528;&#x300C;&#x589E;&#x9AD8;&#x300D;&#x539F;&#x672C;&#x7684;&#x7522;&#x54C1;&#xFF0C;&#x800C;&#x662F;&#x4FEE;&#x6539;&#x4E86;&#x7522;&#x54C1;&#x672C;&#x8EAB;&#x7684;&#x8A2D;&#x8A08;&#xFF0C;&#x4E26;&#x4E14;&#x4F7F;&#x7528;&#x9818;&#x82F1;&#x7684;&#x6280;&#x8853;&#x91CD;&#x65B0;&#x958B;&#x767C;&#xFF0C;&#x5728;&#x5DE5;&#x7A0B;&#x5E2B;&#x4F7F;&#x7528;&#x4E0D;&#x719F;&#x6089;&#x7684;&#x6280;&#x8853;&#x4E0B;&#xFF0C;&#x9019;&#x500B;&#x5718;&#x968A;&#x82B1;&#x4E86;&#x5341;&#x516B;&#x500B;&#x6708;&#x7684;&#x6642;&#x9593;&#x624D;&#x628A;&#x7522;&#x54C1;&#x4E0A;&#x7DDA;&#xFF0C;&#x800C;&#x5728;&#x4E0A;&#x7DDA;&#x524D;&#xFF0C;&#x6709;&#x4E00;&#x534A;&#x7684;&#x5DE5;&#x7A0B;&#x5E2B;&#x5DF2;&#x7D93;&#x96E2;&#x958B;&#xFF0C;&#x800C;&#x5E36;&#x982D;&#x7684;&#x7522;&#x54C1;&#x7D93;&#x7406;&#x4E5F;&#x5728;&#x4E0A;&#x7DDA;&#x524D;&#x534A;&#x5E74;&#x5C31;&#x96E2;&#x958B;&#x4E86;&#x3002;&#x4E00;&#x822C;&#x4F86;&#x8AAA;&#xFF0C;&#x4E0A;&#x7DDA;&#x5F8C;&#x624D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x6311;&#x6230;&#x7684;&#x958B;&#x59CB;&#xFF0C;&#x7522;&#x54C1;&#x7D93;&#x7406;&#x8981;&#x807D;&#x5BA2;&#x6236;&#x7684;&#x8FD4;&#x61C9;&#xFF0C;&#x4FEE;&#x6539;&#x7522;&#x54C1;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x7D93;&#x904E;&#x5E7E;&#x8F2A;&#x7684;&#x4FEE;&#x4FEE;&#x6539;&#x6539;&#xFF0C;&#x6700;&#x5F8C;&#x624D;&#x6703;&#x662F;&#x4E00;&#x500B;&#x597D;&#x7528;&#x7684;&#x7522;&#x54C1;&#xFF0C;&#x7136;&#x800C;&#x9019;&#x500B;&#x65B0;&#x7522;&#x54C1;&#x5728;&#x4E0A;&#x7DDA;&#x524D;&#x5C31;&#x640D;&#x5931;&#x4E86;&#x7522;&#x54C1;&#x7D93;&#x7406;&#xFF0C;&#x6C92;&#x6709;&#x4EBA;&#x63A5;&#x624B;&#x7522;&#x54C1;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x4E0A;&#x7DDA;&#x5F8C;&#x8B8A;&#x5B64;&#x5152;&#xFF0C;&#x4EBA;&#x529B;&#x4E5F;&#x65E9;&#x65E9;&#x88AB;&#x62BD;&#x8D70;&#x4E86;&#x3002;</p>
<p>&#x7E31;&#x89C0;&#x9019;&#x4E09;&#x500B;&#x6848;&#x5B50;&#xFF0C;&#x6211;&#x7684;&#x9AD4;&#x6703;&#x662F;&#xFF0C;&#x7522;&#x54C1;&#x958B;&#x767C;&#x7684;&#x901F;&#x5EA6;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x6536;&#x8CFC;&#x5F8C;&#xFF0C;&#x539F;&#x672C;&#x7684;&#x7522;&#x54C1;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x4E0A;&#x7DDA;&#xFF0C;&#x6709;&#x500B;&#x6B63;&#x5411;&#x7684;&#x53CD;&#x61C9;&#x8FF4;&#x8DEF;&#xFF0C;&#x5BA2;&#x6236;&#x53CD;&#x61C9;&#x597D;&#xFF0C;&#x5DE5;&#x7A0B;&#x5718;&#x968A;&#x5C31;&#x9AD8;&#x8208;&#xFF0C;&#x6536;&#x8CFC;&#x9032;&#x4F86;&#x7684;&#x5DE5;&#x7A0B;&#x5718;&#x968A;&#x624D;&#x4E0D;&#x6703;&#x65E9;&#x65E9;&#x5C31;&#x96E2;&#x958B;&#xFF0C;&#x624D;&#x4E0D;&#x6703;&#x8B93;&#x6536;&#x8CFC;&#x9032;&#x4F86;&#x7684;&#x7522;&#x54C1;&#x7DDA;&#x8B8A;&#x5B64;&#x5152;&#x3002;</p>
<div id="fb-root"></div>
<script async defer crossorigin="anonymous" src="https://connect.facebook.net/en_US/sdk.js#xfbml=1&amp;version=v8.0&amp;appId=206989179619&amp;autoLogAppEvents=1" nonce="b5OFChIo"></script>

<div class="fb-comments" data-href="https://elderengineer.github.io/book-sillicon-valley/42.html" data-numposts="10" data-width="" lazy="true"></div>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="41.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 併聘 Acquhire">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"企業併購產品整合問題","level":"1.4.2","depth":2,"next":{"title":"大齡工程師的挑戰","level":"1.5","depth":1,"ref":"","articles":[{"title":"程式設計師潛水夫症","level":"1.5.1","depth":2,"path":"51.md","ref":"51.md","articles":[]},{"title":"工程師年齡歧視的真象","level":"1.5.2","depth":2,"path":"52.md","ref":"52.md","articles":[]}]},"previous":{"title":"併聘 Acquhire","level":"1.4.1","depth":2,"path":"41.md","ref":"41.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"42.md","mtime":"2020-10-01T22:31:07.299Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-01T22:31:49.091Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

