
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>工程師年齡歧視的真象 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="51.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    我在飛向的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="26.html">
            
                <a href="26.html">
            
                    
                    談中小企業放款
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="27.html">
            
                <a href="27.html">
            
                    
                    獎助條例
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    在大公司打工的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="31.html">
            
                <a href="31.html">
            
                    
                    帝王
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="32.html">
            
                <a href="32.html">
            
                    
                    組織與企業章呈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="36.html">
            
                <a href="36.html">
            
                    
                    祖傳代碼與組織知識的傳承
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="38.html">
            
                <a href="38.html">
            
                    
                    靠數據指標（KPI）引導團隊
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    矽谷雜談
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="41.html">
            
                <a href="41.html">
            
                    
                    併聘 Acquhire
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="42.html">
            
                <a href="42.html">
            
                    
                    企業併購產品整合問題
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    大齡工程師的挑戰
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="51.html">
            
                <a href="51.html">
            
                    
                    程式設計師潛水夫症
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5.2" data-path="52.html">
            
                <a href="52.html">
            
                    
                    工程師年齡歧視的真象
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    給年輕人的建議
            
                </span>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >工程師年齡歧視的真象</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5DE5;&#x7A0B;&#x5E2B;&#x5E74;&#x9F61;&#x6B67;&#x8996;&#x7684;&#x771F;&#x8C61;">&#x5DE5;&#x7A0B;&#x5E2B;&#x5E74;&#x9F61;&#x6B67;&#x8996;&#x7684;&#x771F;&#x8C61;</h1>
<p>&#x5927;&#x9F61;&#x5DE5;&#x7A0B;&#x5E2B;&#x9762;&#x5C0D;&#x7684;&#x6280;&#x8853;&#x6311;&#x6230;&#xFF0C;&#x662F;&#x6211;&#x6700;&#x8FD1;&#x78B0;&#x4E0A;&#x7684;&#x4E00;&#x5835;&#x9AD8;&#x7246;&#xFF0C;&#x771F;&#x7684;&#x7B49;&#x649E;&#x4E0A;&#x5F8C;&#x624D;&#x77E5;&#x9053;&#xFF0C;&#x4E26;&#x4E0D;&#x662F;&#x90A3;&#x9EBC;&#x5BB9;&#x6613;&#x8DE8;&#x904E;&#xFF0C;&#x4E14;&#x9858;&#x610F;&#x53BB;&#x8DE8;&#x904E;&#x7684;&#x3002;</p>
<p>&#x4EE5;&#x6211;&#x70BA;&#x4F8B;&#xFF0C;&#x6211;&#x7684;&#x5DE5;&#x7A0B;&#x5E2B;&#x751F;&#x6DAF;&#x662F;&#x96A8;&#x8457; Java &#x751F;&#x614B;&#x7CFB;&#x4E00;&#x8D77;&#x6210;&#x9577;&#x7684;&#xFF0C;&#x5341;&#x4E94;&#x5E74;&#x4F86; Java &#x751F;&#x614B;&#x7CFB;&#x7684;&#x6771;&#x897F;&#x6211;&#x5927;&#x591A;&#x6709;&#x78B0;&#x904E;&#xFF0C;&#x5341;&#x5E74;&#x4F86;&#x540C;&#x6642;&#x9084;&#x7528;&#x4E86; Scala &#x751F;&#x614B;&#x7CFB;&#x7684;&#x4E00;&#x4E9B;&#x6771;&#x897F;&#x3002;&#x4F46;&#x662F;&#x53BB;&#x5E74;&#x63DB;&#x5230;&#x4E00;&#x9593;&#x4E94;&#x6B72;&#x5DE6;&#x53F3;&#x7684;&#x8EDF;&#x9AD4;&#x516C;&#x53F8;&#xFF0C;&#x516C;&#x53F8;&#x7528;&#x7684;&#x6280;&#x8853;&#x662F; Scala, GRPC, Akka, Slick, Sangria, Json4s, Consul, Envoy, Python, Airflow &#x7B49;&#xFF0C;&#x6211;&#x5C31;&#x6709;&#x9EDE;&#x9069;&#x61C9;&#x4E0D;&#x826F;&#x4E86;&#x3002;</p>
<p>&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x6211;&#x672C;&#x4F86;&#x5C31;&#x6709;&#x4E00;&#x6574;&#x5957;&#x904B;&#x4F5C;&#x826F;&#x597D;&#x7684;&#x8EDF;&#x9AD4;&#x67B6;&#x69CB;&#x8DDF;&#x51FD;&#x5F0F;&#x5EAB;&#x5728;&#x6211;&#x8166;&#x888B;&#x88E1;&#x9762;&#xFF0C;&#x9019;&#x4E9B;&#x51FD;&#x5F0F;&#x5EAB;&#x7D93;&#x904E; Java &#x751F;&#x614B;&#x7CFB;&#x5341;&#x591A;&#x5E74;&#x4F86;&#x7684;&#x9A57;&#x8B49;&#xFF0C;&#x5927;&#x5927;&#x5C0F;&#x5C0F;&#x7684;&#x529F;&#x80FD;&#x90FD;&#x6709;&#x652F;&#x63F4;&#x4E86;&#xFF0C;&#x7136;&#x5F8C; Bug &#x4E5F;&#x5728;&#x5341;&#x591A;&#x5E74;&#x4F86;&#x88AB;&#x6E05;&#x9664;&#x4E7E;&#x6DE8;&#xFF0C;&#x6709;&#x8A31;&#x591A;&#x7684;&#x6700;&#x4F73;&#x5BE6;&#x4F8B;&#xFF08;best practice&#xFF09;&#x53EF;&#x4EE5;&#x53C3;&#x8003;&#xFF0C;&#x4E0D;&#x7528;&#x91CD;&#x65B0;&#x6478;&#x7D22;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x5FEB;&#x7684;&#x8B8A;&#x5373;&#x6230;&#x529B;&#x3002;</p>
<p>&#x50CF;&#x662F; Json4s &#x5B8C;&#x5B8C;&#x5168;&#x5168;&#x6BD4;&#x4E0D;&#x4E0A; Jackson-Json &#x9019;&#x5957;&#x51FD;&#x5F0F;&#x5EAB;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x70BA;&#x9019;&#x662F; Scala &#x539F;&#x751F;&#x7684;&#x51FD;&#x5F0F;&#x5EAB;&#xFF0C;&#x6240;&#x4EE5;&#x5F97;&#x5230;&#x6211;&#x5011;&#x5718;&#x968A;&#x7684;&#x63A1;&#x7528;&#x3002;&#x5176;&#x4ED6;&#x66F4;&#x4E0D;&#x7528;&#x8AAA; IoC &#x7684;&#x67B6;&#x69CB;&#xFF0C;&#x6709; Spring &#x6216; Guice &#x7684;&#x67B6;&#x6846;&#x8F14;&#x8457;&#xFF0C;&#x53EF;&#x4EE5;&#x66F4;&#x6709;&#x6548;&#x7387;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x7684;&#x524D;&#x5718;&#x968A;&#x5BE7;&#x9858;&#x91CD;&#x65B0;&#x9020;&#x8F2A;&#x5B50;&#xFF0C;&#x7528; cake pattern &#x52A0;&#x4E0A; IoC &#x7684;&#x89C0;&#x5FF5;&#xFF0C;&#x4F86;&#x628A;&#x8EDF;&#x9AD4;&#x5143;&#x4EF6;&#x4E32;&#x63A5;&#x8D77;&#x4F86;&#x3002;</p>
<p>&#x6211;&#x5728;&#x9019;&#x500B;&#x65B0;&#x5718;&#x968A;&#x4E2D;&#xFF0C;&#x88AB;&#x8FEB;&#x8981;&#x628A;&#x719F;&#x6089;&#x7684;&#x67B6;&#x69CB;&#xFF0C;&#x4E00;&#x500B;&#x500B;&#x90FD;&#x62BD;&#x63DB;&#x6389;&#xFF0C;&#x91CD;&#x65B0;&#x518D;&#x6478;&#x7D22;&#x4E00;&#x500B;&#x4E0D;&#x540C;&#x7684;&#x51FD;&#x5F0F;&#x5EAB;&#xFF0C;&#x770B;&#x4ED6;&#x600E;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x624B;&#x6CD5;&#x89E3;&#x6C7A;&#x540C;&#x4E00;&#x500B;&#x554F;&#x984C;&#x3002;&#x5C0D;&#x6211;&#x4F86;&#x8AAA;&#xFF0C;&#x65E2;&#x4F7F;&#x4E00;&#x500B;&#x65B0;&#x7684;&#x51FD;&#x5F0F;&#x5EAB;&#x6709;&#x6BD4;&#x820A;&#x7684;&#x51FD;&#x5F0F;&#x5EAB;&#x597D;&#x4E0A; 10% &#x597D;&#x4E86;&#xFF0C;&#x5C0D;&#x6211;&#x500B;&#x4EBA;&#x7684;&#x7E3D;&#x751F;&#x7522;&#x529B;&#x53EA;&#x6709;&#x589E;&#x52A0; 1% &#xFF0C;&#x82E5;&#x662F;&#x6263;&#x6389;&#x5B78;&#x7FD2;&#x7684;&#x6642;&#x9593;&#xFF0C;&#x7B97;&#x4E0A;&#x6A5F;&#x6703;&#x6210;&#x672C;&#xFF0C;&#x5C0D;&#x6211;&#x53CD;&#x800C;&#x662F;&#x6C92;&#x6709;&#x5E6B;&#x52A9;&#x7684;&#xFF0C;&#x540C;&#x6A23;&#x7684;&#x6642;&#x9593;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x82B1;&#x5728;&#x5B78;&#x7FD2;&#x65B0;&#x7684;&#x9818;&#x57DF;&#x4E0A;&#x9762;&#xFF0C;&#x64F4;&#x5C55;&#x6211;&#x7684;&#x77E5;&#x8B58;&#x7BC4;&#x570D;&#x3002;</p>
<p>&#x5728;&#x9019;&#x6BB5;&#x6642;&#x9593;&#xFF0C;&#x6211;&#x9AD4;&#x6703;&#x5230;&#x300C;&#x6280;&#x8853;&#x662F;&#x719F;&#x7684;&#x597D;&#x300D;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x4EC0;&#x9EBC;&#x6280;&#x8853;&#xFF0C;&#x7528;&#x4E0A;&#x624B;&#x5C31;&#x597D;&#xFF0C;&#x53CD;&#x6B63;&#x5230;&#x6700;&#x5F8C;&#x5206;&#x9AD8;&#x4E0B;&#x7684;&#xFF0C;&#x5927;&#x591A;&#x662F;&#x5C0D;&#x5DE5;&#x5177;&#x7684;&#x719F;&#x6089;&#x7A0B;&#x5EA6;&#x6700;&#x91CD;&#x8981;&#x3002;<strong>&#x5927;&#x591A;&#x6578;&#x4EBA;&#x662F;&#x628A;&#x4E8C;&#x5341;&#x591A;&#x6B72;&#x524D;&#x63A5;&#x89F8;&#x7684;&#x4E16;&#x754C;&#x7576;&#x5E38;&#x614B;&#xFF0C;&#x7136;&#x5F8C;&#x7528;&#x4E00;&#x8F29;&#x5B50;&#x5728;&#x9019;&#x500B;&#x6642;&#x9593;&#x51CD;&#x7D50;&#x7684;&#x4E16;&#x754C;&#x5167;&#xFF0C;&#x6700;&#x4F73;&#x5316;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x6D3B;&#x65B9;&#x5F0F;&#x3002;</strong></p>
<h1 id="&#x77E5;&#x8B58;&#x63A2;&#x7D22;&#x7684;&#x904E;&#x7A0B;">&#x77E5;&#x8B58;&#x63A2;&#x7D22;&#x7684;&#x904E;&#x7A0B;</h1>
<p><a href="http://matt.might.net/" target="_blank">Matt Might</a>&#x7528;&#x4E86;<a href="http://matt.might.net/articles/phd-school-in-pictures/" target="_blank">&#x5E7E;&#x500B;&#x7C21;&#x800C;&#x6613;&#x77AD;&#x7684;&#x5716;&#x7247;</a>&#x6E05;&#x695A;&#x7684;&#x5F62;&#x5BB9;&#x4E86;&#x535A;&#x58EB;&#x7684;&#x5DE5;&#x4F5C;&#x5230;&#x5E95;&#x662F;&#x5728;&#x505A;&#x4EC0;&#x9EBC;&#x3002;</p>
<ul>
<li><img src="images/PhDKnowledge.001.jpg" width="200">&#x628A;&#x4EBA;&#x985E;&#x7684;&#x6240;&#x6709;&#x77E5;&#x8B58;&#x60F3;&#x50CF;&#x662F;&#x4E00;&#x500B;&#x5927;&#x5713;</li>
<li><img src="images/PhDKnowledge.002.jpg" width="200">&#x7576;&#x4F60;&#x5C0F;&#x5B78;&#x5FC5;&#x696D;&#x5F8C;&#xFF0C;&#x4F60;&#x6709;&#x4E00;&#x4E9B;&#x7406;&#x89E3;</li>
<li><img src="images/PhDKnowledge.003.jpg" width="200">&#x9AD8;&#x4E2D;&#x4E4B;&#x5F8C;&#xFF0C;&#x4F60;&#x53C8;&#x591A;&#x5B78;&#x4E86;&#x4E00;&#x4E9B;</li>
<li><img src="images/PhDKnowledge.004.jpg" width="200">&#x5230;&#x4E86;&#x5927;&#x5B78;&#xFF0C;&#x4F60;&#x958B;&#x59CB;&#x5B78;&#x7FD2;&#x5C08;&#x696D;&#x9818;&#x57DF;</li>
<li><img src="images/PhDKnowledge.005.jpg" width="200">&#x5230;&#x4E86;&#x78A9;&#x58EB;&#xFF0C;&#x4F60;&#x53C8;&#x591A;&#x7CBE;&#x6DF1;&#x4E86;&#x4E00;&#x4E9B;</li>
<li><img src="images/PhDKnowledge.006.jpg" width="200">&#x5230;&#x4E86;&#x535A;&#x58EB;&#x73ED;&#xFF0C;&#x958B;&#x59CB;&#x8B80;&#x8AD6;&#x6587;&#x5F8C;&#xFF0C;&#x958B;&#x59CB;&#x9054;&#x5230;&#x67D0;&#x500B;&#x9818;&#x57DF;&#x7684;&#x6700;&#x524D;&#x7DDA;</li>
<li><img src="images/PhDKnowledge.007.jpg" width="200">&#x653E;&#x5927;</li>
<li><img src="images/PhDKnowledge.008.jpg" width="200">&#x7D93;&#x904E;&#x5E7E;&#x5E74;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x4E00;&#x76F4;&#x63A8;&#x9032;</li>
<li><img src="images/PhDKnowledge.009.jpg" width="200">&#x7E3D;&#x7B97;&#xFF0C;&#x67D0;&#x4E00;&#x5929;&#xFF0C;&#x4F60;&#x6709;&#x500B;&#x5C0F;&#x7A81;&#x7834;</li>
<li><img src="images/PhDKnowledge.010.jpg" width="200">&#x9019;&#x500B;&#x5C31;&#x53EB;&#x535A;&#x58EB;&#x5B78;&#x4F4D;</li>
<li><img src="images/PhDKnowledge.012.jpg" width="200"> &#x4F46;&#x662F;&#x5225;&#x592A;&#x81EA;&#x6EFF;&#xFF0C;&#x5F9E;&#x5DE8;&#x89C0;&#x770B;&#x4F86;&#x662F;&#x9019;&#x6A23;&#x7684;</li>
</ul>
<h1 id="&#x65B0;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00;">&#x65B0;&#x7A0B;&#x5F0F;&#x8A9E;&#x8A00;</h1>
<p>&#x70BA;&#x4EC0;&#x9EBC;&#x904E;&#x53BB; 20 &#x5E74;&#x4F86;&#xFF0C;&#x6211;&#x5011;&#x6709;&#x9019;&#x9EBC;&#x591A;&#x7684;&#x65B0;&#x51FD;&#x5F0F;&#x5EAB;&#x65B0;&#x8A9E;&#x8A00;&#x8208;&#x8D77;&#xFF0C;&#x7136;&#x5F8C;&#x71B1;&#x9580;&#x4E86;&#x5E7E;&#x5E74;&#x5F8C;&#xFF0C;&#x6700;&#x5F8C;&#x5927;&#x591A;&#x6578;&#x516C;&#x53F8;&#x9084;&#x662F;&#x56DE;&#x6B78; Java &#x751F;&#x614B;&#x7CFB;&#xFF0C;&#x70BA;&#x4EC0;&#x9EBC;&#x8EDF;&#x9AD4;&#x7522;&#x696D;&#x8981;&#x82B1;&#x9019;&#x9EBC;&#x591A;&#x7684;&#x5FC3;&#x529B;&#xFF0C;&#x91CD;&#x9020;&#x8F2A;&#x5B50;&#xFF0C;&#x63A2;&#x7D22;&#x4E0D;&#x4E00;&#x6A23;&#x7684;&#x53EF;&#x80FD;&#x5462;&#xFF1F;</p>
<p>&#x56E0;&#x70BA;&#x6C92;&#x6709;&#x4E86;&#x9019;&#x4E9B;&#x5F9E;&#x65B0;&#x9020;&#x8F2A;&#x5B50;&#x7684;&#x77E5;&#x8B58;&#x63A2;&#x7D22;&#x904E;&#x7A0B;&#xFF0C;&#x4EBA;&#x985E;&#x7684;&#x79D1;&#x6280;&#x4E0D;&#x6703;&#x9032;&#x6B65;&#xFF0C;&#x6240;&#x4EE5;&#x8EDF;&#x9AD4;&#x696D;&#x5728;&#x53EF;&#x898B;&#x7684;&#x5C07;&#x4F86;&#xFF0C;&#x90FD;&#x6703;&#x4E00;&#x76F4;&#x767C;&#x660E;&#x65B0;&#x7684;&#x8A9E;&#x8A00;&#xFF0C;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5BE6;&#x4F5C;&#x65B9;&#x5F0F;&#xFF0C;&#x4F86;&#x89E3;&#x6C7A;&#x540C;&#x4E00;&#x6A23;&#x7684;&#x554F;&#x984C;&#x3002;</p>
<p>&#x5728;&#x904E;&#x53BB;&#x7684;&#x4E8C;&#x5341;&#x5E74;&#x9593;&#xFF0C;&#x6709;&#x8A31;&#x591A;&#x7684;&#x8A9E;&#x8A00;&#x8208;&#x8D77;&#xFF0C;&#x5982; PHP&#x3001;Java&#x3001;C#&#x3001;Python&#x3001;Ruby&#x3001;Java Script / Node.JS&#x3001;Typescript&#x3001;Coffee Script&#x3001;Groovy&#x3001;Kotlin&#x3001;Clojure&#x3001;Go&#x53CA; Rust &#x7B49;&#x8A9E;&#x8A00;&#xFF0C;&#x5404;&#x6709;&#x512A;&#x52A3;&#xFF0C;&#x6709;&#x4E9B;&#x8B8A;&#x6210;&#x4E3B;&#x6D41;&#x8A9E;&#x8A00;&#xFF0C;&#x6709;&#x4E9B;&#x5728;&#x98A8;&#x982D;&#x904E;&#x4E86;&#x4E4B;&#x5F8C;&#xFF0C;&#x5C31;&#x6F38;&#x6F38;&#x5E73;&#x6DE1;&#x4E0B;&#x53BB;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x662F;&#x8EDF;&#x9AD4;&#x884C;&#x696D;&#x7684;&#x65B0;&#x4EBA;&#xFF0C;&#x4F60;&#x662F;&#x5426;&#x8A72;&#x8FFD;&#x6C42;&#x65B0;&#x6280;&#x8853;&#xFF0C;&#x9084;&#x662F;&#x8981;&#x5B78;&#x7FD2;&#x7A69;&#x5B9A;&#x597D;&#x7528;&#x7684;&#x6280;&#x8853;&#x5462;&#xFF1F;&#x9019;&#x5F71;&#x97FF;&#x5230;&#x4E86;&#x4F60;&#x672A;&#x4F86;&#x7684;&#x8077;&#x5834;&#x751F;&#x6DAF;&#x3002;</p>
<p>&#x50CF;&#x662F;&#x77FD;&#x8C37;&#x7684;&#x5927;&#x516C;&#x53F8;&#xFF0C;&#x4E00;&#x5B9A;&#x662F;&#x9078;&#x7528;&#x6700;&#x65B0;&#x6700;&#x71B1;&#x9580;&#x7684;&#x6280;&#x8853;&#xFF0C;&#x56E0;&#x70BA;&#x6700;&#x65B0;&#x6700;&#x71B1;&#x9580;&#x7684;&#x6280;&#x8853;&#xFF0C;&#x624D;&#x80FD;&#x5438;&#x5F15;&#x5230;&#x6E90;&#x6E90;&#x4E0D;&#x6C7A;&#x7684;&#x65B0;&#x9BAE;&#x4EBA;&#x52A0;&#x5165;&#x516C;&#x53F8;&#xFF0C;&#x65B0;&#x9BAE;&#x4EBA;&#x624D;&#x662F;&#x516C;&#x53F8;&#x7684;&#x672A;&#x4F86;&#xFF0C;&#x9700;&#x8981;&#x9019;&#x4E9B;&#x52DE;&#x52D5;&#x529B;&#x4F86;&#x63A8;&#x52D5;&#x516C;&#x53F8;&#x7684;&#x696D;&#x52D9;&#x3002;&#x5982;&#x679C;&#x4E00;&#x9593;&#x516C;&#x53F8;&#x9078;&#x7528;&#x4E86;&#x975E;&#x71B1;&#x9580;&#x6280;&#x8853;&#xFF0C;&#x90A3;&#x9EBC;&#x4F7F;&#x7528;&#x8005;&#x7684;&#x7E3D;&#x91CF;&#x5C11;&#xFF0C;&#x6311;&#x9078;&#x5230;&#x4E00;&#x6D41;&#x4EBA;&#x6750;&#x7684;&#x6A5F;&#x6703;&#x66F4;&#x5C31;&#x5C11;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x9019;&#x6709;&#x53EF;&#x80FD;&#x8B8A;&#x6210;&#x516C;&#x53F8;&#x6210;&#x9577;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x7121;&#x6CD5;&#x627E;&#x5230;&#x8DB3;&#x5920;&#x7684;&#x4EBA;&#x6750;&#x4F86;&#x63A8;&#x52D5;&#x516C;&#x53F8;&#x7684;&#x65B0;&#x696D;&#x52D9;&#x3002;</p>
<p>&#x800C;&#x5C0D;&#x65BC;&#x65B0;&#x9BAE;&#x4EBA;&#x4F86;&#x8AAA;&#xFF0C;&#x9078;&#x7528;&#x65B0;&#x8208;&#x7684;&#x8A9E;&#x8A00;&#x6280;&#x8853;&#xFF0C;&#x6709;&#x9664;&#x4E86;&#x5E02;&#x5834;&#x9700;&#x6C42;&#x4EE5;&#x5916;&#x7684;&#x597D;&#x8655;&#xFF1B;&#x7F85;&#x99AC;&#x4E0D;&#x662F;&#x4E00;&#x5929;&#x9020;&#x6210;&#xFF0C;&#x8EDF;&#x9AD4;&#x7684;&#x8907;&#x96DC;&#x5EA6;&#x4E5F;&#x4E0D;&#x662F;&#x4E00;&#x5929;&#x9020;&#x6210;&#x7684;&#xFF1B;&#x6211;&#x5E38;&#x807D;&#x5230;&#x6709;&#x4EBA;&#x5831;&#x6028; Spring &#x592A;&#x904E;&#x65BC;&#x8907;&#x96DC;&#xFF0C;&#x4F46;&#x662F;&#x5C0D;&#x6211;&#x4F86;&#x8AAA; Spring IoC &#x662F;&#x5F88;&#x7CBE;&#x5DE7;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x56E0;&#x70BA;&#x5927;&#x74B0;&#x5883;&#x7684;&#x6539;&#x8B8A;&#xFF0C; Spring IoC &#x5F9E;&#x4E00;&#x958B;&#x59CB;&#x7684;&#x4F7F;&#x7528; XML &#x4F86;&#x8A2D;&#x5B9A;&#xFF0C;&#x6F14;&#x5316;&#x5230;&#x4F7F;&#x7528;&#x81EA;&#x5DF1;&#x7684; Annotation &#x4F86;&#x8A2D;&#x5B9A;&#xFF0C;&#x6700;&#x5F8C;&#x662F;&#x5230; Java &#x6A19;&#x6E96;&#x5316;&#x7684; JSR-330 &#x4F86;&#x4F7F;&#x7528;&#xFF0C;&#x5C0D;&#x65BC;&#x65B0;&#x9032;&#x7528;&#x6236;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5B78;&#x7FD2;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x7A2E;&#x5C31;&#x597D;&#x3002;</p>
<p>&#x6211;&#x80FD;&#x5920;&#x7406;&#x89E3;&#x9019;&#x4E9B;&#xFF0C;&#x662F;&#x56E0;&#x70BA;&#x6211;&#x8DDF;&#x8457;&#x9019;&#x500B;&#x6846;&#x67B6;&#x4E00;&#x8D77;&#x6210;&#x9577;&#x7684;&#xFF0C;&#x7406;&#x89E3;&#x5B83;&#x5728;&#x904E;&#x53BB;&#x56E0;&#x70BA;&#x4EC0;&#x9EBC;&#x7406;&#x7531;&#x800C;&#x505A;&#x51FA;&#x8B8A;&#x66F4;&#xFF0C;&#x8DDF;&#x4EC0;&#x9EBC;&#x6B77;&#x53F2;&#x907A;&#x7559;&#x505A;&#x51FA;&#x59A5;&#x5354;&#xFF0C;&#x70BA;&#x4EC0;&#x9EBC;&#x4E00;&#x500B;&#x529F;&#x80FD;&#x6703;&#x8A2D;&#x8A08;&#x6210;&#x9019;&#x6A23;&#x3002;&#x4E5F;&#x56E0;&#x6B64;&#x6211;&#x5EFA;&#x8B70;&#x65B0;&#x9BAE;&#x4EBA;&#xFF0C;&#x8981;&#x5B78;&#x7FD2;&#x5E02;&#x5834;&#x4E0A;&#x65B0;&#x8208;&#x71B1;&#x9580;&#x7684;&#x6280;&#x8853;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5F9E;&#x982D;&#xFF0C;&#x7576;&#x4E00;&#x500B;&#x6846;&#x67B6;&#x5F88;&#x7CBE;&#x5DE7;&#x6642;&#xFF0C;&#x628A;&#x5B83;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x8B80;&#x5B8C;&#xFF0C;&#x7576;&#x5B83;&#x6BCF;&#x4E00;&#x6B21;&#x65B0;&#x589E;&#x4E00;&#x500B;&#x529F;&#x80FD;&#x6642;&#xFF0C;&#x60F3;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x4F60;&#x6703;&#x600E;&#x9EBC;&#x505A;&#xFF0C;&#x70BA;&#x4EC0;&#x9EBC;&#x5B98;&#x65B9;&#x6703;&#x505A;&#x51FA;&#x9019;&#x4E9B;&#x53D6;&#x6368;&#x3002;</p>
<h1 id="&#x6280;&#x8853;&#x662F;&#x719F;&#x7684;&#x597D;">&#x6280;&#x8853;&#x662F;&#x719F;&#x7684;&#x597D;</h1>
<p>&#x4F46;&#x662F;&#x5728;&#x8FFD;&#x6C42;&#x65B0;&#x6280;&#x8853;&#x5916;&#xFF0C;&#x4F60;&#x4E5F;&#x8981;&#x8003;&#x91CF;&#x5230;&#xFF0C;&#x73FE;&#x5728;&#x591A;&#x6578;&#x7684;&#x65B0;&#x6280;&#x8853;&#xFF0C;&#x662F;&#x8A2D;&#x8A08;&#x7D66;&#x5927;&#x516C;&#x53F8;&#x7528;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x8981;&#x4E00;&#x76F4;&#x5E6B;&#x8D85;&#x5927;&#x578B;&#x7DB2;&#x8DEF;&#x516C;&#x53F8;&#x4E0A;&#x73ED;&#xFF0C;&#x4F60;&#x5B78;&#x7FD2;&#x7684;&#x6280;&#x8853;&#x5F80;&#x5F80;&#x662F;&#x904E;&#x5EA6;&#x8907;&#x96DC;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x4E0D;&#x5408;&#x7528;&#x7684;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#x73FE;&#x5728;&#x8A31;&#x591A;&#x7684;&#x958B;&#x6E90;&#x5C08;&#x6848;&#xFF0C;&#x4F7F;&#x7528; Protocol Buffers &amp; GRPC &#x4F86;&#x505A;&#x5E8F;&#x5217;&#x5316;&#xFF08;Serialization&#xFF09;&#xFF0C;&#x628A;&#x8A18;&#x61B6;&#x9AD4;&#x4E2D;&#x7684;&#x72C0;&#x614B;&#x5BEB;&#x5230;&#x78C1;&#x789F;&#x4E0A;&#x6216;&#x900F;&#x904E;&#x7DB2;&#x8DEF;&#x50B3;&#x9001;&#x5230;&#x9060;&#x65B9;&#xFF0C;&#x4F46;&#x662F; PB  &#x7684;&#x8A31;&#x591A;&#x8A2D;&#x8A08;&#x662F;&#x70BA;&#x4E86;&#x6E1B;&#x5C11;&#x901A;&#x8A0A;&#x6642;&#x4F7F;&#x7528;&#x7684;&#x7A7A;&#x9593;&#x7684;&#xFF0C;&#x50CF;&#x662F; PB &#x6703;&#x7701;&#x7565;&#x6389;&#x6B04;&#x4F4D;&#x7684;&#x540D;&#x7A31;&#xFF0C;&#x7528; index &#x4F86;&#x53D6;&#x4EE3;&#xFF0C;&#x5728;&#x5167;&#x5BB9;&#x4E0A;&#x4E5F;&#x6703;&#x7528;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x58D3;&#x7E2E;&#x7A7A;&#x9593;&#x3002;&#x9019;&#x4E9B;&#x505A;&#x6CD5;&#x5C0D;&#x8C37;&#x6B4C;&#x4F86;&#x8AAA;&#x90FD;&#x662F;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x56E0;&#x70BA;&#x8C37;&#x54E5;&#x7684;&#x8CC7;&#x6599;&#x91CF;&#x592A;&#x5927;&#xFF0C;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x7701;&#x4E0B;&#x767E;&#x5206;&#x4E4B;&#x4E00;&#x7684;&#x7A7A;&#x9593;&#xFF0C;&#x90A3;&#x9EBC;&#x5C31;&#x53EF;&#x4EE5;&#x5E6B;&#x516C;&#x53F8;&#x7701;&#x4E0B;&#x6578;&#x5343;&#x842C;&#x6578;&#x5104;&#x7F8E;&#x91D1;&#x7684;&#x7DB2;&#x8DEF;&#x50B3;&#x8F38;&#x8CBB;&#x7528;&#x53CA;&#x5132;&#x5B58;&#x8CBB;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x5927;&#x591A;&#x6578;&#x516C;&#x53F8;&#x4E0D;&#x662F;&#x8C37;&#x6B4C;&#x4E0D;&#x662F;&#x81C9;&#x66F8;&#xFF0C;&#x4F60;&#x7684;&#x516C;&#x53F8;&#x7684;&#x7DB2;&#x8DEF;&#x6D41;&#x91CF;&#x9023;&#x8C37;&#x6B4C;&#x7684;&#x842C;&#x5206;&#x4E4B;&#x4E00;&#x90FD;&#x4E0D;&#x5230;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x53BB;&#x505A;&#x9019;&#x4E9B;&#x6700;&#x4F73;&#x5316;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x4FEE;&#x6539;&#x662F;&#x7121;&#x6CD5;&#x5411;&#x524D;&#x76F8;&#x5BB9;&#x7684;&#xFF0C;&#x662F;&#x8981;&#x9760;&#x4EBA;&#x8166;&#x53BB;&#x505A;&#x7684;&#x8ABF;&#x6574;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#x628A;&#x4E00;&#x500B;&#x6B04;&#x4F4D;&#x5F9E; int &#x6539;&#x6210; long &#xFF0C;&#x7B49;&#x4F60;&#x7684;&#x8CC7;&#x6599;&#x6709; 1TB &#x6642;&#xFF0C;&#x518D;&#x4F86;&#x8003;&#x616E;&#x6700;&#x4F73;&#x5316;&#x5427;&#xFF0C;&#x7A0B;&#x5F0F;&#x8A2D;&#x8A08;&#x5E2B;&#x7684;&#x5DE5;&#x8CC7;&#x662F;&#x5F88;&#x8CB4;&#x7684;&#x3002;</p>
<p>&#x6211;&#x662F;&#x5EFA;&#x8B70;&#x5927;&#x591A;&#x6578;&#x4EBA;&#x7528; json &#x4F86;&#x505A; RPC protocol &#xFF0C;&#x7528; json &#x4F86;&#x505A;&#x8CC7;&#x6599;&#x5EAB;&#x5167;&#x7684; blob &#xFF0C;&#x7528; json &#x4F86;&#x505A; hadoop / big data &#x7684;&#x683C;&#x5F0F;&#xFF0C; json &#x6700;&#x5927;&#x7684;&#x597D;&#x8655;&#x662F;&#x597D;&#x8B80;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x7528;&#x4EBA;&#x773C;&#x5C31;&#x53EF;&#x4EE5;&#x8B80;&#x4ED6;&#x7684;&#x5167;&#x5BB9;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x9760;&#x5176;&#x5B83;&#x7A0B;&#x5F0F;&#x4F86;&#x8F49;&#x63DB;&#xFF0C;&#x800C;&#x4E14; json &#x7684;&#x652F;&#x63F4;&#x5F88;&#x5EE3;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x4EC0;&#x9EBC;&#x5927;&#x6578;&#x64DA;&#x6846;&#x67B6;&#x90FD;&#x652F;&#x63F4; json &#x3002;&#x6211;&#x4E0A;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#xFF0C;&#x6709;&#x4E00;&#x90E8;&#x4EFD;&#x7684;&#x6642;&#x9593;&#xFF0C;&#x56E0;&#x70BA;&#x4E0D;&#x540C;&#x7CFB;&#x7D71;&#x5403;&#x4E0D;&#x540C;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x5C31;&#x82B1;&#x5728; json / protobuf / parsec &#x7684;&#x8CC7;&#x6599;&#x683C;&#x5F0F;&#x8F49;&#x63DB;&#x4E0A;&#x9762;&#x3002;</p>
<p>&#x626F;&#x9060;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5B78;&#x7FD2;&#x4E00;&#x5957;&#x904B;&#x4F5C;&#x826F;&#x597D;&#x7684;&#x5168;&#x68E7; full-stack &#x6846;&#x67B6;&#xFF0C;&#x4F8B;&#x5982;&#x50CF;&#x662F; Rails &#xFF0C;&#x82B1;&#x500B;&#x4E09;&#x5E74;&#x6642;&#x9593;&#x628A;&#x4ED6;&#x88E1;&#x88E1;&#x5916;&#x5916;&#x90FD;&#x6478;&#x500B;&#x900F;&#x5FB9;&#xFF0C;&#x672A;&#x4F86;&#x8981;&#x505A;&#x4E00;&#x500B;&#x65B0;&#x7522;&#x54C1;&#xFF0C;&#x90A3;&#x9EBC;&#x5728;&#x6280;&#x8853;&#x65B9;&#x9762;&#x7684;&#x6642;&#x7A0B;&#x4F30;&#x7B97;&#xFF0C;&#x5C07;&#x6703;&#x8F03;&#x7C21;&#x55AE;&#x5C31;&#x4F30;&#x7B97;&#x51FA;&#x4E00;&#x500B;&#x6642;&#x7A0B;&#x8868;&#xFF0C;&#x800C;&#x4E14;&#x56E0;&#x70BA;&#x4F60;&#x5C0D;&#x7D30;&#x7BC0;&#x6E05;&#x695A;&#xFF0C;&#x5C31;&#x66F4;&#x4E0D;&#x5BB9;&#x6613;&#x56E0;&#x70BA;&#x7D30;&#x7BC0;&#x51FA;&#x5305;&#xFF0C;&#x800C;&#x5F71;&#x97FF;&#x5230;&#x5C08;&#x6848;&#x7684;&#x6642;&#x7A0B;&#x3002;</p>
<p>&#x81F3;&#x65BC;&#x5C0D;&#x65BC;&#x65B0;&#x9BAE;&#x4EBA;&#x8A72;&#x8D70;&#x90A3;&#x4E00;&#x689D;&#x8DEF;&#xFF0C;&#x662F;&#x8981;&#x8FFD;&#x6C42;&#x65B0;&#x79D1;&#x6280;&#xFF0C;&#x9084;&#x662F;&#x6478;&#x719F;&#x67D0;&#x4E00;&#x5957;&#x6280;&#x8853;&#xFF0C;&#x6211;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x6703;&#x6709;&#x8A0E;&#x8AD6;&#x3002;</p>
<div id="fb-root"></div>
<script async defer crossorigin="anonymous" src="https://connect.facebook.net/en_US/sdk.js#xfbml=1&amp;version=v8.0&amp;appId=206989179619&amp;autoLogAppEvents=1" nonce="b5OFChIo"></script>

<div class="fb-comments" data-href="https://elderengineer.github.io/book-sillicon-valley/52.html" data-numposts="10" data-width="" lazy="true"></div>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="51.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 程式設計師潛水夫症">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"工程師年齡歧視的真象","level":"1.5.2","depth":2,"next":{"title":"給年輕人的建議","level":"1.6","depth":1,"ref":"","articles":[]},"previous":{"title":"程式設計師潛水夫症","level":"1.5.1","depth":2,"path":"51.md","ref":"51.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"52.md","mtime":"2020-10-02T23:32:31.359Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-02T23:33:11.086Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

