
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>遠端工作與工作環境研究 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="52.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    我在飛向的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="26.html">
            
                <a href="26.html">
            
                    
                    談中小企業放款
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="27.html">
            
                <a href="27.html">
            
                    
                    獎助條例
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    在大公司打工的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="31.html">
            
                <a href="31.html">
            
                    
                    帝王
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="32.html">
            
                <a href="32.html">
            
                    
                    組織與企業章呈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="36.html">
            
                <a href="36.html">
            
                    
                    祖傳代碼與組織知識的傳承
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="38.html">
            
                <a href="38.html">
            
                    
                    靠數據指標（KPI）引導團隊
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    矽谷雜談
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="41.html">
            
                <a href="41.html">
            
                    
                    併聘 Acquhire
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="42.html">
            
                <a href="42.html">
            
                    
                    企業併購產品整合問題
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    大齡工程師的挑戰
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="51.html">
            
                <a href="51.html">
            
                    
                    程式設計師潛水夫症
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="52.html">
            
                <a href="52.html">
            
                    
                    工程師年齡歧視的真象
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5.3" data-path="53.html">
            
                <a href="53.html">
            
                    
                    遠端工作與工作環境研究
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    給年輕人的建議
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="62.html">
            
                <a href="62.html">
            
                    
                    該不該念博士
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >遠端工作與工作環境研究</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#x8207;&#x5DE5;&#x4F5C;&#x74B0;&#x5883;&#x7814;&#x7A76;">&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#x8207;&#x5DE5;&#x4F5C;&#x74B0;&#x5883;&#x7814;&#x7A76;</h1>
<p>&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#xFF0C;&#x5728;&#x6B66;&#x6F22;&#x75C5;&#x6BD2;&#x7684;&#x5F71;&#x97FF;&#x4E0B;&#xFF0C;&#x7A81;&#x7136;&#x5F97;&#x5230;&#x8A31;&#x591A;&#x516C;&#x53F8;&#x7684;&#x652F;&#x6301;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x662F;&#x89BA;&#x5F97;&#x7B49;&#x5230;&#x71B1;&#x6F6E;&#x4E00;&#x904E;&#xFF0C;&#x591A;&#x6578;&#x516C;&#x53F8;&#x9084;&#x662F;&#x6703;&#x53EB;&#x5927;&#x5BB6;&#x4E56;&#x4E56;&#x56DE;&#x53BB;&#x4E0A;&#x73ED;&#x7684;&#x3002;</p>
<p>&#x4EE5;&#x8C37;&#x6B4C;&#x70BA;&#x4F8B;&#xFF0C;&#x5728; 2015 &#x5E74;&#x4EE5;&#x524D;&#xFF0C;&#x662F;&#x652F;&#x6301;&#x54E1;&#x5DE5;&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x662F;&#x597D;&#x4EBA;&#x6750;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5730;&#x7403;&#x7684;&#x4EFB;&#x4E00;&#x5730;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E00;&#x500B;&#x5718;&#x968A;&#x7684;&#x6210;&#x54E1;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6642;&#x5340;&#x8DDF;&#x5730;&#x5340;&#x4E0A;&#x73ED;&#xFF0C;&#x4F46;&#x662F;&#x81EA; 2015 &#x5E74;&#x5F8C;&#xFF0C;&#x8C37;&#x6B4C;&#x958B;&#x59CB;&#x8981;&#x6C42;&#x5718;&#x968A;&#x7684;&#x6210;&#x54E1;&#x642C;&#x5BB6;&#x5230;&#x540C;&#x4E00;&#x500B;&#x57CE;&#x5E02;&#x53BB;&#xFF0C;&#x4E0D;&#x518D;&#x7E7C;&#x7E8C;&#x652F;&#x6301;&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x4EE5;&#x8C37;&#x6B4C;&#x4E8C;&#x5341;&#x842C;&#x7684;&#x54E1;&#x5DE5;&#x6578;&#x91CF;&#x4F86;&#x8AAA;&#xFF0C;&#x662F;&#x6709;&#x8FA6;&#x6CD5;&#x505A;&#x5F88;&#x591A;&#x8FA6;&#x516C;&#x5BA4;&#x7814;&#x7A76;&#x7684;&#xFF0C;&#x6211;&#x731C;&#x60F3;&#x8C37;&#x6B4C;&#x5167;&#x90E8;&#x7684;&#x7814;&#x7A76;&#x55AE;&#x4F4D;&#x61C9;&#x8A72;&#x662F;&#x767C;&#x73FE;&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#x7684;&#x6548;&#x7387;&#x4E26;&#x4E0D;&#x597D;&#xFF0C;&#x624D;&#x6703;&#x8981;&#x6C42;&#x5718;&#x968A;&#x5728;&#x540C;&#x4E00;&#x500B;&#x90FD;&#x5E02;&#x4E0A;&#x73ED;&#x3002;</p>
<h1 id="&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;">&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;</h1>
<p>&#x5728;&#x6211;&#x7684;&#x8A18;&#x61B6;&#x4E2D;&#xFF0C;&#x6700;&#x65E9;&#x9F13;&#x5439;&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x662F; Ruby on Rails &#x3001;<a href="https://www.books.com.tw/products/CN10704388?sloc=main" target="_blank">Rework &#x4E2D;&#x8B6F;&#xFF1A;&#x91CD;&#x4F86;&#xFF1A;&#x66F4;&#x70BA;&#x7C21;&#x55AE;&#x6709;&#x6548;&#x7684;&#x5546;&#x696D;&#x601D;&#x7DAD;</a>&#x3001;<a href="https://amzn.to/3jwDAUQ" target="_blank">Remote: Office Not Required</a>&#x3001;<a href="https://amzn.to/3cRcdC6" target="_blank">It Doesn&apos;t Have to Be Crazy at Work</a>&#x7684;&#x4F5C;&#x8005;&#xFF0C;<a href="https://37signals.com/" target="_blank">37 Signals</a> &#x7684;&#x5169;&#x4F4D;&#x5275;&#x8FA6;&#x8005; Jason Fried &#x8207; David Heinemeier Hansson &#xFF08;DHH&#xFF09;</p>
<p>&#x4ED6;&#x5011;&#x9019;&#x5E7E;&#x672C;&#x66F8;&#xFF0C;&#x5F9E;&#x7B2C;&#x4E00;&#x672C;&#x51FA;&#x7248;&#x5728; 2010 &#x5230;&#x7B2C;&#x4E09;&#x672C;&#x5728; 2018 &#x51FA;&#x7248;&#xFF0C;&#x5167;&#x5BB9;&#x7684;&#x7CBE;&#x795E;&#x90FD;&#x5F88;&#x63A5;&#x8FD1;&#xFF0C;&#x4F46;&#x662F;&#x8B80;&#x8005;&#x6211;&#x7684;&#x5FC3;&#x614B;&#x537B;&#x6709;&#x5F88;&#x5927;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x6211;&#x628A;&#x6211;&#x7576;&#x5E74;&#x5BEB;&#x7684;&#x611F;&#x60F3;&#x5F15;&#x5728;&#x9019;&#x908A;</p>
<blockquote>
<p>&#x539F;&#x6587;&#x5BEB;&#x65BC; 2014/05/12 &#x8AC7; DHH &#x8207; Kent Beck <a href="https://www.facebook.com/notes/kent-beck/rip-tdd/750840194948847/" target="_blank">RIP TDD</a> &#x7684;&#x6230;&#x6587;</p>
<p>DHH &#x5728; Rework &#x4E2D;&#x81EA;&#x8FF0;&#x5230;&#xFF0C;&#x4ED6;&#x504F;&#x597D;&#x5E36;&#x9818;&#x4E00;&#x500B;&#x4E09;&#x5341;&#x4EBA;&#x7684;&#x5718;&#x968A;&#x81EA;&#x5728;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E0D;&#x8981;&#x628A;&#x7D44;&#x7E54;&#x64F4;&#x5927;&#x5230;&#x4E0A;&#x767E;&#x4E0A;&#x5343;&#x4EBA;&#x628A;&#x81EA;&#x5DF1;&#x641E;&#x7684;&#x7126;&#x982D;&#x6FEB;&#x984D;&#x3002; DHH &#x5728;&#x7D44;&#x7E54;&#x67B6;&#x69CB;&#x8DDF;&#x61C9;&#x7528;&#x7BC4;&#x570D;&#x7684;&#x504F;&#x597D;&#x504F;&#x98DF;&#xFF0C;&#x8B93;&#x6211;&#x5728;&#x8B80; DHH &#x6587;&#x7AE0;&#x6642;&#x90FD;&#x6703;&#x5148;&#x8003;&#x616E;&#x904E;&#x4ED6;&#x7684;&#x51FA;&#x767C;&#x9EDE;&#x8DDF;&#x5C40;&#x9650;&#x6027;&#x3002;</p>
<p>&#x4EE5;&#x7A0B;&#x5F0F;&#x8A2D;&#x8A08;&#x5E2B;&#x7684;&#x89D2;&#x8272;&#x4F86;&#x8AAA;&#xFF0C; DHH &#x7684;&#x7CBE;&#x5175;&#x653F;&#x7B56;&#x7576;&#x7136;&#x770B;&#x8D77;&#x4F86;&#x5F88;&#x723D;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x4E5F;&#x505A;&#x904E;&#x985E;&#x4F3C;&#x7684;&#x9078;&#x64C7;&#xFF0C;&#x6368;&#x68C4; Java &#x800C;&#x5C31; Scala &#xFF0C;&#x8FFD;&#x6C42;&#x66F4;&#x9AD8;&#x7684;&#x500B;&#x4EBA;&#x7522;&#x503C;&#x3002;</p>
<p>&#x7136;&#x800C;&#x82E5;&#x662F;&#x4EE5;&#x4E00;&#x500B;&#x67B6;&#x69CB;&#x5E2B;&#x7684;&#x89D2;&#x5EA6;&#x4F86;&#x8AAA;&#xFF0C;&#x6211;&#x7684;&#x76EE;&#x6A19;&#x662F;&#x6210;&#x70BA;&#x50CF; Martin Fowler &#x7684;&#x89D2;&#x8272;&#xFF0C;&#x76F8;&#x8F03;&#x65BC;&#x53EA;&#x6709; 36 &#x500B;&#x54E1;&#x5DE5;&#x7684; 37 signals &#xFF0C;ThoughtWorks &#x662F;&#x500B;&#x6709;&#x8D85;&#x904E; 2500 &#x500B;&#x54E1;&#x5DE5;&#x7684;&#x5C08;&#x696D;&#x4EE3;&#x5DE5;&#x5EE0;&#xFF0C;&#x5728; ThoughtWorks &#x639B;&#x982D;&#x724C;&#x7684; Martin Fowler &#x5728;&#x6280;&#x8853;&#x7684;&#x9078;&#x7528;&#x4E0A;&#xFF0C;&#x81EA;&#x7136;&#x7684;&#x8003;&#x91CF;&#x8981;&#x66F4;&#x5168;&#x9762;&#xFF0C;&#x9867;&#x616E;&#x5230;&#x4E0D;&#x540C;&#x61C9;&#x7528;&#x9818;&#x57DF;&#x7684;&#x958B;&#x767C;&#x9700;&#x6C42;&#x3001;&#x4EE5;&#x53CA;&#x4E0D;&#x540C;&#x7A0B;&#x5EA6;&#x7684;&#x7A0B;&#x5F0F;&#x8A2D;&#x8A08;&#x5E2B;&#x8A72;&#x600E;&#x9EBC;&#x7BA1;&#x7406;</p>
<p>DHH &#x5C0D; TDD &#x7684;&#x6279;&#x8A55;&#x6211;&#x591A;&#x6578;&#x540C;&#x610F;&#xFF0C;&#x5C24;&#x5176;&#x662F; Testing / DI &#x5C0D; Design &#x7684;&#x5165;&#x4FB5;&#x4E5F;&#x662F;&#x4E00;&#x76F4;&#x56F0;&#x64FE;&#x6211;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x662F;&#x628A; Testing &#x7576;&#x6210;&#x4E00;&#x500B;&#x9700;&#x6C42;&#x4F86;&#x770B;&#xFF0C;&#x6240;&#x4EE5;&#x662F;&#x591A;&#x4E00;&#x500B;&#x9700;&#x6C42;&#x9020;&#x6210;&#x7684;&#x984D;&#x5916;&#x6210;&#x672C;&#x5728;&#x56F0;&#x64FE;&#x6211;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x964D;&#x4F4E;&#x53EF;&#x8B80;&#x6027;&#x7B49;&#x554F;&#x984C;&#x5728;&#x56F0;&#x64FE;&#x6211;&#x3002;</p>
<p>&#x5728;&#x76EE;&#x524D;&#x770B;&#x4E0D;&#x5230;&#x8F03;&#x597D;&#x7684;&#x66FF;&#x4EE3;&#x54C1;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x9084;&#x662F;&#x6703;&#x7E7C;&#x7E8C;&#x7528; TDD (w/o test first) &#x4F86;&#x505A;&#x8A2D;&#x8A08;&#x4E0A;&#x7684;&#x5DE5;&#x6CD5;&#x3002;</p>
</blockquote>
<p>

<blockquote>
<p>&#x539F;&#x6587;&#x5BEB;&#x65BC; 2017/09/02</p>
<p>&#x9019;&#x5E7E;&#x5929;&#x88AB;&#x65B0;&#x7684;&#x6B50;&#x76DF;&#x6CD5;&#x898F; GDPR &#x6574;&#x5F97;&#x5F88;&#x6158;&#xFF0C;&#x5C0D;&#x6574;&#x500B;&#x5546;&#x696D;&#x8EDF;&#x9AD4;&#x7684;&#x5E02;&#x5834;&#xFF0C;&#x53C8;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x898B;&#x89E3;&#x3002;
&#x5728;&#x5546;&#x696D; CRM &#x5E02;&#x5834;&#x4E0A;&#xFF0C;&#x6709;&#x56DB;&#x500B;&#x4E3B;&#x8981;&#x4F9B;&#x61C9;&#x5546; Salesforce, Dynamics, Oracle, SAP &#xFF0C;&#x56DB;&#x500B;&#x90FD;&#x662F;&#x6709;&#x53E3;&#x7686;&#x5478;&#x7684;&#xFF0C;&#x4F46;&#x504F;&#x504F;&#x9019;&#x56DB;&#x500B;&#x5C31;&#x4F54;&#x4E86;&#x5E02;&#x5834;&#x7684;&#x516D;&#x6210;&#x7684;&#x5E02;&#x4F54;&#x7387;&#x3002;</p>
<p>&#x70BA;&#x4EC0;&#x9EBC;&#x5462;&#xFF1F;&#x56E0;&#x70BA;&#x7F8E;&#x570B;&#x9019;&#x908A;&#x5927;&#x591A;&#x6578;&#x662F;&#x4E0A;&#x5E02;&#x516C;&#x53F8;&#xFF0C;&#x4E0D;&#x7BA1;&#x4EC0;&#x9EBC;&#x898F;&#x6A21;&#x7684;&#x516C;&#x53F8;&#x90FD;&#x5728;&#x8CC7;&#x672C;&#x5E02;&#x5834;&#x4E0A;&#x5E02;&#xFF0C;&#x76F8;&#x8F03;&#x65BC;&#x79C1;&#x4EBA;&#x516C;&#x53F8;&#xFF0C;&#x4E0A;&#x5E02;&#x516C;&#x53F8;&#x53D7;&#x5230;&#x8A31;&#x591A;&#x7684;&#x6CD5;&#x898F;&#x7BA1;&#x5236;&#xFF0C;&#x5728;&#x8CC7;&#x8A0A;&#x7CFB;&#x7D71;&#x63A1;&#x8CFC;&#x4E0A;&#xFF0C;&#x53EA;&#x80FD;&#x8DDF;&#x67D0;&#x5E7E;&#x5927;&#x516C;&#x53F8;&#x63A1;&#x8CFC;&#x7B26;&#x5408;&#x6CD5;&#x898F;&#x9650;&#x5236;&#x7684;&#x7522;&#x54C1;&#x3002;</p>
<p>&#x904E;&#x53BB;&#x5728;&#x98DB;&#x5411;&#x6211;&#x5011;&#x4E94;&#x500B;&#x4EBA;&#x505A;&#x4E09;&#x500B;&#x6708;&#x7684;&#x7522;&#x54C1;&#xFF0C;&#x5728;&#x9818;&#x82F1;&#x8981;&#x5341;&#x5E7E;&#x500B;&#x4EBA;&#x505A;&#x4E5D;&#x500B;&#x6708;&#xFF0C;&#x7136;&#x5F8C;&#x9084;&#x6BD4;&#x8F03;&#x96E3;&#x7528;</p>
<p>&#x9818;&#x82F1;&#x4E0A;&#x5E02;&#x524D;&#x53EA;&#x6709;&#x4E03;&#x767E;&#x4EBA;&#xFF0C;&#x4E0A;&#x5E02;&#x5F8C;&#xFF0C;&#x6BCF;&#x5E74;&#x4EBA;&#x529B;&#x6210;&#x9577; 30% &#x696D;&#x7E3E;&#x6210;&#x9577; 50% &#xFF0C;&#x6C92;&#x5E7E;&#x5E74;&#x5C31;&#x8B8A;&#x6210;&#x4E00;&#x842C;&#x4EBA;&#x7684;&#x5DE8;&#x578B;&#x516C;&#x53F8;&#xFF0C;&#x5B8C;&#x5168;&#x770B;&#x4E0D;&#x5230;&#x8EDF;&#x9AD4;&#x696D;&#x8AAA;&#x7684;&#x4E58;&#x6578;&#x6548;&#x61C9;&#xFF0C;&#x5728;&#x88E1;&#x9762;&#x5DE5;&#x4F5C;&#xFF0C;&#x5BE6;&#x5728;&#x9A55;&#x50B2;&#x4E0D;&#x8D77;&#x4F86;....</p>
<p>&#x904E;&#x53BB;&#x6211;&#x66FE;&#x89BA;&#x5F97; DHH &#x8B1B;&#x8AAA;&#x4E0D;&#x60F3;&#x628A;&#x516C;&#x53F8;&#x505A;&#x5927;&#xFF0C;&#x662F;&#x4ED6;&#x662F;&#x91CE;&#x5FC3;&#x4E0D;&#x5920;&#x5927;&#xFF0C;&#x73FE;&#x5728;&#x6211;&#x53CD;&#x800C;&#x5F88;&#x8A8D;&#x540C; DHH &#xFF0C;&#x516C;&#x53F8;&#x4E0D;&#x7528;&#x53BB;&#x8FFD;&#x6C42;&#x5927;&#x4F01;&#x696D;&#x7684;&#x8A02;&#x55AE;&#xFF0C;&#x800C;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x8EDF;&#x9AD4;&#x67B6;&#x69CB;&#x3001;&#x7D44;&#x7E54;&#x67B6;&#x69CB;&#x5F04;&#x5F97;&#x7570;&#x5E38;&#x80A5;&#x5927;&#xFF0C;&#x6BCF;&#x5929;&#x4E0A;&#x73ED;&#x90FD;&#x662F;&#x8655;&#x7406;&#x4E0D;&#x5B8C;&#x7684;&#x6574;&#x5408;&#x554F;&#x984C;&#x3002;</p>
</blockquote>
</p><p>&#x626F;&#x9060;&#x4E86;&#xFF0C;&#x628A;&#x4E3B;&#x984C;&#x62C9;&#x56DE;&#x4F86;&#xFF0C;&#x6211;&#x63A5;&#x89F8;&#x904E;&#x4E00;&#x4E9B;&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#x8005;&#x53CA;&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#x516C;&#x53F8;&#xFF0C;&#x767C;&#x73FE;&#xFF0C;&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#x6709;&#x8A31;&#x591A;&#x7684;&#x5148;&#x6C7A;&#x689D;&#x4EF6;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x5718;&#x968A;&#x6210;&#x54E1;&#x7684;&#x6D41;&#x52D5;&#x6027;&#x4E0D;&#x80FD;&#x592A;&#x5927;&#xFF0C;&#x5927;&#x5BB6;&#x8981;&#x6709;&#x6642;&#x9593;&#x78E8;&#x5408;&#x51FA;&#x4F86;&#x9ED8;&#x5951;&#x8DDF;&#x4FE1;&#x4EFB;&#x611F;&#xFF0C;&#x800C;&#x4E14;&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#x8005;&#x901A;&#x5E38;&#x662F;&#x5C0D;&#x8EDF;&#x9AD4;&#x8A2D;&#x8A08;&#x6D41;&#x7A0B;&#x6709;&#x7D93;&#x9A57;&#x7684;&#x8001;&#x624B;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4EBA;&#x5E36;&#x5165;&#x9580;&#xFF1B;&#x516C;&#x53F8;&#x7684;&#x7522;&#x54C1;&#x8981;&#x6709;&#x5F88;&#x5F37;&#x7684;&#x6838;&#x5FC3;&#x7522;&#x54C1;&#xFF0C;&#x5718;&#x968A;&#x6210;&#x54E1;&#x80FD;&#x5920;&#x7406;&#x89E3;&#x516C;&#x53F8;&#x7684;&#x696D;&#x52D9;&#x662F;&#x4EC0;&#x9EBC;&#xFF0C;&#x50CF;&#x662F; 37 Signals &#x66FE;&#x6709;&#x4E94;&#x500B;&#x7522;&#x54C1;&#x7DDA;&#xFF0C;&#x4F46;&#x662F;&#x70BA;&#x4E86;&#x5F37;&#x5316;&#x6838;&#x65B0;&#x7522;&#x54C1;&#xFF0C;&#x516C;&#x53F8;&#x628A;&#x7522;&#x54C1;&#x7DDA;&#x6536;&#x5230;&#x5269;&#x4E00;&#x500B;&#x3002;</p>
<p>&#x5728;&#x9019;&#x7A2E;&#x5148;&#x6C7A;&#x689D;&#x4EF6;&#x4E4B;&#x4E0B;&#xFF0C;&#x5728;&#x75AB;&#x60C5;&#x524D;&#xFF0C;&#x63A8;&#x5EE3;&#x5168;&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#x7684;&#x5718;&#x968A;&#xFF0C;&#x516C;&#x53F8;&#x898F;&#x6A21;&#x6C92;&#x6709;&#x8D85;&#x904E; 100 &#x4EBA;&#xFF0C;&#x8D85;&#x904E; 100 &#x4EBA;&#xFF0C;&#x5C31;&#x662F; IBM Accenture &#x7B49;&#x505A;&#x5916;&#x5305;&#x5C08;&#x6848;&#x7684;&#x516C;&#x53F8;&#x3002;&#x6C92;&#x6709;&#x5E38;&#x5E38;&#x9700;&#x8981;&#x8DE8;&#x90E8;&#x9580;&#x5408;&#x505A;&#x7684;&#x9700;&#x6C42;&#x3002;&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E26;&#x4E0D;&#x9069;&#x5408;&#x300C;&#x6210;&#x9577;&#x578B;&#x65B0;&#x5275;&#x516C;&#x53F8;&#x300D;&#x53CA;&#x300C;&#x5927;&#x516C;&#x53F8;&#x300D;&#xFF0C;&#x8F03;&#x9069;&#x5408;&#x6C92;&#x6709;&#x5C0D;&#x5916;&#x52DF;&#x8CC7;&#x7684;&#x975E;&#x6210;&#x9577;&#x578B;&#x4E2D;&#x5C0F;&#x4F01;&#x696D;&#x4F7F;&#x7528;&#x3002;</p>
<h1 id="peopleware">Peopleware</h1>
<p>&#x8EDF;&#x9AD4;&#x696D;&#x73FE;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x958B;&#x653E;&#x8FA6;&#x516C;&#x5BA4;&#xFF0C;&#x662F;&#x5F9E;&#x91D1;&#x878D;&#x696D;&#x4EA4;&#x6613;&#x54E1;&#x7684;&#x8FA6;&#x516C;&#x65B9;&#x5F0F;&#x5B78;&#x7FD2;&#x904E;&#x4F86;&#x7684;&#xFF0C;&#x9019;&#x7A2E;&#x958B;&#x653E;&#x8FA6;&#x516C;&#x5BA4;&#x7684;&#x512A;&#x9EDE;&#xFF0C;&#x662F;&#x8CC7;&#x8A0A;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x6D41;&#x901A;&#xFF0C;&#x9069;&#x5408;&#x5728;&#x5C08;&#x6848;&#x7684;&#x521D;&#x671F;&#xFF0C;&#x5927;&#x5BB6;&#x5FEB;&#x901F;&#x7684;&#x4EA4;&#x63DB;&#x610F;&#x898B;&#xFF0C;&#x7576;&#x5169;&#x500B;&#x54E1;&#x5DE5;&#x5728;&#x8A0E;&#x8AD6;&#x6642;&#xFF0C;&#x5176;&#x4ED6;&#x4EBA;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x53C3;&#x8207;&#x8A0E;&#x8AD6;&#xFF0C;&#x4F46;&#x662F;&#x7F3A;&#x9EDE;&#x4E5F;&#x662F;&#x986F;&#x800C;&#x6613;&#x898B;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x7576;&#x4F60;&#x5C08;&#x5FC3;&#x5728;&#x505A;&#x4E8B;&#x6642;&#xFF0C;&#x6703;&#x88AB;&#x5176;&#x5B83;&#x7684;&#x54E1;&#x5DE5;&#x5E72;&#x64FE;&#x751A;&#x81F3;&#x6253;&#x65B7;&#x3002;</p>
<p>&#x90A3;&#x662F;&#x5426;&#x6709;&#x5176;&#x5B83;&#x7684;&#x8FA6;&#x516C;&#x5BA4;&#x578B;&#x5F0F;&#x5462;&#xFF1F;&#x5728;<a href="https://www.books.com.tw/products/0010659524" target="_blank">Peopleware &#x4E2D;&#x8B6F;&#xFF1A;&#x8166;&#x529B;&#x5BC6;&#x96C6;&#x7522;&#x696D;&#x7684;&#x4EBA;&#x624D;&#x7BA1;&#x7406;&#x4E4B;&#x9053;</a>&#x9019;&#x672C; 1987 &#x5E74;&#x51FA;&#x7248;&#x7684;&#x8001;&#x66F8;&#x4E2D;&#xFF0C;&#x5F15;&#x7528;&#x4E86;&#x5F88;&#x591A;&#x7576;&#x5E74; At&amp;t, IBM &#x7B49;&#x5927;&#x516C;&#x53F8;&#x505A;&#x7684;&#x8FA6;&#x516C;&#x5BA4;&#x7814;&#x7A76;&#xFF0C;&#x8AAA;&#x500B;&#x4EBA;&#x8FA6;&#x516C;&#x5BA4;&#x624D;&#x662F;&#x8F03;&#x9069;&#x5408;&#x8166;&#x529B;&#x5DE5;&#x4F5C;&#x8005;&#x7684;&#x8FA6;&#x516C;&#x65B9;&#x5F0F;</p>
<h1 id="todo-&#x91CD;&#x8B80;-peopleware-&#x88DC;&#x4E0A;&#x8FA6;&#x516C;&#x5BA4;&#x7684;&#x4ECB;&#x7D39;">TODO: &#x91CD;&#x8B80; Peopleware &#x88DC;&#x4E0A;&#x8FA6;&#x516C;&#x5BA4;&#x7684;&#x4ECB;&#x7D39;</h1>
<h1 id="todo-&#x627E;&#x51FA;&#x6211;-realnetworks-&#x8FA6;&#x516C;&#x5BA4;&#x7684;&#x7167;&#x7247;&#xFF0C;&#x6216;&#x756B;&#x51FA;&#x914D;&#x5236;&#x5716;">TODO: &#x627E;&#x51FA;&#x6211; RealNetworks &#x8FA6;&#x516C;&#x5BA4;&#x7684;&#x7167;&#x7247;&#xFF0C;&#x6216;&#x756B;&#x51FA;&#x914D;&#x5236;&#x5716;</h1>
<h1 id="&#x7D50;&#x8A9E;">&#x7D50;&#x8A9E;</h1>
<p>&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x767C;&#x5C55;&#x4E86;&#x8FD1;&#x4E94;&#x5341;&#x5E74;&#x4E0B;&#x4F86;&#xFF0C;&#x5728;&#x5DE5;&#x7A0B;&#x65B9;&#x6CD5;&#x8AD6;&#x9019;&#x584A;&#x4E0A;&#xFF0C;&#x5927;&#x591A;&#x6642;&#x5019;&#xFF0C;&#x9084;&#x662F;&#x6BD4;&#x8F03;&#x504F;&#x5DE5;&#x5320;&#x7CBE;&#x795E;&#xFF0C;&#x53EA;&#x77E5;&#x5176;&#x7136;&#x4E0D;&#x77E5;&#x6240;&#x4EE5;&#x7136;&#xFF0C;&#x770B;&#x5230;&#x5225;&#x4EBA;&#x505A;&#x6709;&#x7528;&#xFF0C;&#x5C31;&#x7167;&#x8457;&#x505A;&#x5C31;&#x5C0D;&#x4E86;&#xFF1B;&#x4E26;&#x6C92;&#x6709;&#x8E0F;&#x5165;&#x5DE5;&#x7A0B;&#x79D1;&#x5B78;&#x7684;&#x9818;&#x57DF;&#xFF0C;&#x627E;&#x51FA;&#x5728;&#x4F55;&#x7A2E;&#x689D;&#x4EF6;&#x72C0;&#x6CC1;&#x4E0B;&#xFF0C;&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#x662F;&#x9069;&#x7528;&#x7684;&#xFF0C;&#x5728;&#x4F55;&#x7A2E;&#x72C0;&#x6CC1;&#x4E0B;&#xFF0C;&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#x662F;&#x4E0D;&#x9069;&#x7528;&#x7684;&#x3002;&#x50CF;&#x662F;&#x6211;&#x4E0A;&#x9762;&#x5C0D;&#x300C;&#x9060;&#x7AEF;&#x5DE5;&#x4F5C;&#x300D;&#x7684;&#x689D;&#x4EF6;&#x9700;&#x6C42;&#xFF0C;&#x4E5F;&#x53EA;&#x6211;&#x500B;&#x4EBA;&#x89C0;&#x5BDF;&#x5F8C;&#xFF0C;&#x505A;&#x51FA;&#x7684;&#x5047;&#x8A2D;&#xFF0C;&#x4E26;&#x6C92;&#x6709;&#x900F;&#x904E;&#x7D71;&#x8A08;&#x5B78;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4F86;&#x652F;&#x6301;&#x9019;&#x500B;&#x89C0;&#x5BDF;&#x662F;&#x5426;&#x6B63;&#x78BA;&#xFF0C;&#x66F4;&#x5225;&#x8AAA;&#x627E;&#x51FA;&#x5176;&#x4E2D;&#x7684;&#x76F8;&#x95DC;&#x6027;&#x3002;</p>
<p>&#x671F;&#x671B;&#x672C;&#x6587;&#x80FD;&#x555F;&#x767C;&#x672A;&#x4F86;&#x7684;&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x5E2B;&#xFF0C;&#x6CBF;&#x7E8C;&#x524D;&#x4EBA;&#x7684;&#x8FA6;&#x516C;&#x5BA4;&#x7814;&#x7A76;&#xFF0C;&#x7528;&#x79D1;&#x5B78;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x53BB;&#x5206;&#x6790;&#x51FA;&#x6574;&#x7406;&#x51FA;&#xFF0C;&#x5728;&#x90A3;&#x4E00;&#x7A2E;&#x72C0;&#x6CC1;&#x4E0B;&#xFF0C;&#x8A72;&#x4F7F;&#x7528;&#x90A3;&#x4E00;&#x7A2E;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x3002;</p>
<div id="fb-root"></div>
<script async defer crossorigin="anonymous" src="https://connect.facebook.net/en_US/sdk.js#xfbml=1&amp;version=v8.0&amp;appId=206989179619&amp;autoLogAppEvents=1" nonce="b5OFChIo"></script>

<div class="fb-comments" data-href="https://elderengineer.github.io/book-sillicon-valley/53.html" data-numposts="10" data-width="" lazy="true"></div>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="52.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 工程師年齡歧視的真象">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"遠端工作與工作環境研究","level":"1.5.3","depth":2,"next":{"title":"給年輕人的建議","level":"1.6","depth":1,"ref":"","articles":[{"title":"該不該念博士","level":"1.6.1","depth":2,"path":"62.md","ref":"62.md","articles":[]}]},"previous":{"title":"工程師年齡歧視的真象","level":"1.5.2","depth":2,"path":"52.md","ref":"52.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"53.md","mtime":"2020-10-12T22:14:20.275Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-12T22:14:56.203Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

