
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>該不該念博士 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    我在飛向的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="26.html">
            
                <a href="26.html">
            
                    
                    談中小企業放款
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="27.html">
            
                <a href="27.html">
            
                    
                    獎助條例
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    在大公司打工的日子
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="31.html">
            
                <a href="31.html">
            
                    
                    帝王
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="32.html">
            
                <a href="32.html">
            
                    
                    組織與企業章呈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="36.html">
            
                <a href="36.html">
            
                    
                    祖傳代碼與組織知識的傳承
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="38.html">
            
                <a href="38.html">
            
                    
                    靠數據指標（KPI）引導團隊
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    矽谷雜談
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="41.html">
            
                <a href="41.html">
            
                    
                    併聘 Acquhire
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="42.html">
            
                <a href="42.html">
            
                    
                    企業併購產品整合問題
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    大齡工程師的挑戰
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="51.html">
            
                <a href="51.html">
            
                    
                    程式設計師潛水夫症
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="52.html">
            
                <a href="52.html">
            
                    
                    工程師年齡歧視的真象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="53.html">
            
                <a href="53.html">
            
                    
                    遠端工作與工作環境研究
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    給年輕人的建議
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.6.1" data-path="62.html">
            
                <a href="62.html">
            
                    
                    該不該念博士
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >該不該念博士</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x8A72;&#x4E0D;&#x8A72;&#x5FF5;&#x535A;&#x58EB;">&#x8A72;&#x4E0D;&#x8A72;&#x5FF5;&#x535A;&#x58EB;</h1>
<p>&#x8A72;&#x4E0D;&#x8A72;&#x5FF5;&#x535A;&#x58EB;&#xFF0C;&#x662F;&#x8A31;&#x591A;&#x7559;&#x5B78;&#x751F;&#x90FD;&#x6709;&#x904E;&#x7684;&#x5FF5;&#x982D;&#xFF0C;&#x6211;&#x5728;&#x6211;&#x4E8C;&#x5341;&#x521D;&#x982D;&#x6642;&#xFF0C;&#x8003;&#x616E;&#x904E;&#xFF0C;&#x4F46;&#x662F;&#x60F3;&#x5230;&#x6C92;&#x6709;&#x9032;&#x5165;&#x524D;&#x4E8C;&#x5341;&#x540D;&#x535A;&#x58EB;&#x73ED;&#xFF0C;&#x505A;&#x771F;&#x6B63;&#x7684;&#x7814;&#x7A76;&#x7684;&#x53EF;&#x80FD;&#xFF0C;&#x6240;&#x4EE5;&#x653E;&#x68C4;&#x4E86;&#x5FF5;&#x535A;&#x58EB;&#xFF0C;&#x76F4;&#x63A5;&#x9032;&#x5165;&#x696D;&#x754C;&#x3002;</p>
<p>&#x70BA;&#x4EC0;&#x9EBC;&#x6211;&#x53EA;&#x8003;&#x616E;&#x524D;&#x4E8C;&#x5341;&#x540D;&#x7684;&#x535A;&#x58EB;&#x73ED;&#x5462;&#xFF1F;&#x8AD6;&#x6587;&#x6709;&#x56DB;&#x5927;&#x985E;</p>
<ul>
<li>&#x5C16;&#x7AEF;&#x5275;&#x65B0;&#x7684;&#x7814;&#x7A76;&#xFF0C;&#x505A;&#x51FA;&#x6C92;&#x6709;&#x4EBA;&#x60F3;&#x904E;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x5E36;&#x9818;&#x5168;&#x4EBA;&#x985E;&#x628A;&#x77E5;&#x8B58;&#x7684;&#x9818;&#x57DF;&#x64F4;&#x5C55;&#x4E86;&#x4E00;&#x4E9B;&#x3002;</li>
<li>&#x628A;&#x53E6;&#x4E00;&#x500B;&#x9818;&#x57DF;&#x7684;&#x7814;&#x7A76;&#x6210;&#x679C;&#xFF0C;&#x62FF;&#x4F86;&#x81EA;&#x5DF1;&#x7684;&#x9818;&#x57DF;&#x5957;&#x7528;&#xFF0C;&#x505A;&#x8DE8;&#x9818;&#x57DF;&#x7684;&#x77E5;&#x8B58;&#x63A2;&#x7D22;&#x3002;</li>
<li>&#x628A;&#x4E00;&#x500B;&#x5275;&#x65B0;&#x7814;&#x7A76;&#x7684;&#x8AD6;&#x6587;&#x6210;&#x679C;&#xFF0C;&#x62FF;&#x4F86;&#x6AA2;&#x9A57;&#x4E00;&#x904D;&#xFF0C;&#x78BA;&#x5B9A;&#x6578;&#x64DA;&#x662F;&#x53EF;&#x4EE5;&#x91CD;&#x73FE;&#x7684;&#x3002;</li>
<li>&#x628A;&#x4E00;&#x500B;&#x9818;&#x57DF;&#x7684;&#x773E;&#x591A;&#x8AD6;&#x6587;&#xFF0C;&#x505A;&#x4E00;&#x500B;&#x5C0E;&#x8B80;&#xFF0C;&#x8B93;&#x5F8C;&#x4EBA;&#x53EF;&#x4EE5;&#x5C0D;&#x9019;&#x500B;&#x9818;&#x57DF;&#x7684;&#x767C;&#x5C55;&#x8108;&#x7D61;&#xFF0C;&#x5F9E;&#x6DFA;&#x5230;&#x6DF1;&#x53BB;&#x7406;&#x89E3;&#x3002;</li>
</ul>
<p>&#x56E0;&#x70BA;&#x6211;&#x7576;&#x6642;&#x8D77;&#x6B65;&#x7684;&#x665A;&#xFF0C;&#x4E26;&#x6C92;&#x6709;&#x65E9;&#x65E9;&#x4E0B;&#x5B9A;&#x8981;&#x5FF5;&#x535A;&#x58EB;&#xFF0C;&#x96D6;&#x7136;&#x5927;&#x5B78;&#x6709;&#x5728;&#x5BE6;&#x9A57;&#x5BA4;&#x6253;&#x5DE5;&#xFF0C;&#x4F46;&#x6C92;&#x6709;&#x767C;&#x8AD6;&#x6587;&#xFF0C;&#x8981;&#x9032;&#x771F;&#x6B63;&#x505A;&#x5275;&#x65B0;&#x7814;&#x7A76;&#x7684;&#x5B78;&#x6821;&#xFF0C;&#x6709;&#x9EDE;&#x56F0;&#x96E3;&#x3002;&#x800C;&#x4E14;&#x5E74;&#x8F15;&#x6642;&#x73A9;&#x5FC3;&#x91CD;&#xFF0C;&#x4E26;&#x4E0D;&#x662F;&#x90A3;&#x9EBC;&#x60F3;&#x505A;&#x7814;&#x7A76;&#x3002;&#x800C;&#x5F8C;&#x4E09;&#x985E;&#x7684;&#x8AD6;&#x6587;&#xFF0C;&#x8DDF;&#x5728;&#x696D;&#x754C;&#x505A;&#x7522;&#x54C1;&#xFF0C;&#x4E5F;&#x6C92;&#x6709;&#x5DEE;&#x592A;&#x591A;&#xFF0C;&#x65BC;&#x662F;&#x5C31;&#x653E;&#x68C4;&#x4E86;&#x9019;&#x500B;&#x5FF5;&#x982D;&#x3002;</p>
<p>&#x5C31;&#x9019;&#x6A23;&#x5728;&#x696D;&#x754C;&#x5E79;&#x4E86;&#x5341;&#x591A;&#x5E74;&#xFF0C;&#x771F;&#x6B63;&#x8B93;&#x6211;&#x518D;&#x6B21;&#x6709;&#x5FF5;&#x535A;&#x58EB;&#x73ED;&#x7684;&#x60F3;&#x6CD5;&#x6642;&#xFF0C;&#x662F;&#x6211;&#x5728;&#x9818;&#x82F1;&#x64D4;&#x4EFB;&#x5DE5;&#x7A0B;&#x5E2B;&#x7684;&#x6642;&#x5019;&#x4E86;&#x3002;&#x5728;&#x9818;&#x82F1;&#xFF0C;&#x6BCF;&#x4E00;&#x5B63;&#x90FD;&#x6709;&#x4E00;&#x4E9B;&#x300C;&#x6A6B;&#x5411;&#x8A08;&#x5283;&#x300D;&#xFF08;Horizontal Initiative&#xFF09;&#x4F86;&#x6E05;&#x516C;&#x53F8;&#x7684;&#x6280;&#x8853;&#x50B5;&#x3002;&#x4F8B;&#x5982;&#xFF1A;&#x628A;&#x67D0;&#x500B;&#x51FD;&#x5F0F;&#x5EAB;&#x6607;&#x5230;&#x6700;&#x65B0;&#x7248;&#xFF0C;&#x628A;&#x516C;&#x53F8;&#x7684;&#x8CA0;&#x8F09;&#x5E73;&#x885D;&#xFF08;Load Balance&#xFF09;&#x5F9E; DNS round robin &#x6539;&#x6210; least connection &#x7B49;&#x3002;</p>
<p>&#x9019;&#x4E9B;&#x300C;&#x6A6B;&#x5411;&#x8A08;&#x5283;&#x300D;&#x6703;&#x540C;&#x6642;&#x52D5;&#x7528;&#x5230;&#x5168;&#x516C;&#x53F8;&#x5404;&#x5718;&#x968A;&#x7684;&#x4EBA;&#x529B;&#xFF0C;&#x628A;&#x6280;&#x8853;&#x50B5;&#x7D66;&#x6E05;&#x6389;&#xFF0C;&#x8332;&#x4E8B;&#x9AD4;&#x5927;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x5011;&#x6709;&#x500B;&#x300C;&#x6A6B;&#x5411;&#x8A08;&#x5283;&#x59D4;&#x54E1;&#x6703;&#x300D;&#xFF0C;&#x8CA0;&#x8CAC;&#x6536;&#x5927;&#x5BB6;&#x9001;&#x4E0A;&#x4F86;&#x7684;&#x63D0;&#x6848;&#xFF0C;&#x5BE9;&#x67E5;&#x63D0;&#x6848;&#x7684;&#x5167;&#x5BB9;&#xFF0C;&#x662F;&#x5426;&#x6709;&#x52D5;&#x7528;&#x5168;&#x516C;&#x53F8;&#x4EBA;&#x529B;&#x53BB;&#x66F4;&#x65B0;&#x7684;&#x5FC5;&#x8981;&#xFF0C;&#x628A;&#x4E03;&#x6210;&#x7684;&#x63D0;&#x6848;&#x8E22;&#x6389;&#xFF0C;&#x5269;&#x4E0B;&#x4F86;&#x7684;&#x6848;&#x5B50;&#xFF0C;&#x7531;&#x59D4;&#x54E1;&#x6703;&#x6210;&#x54E1;&#x8F14;&#x5C0E;&#xFF0C;&#x5E6B;&#x5FD9;&#x63D0;&#x6848;&#x4EBA;&#x5BEB;&#x57F7;&#x884C;&#x8A08;&#x5283;&#xFF0C;&#x8981;&#x8DDF;&#x5404;&#x6280;&#x8853;&#x5718;&#x968A;&#x4F86;&#x5354;&#x5546;&#xFF0C;&#x57F7;&#x884C;&#x4E0A;&#x6703;&#x78B0;&#x4E0A;&#x90A3;&#x4E9B;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x7136;&#x5F8C;&#x5F04;&#x6E05;&#x8655;&#xFF0C;&#x90A3;&#x4E9B;&#x6838;&#x5FC3;&#x57FA;&#x790E;&#x5EFA;&#x8A2D;&#x9700;&#x8981;&#x66F4;&#x65B0;&#xFF0C;&#x7136;&#x5F8C;&#x5E95;&#x4E0B;&#x7684;&#x7522;&#x54C1;&#x55AE;&#x4F4D;&#x8981;&#x600E;&#x9EBC;&#x8981;&#x66F4;&#x65B0;&#x4F7F;&#x7528;&#x7684;&#x51FD;&#x5F0F;&#x5EAB;&#x3002;</p>
<p>&#x9019;&#x4E9B;&#x63D0;&#x6848;&#xFF0C;&#x5F80;&#x5F80;&#x5C31;&#x50CF;&#x662F;&#x5728;&#x5BEB;&#x8AD6;&#x6587;&#x4E00;&#x6A23;&#xFF0C;&#x8981;&#x63D0;&#x4F9B;&#x6A21;&#x578B;&#x8DDF;&#x6578;&#x64DA;&#xFF0C;&#x50CF;&#x662F;&#x4E0A;&#x8FF0;&#x7684;&#x66F4;&#x6539;&#x8CA0;&#x8F09;&#x5E73;&#x885D;&#x8A08;&#x5283;&#xFF0C;&#x5C31;&#x5206;&#x6790;&#x4E86;&#x6211;&#x5011;&#x7DDA;&#x4E0A;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x7528;&#x9019;&#x500B;&#x6D41;&#x91CF;&#x6A21;&#x578B;&#xFF0C;&#x4F86;&#x6BD4;&#x8F03;&#x5E7E;&#x7A2E;&#x4E0D;&#x540C;&#x8CA0;&#x8F09;&#x5E73;&#x885D;&#x8A08;&#x5283;&#x7684;&#x5DEE;&#x7570;&#xFF0C;&#x8B49;&#x660E;&#x5728;&#x8A31;&#x591A;&#x7A2E;&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x6CC1;&#x4E0B;&#xFF0C;&#x5404;&#x7A2E;&#x8CA0;&#x8F09;&#x5E73;&#x885D;&#x8A08;&#x5283;&#x7684;&#x512A;&#x52A3;&#xFF0C;&#x4E26;&#x4E14;&#x8AAA;&#x660E;&#x6700;&#x7D42;&#x7684;&#x89E3;&#x6C7A;&#x65B9;&#x6848;&#xFF0C;&#x6709;&#x6BD4;&#x6211;&#x5011;&#x73FE;&#x884C;&#x7684;&#x65B9;&#x6848;&#x597D;&#x4E0A;&#x767E;&#x5206;&#x4E4B;&#x591A;&#x5C11;&#xFF0C;&#x9019;&#x6A23;&#xFF0C;&#x9019;&#x500B;&#x6848;&#x5B50;&#x624D;&#x88AB;&#x63A5;&#x53D7;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x662F;&#x5C0D;&#x6280;&#x8853;&#x662F;&#x6709;&#x8FFD;&#x6C42;&#x7684;&#x4EBA;&#xFF0C;&#x800C;&#x4E14;&#x60F3;&#x5728;&#x5927;&#x516C;&#x53F8;&#x5C31;&#x7814;&#x767C;&#x7684;&#x8A71;&#xFF0C;&#x90A3;&#x9EBC;&#x535A;&#x58EB;&#x73ED;&#x5B78;&#x7FD2;&#x5230;&#x7684;&#x7814;&#x7A76;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x5927;&#x516C;&#x53F8;&#x662F;&#x5F88;&#x6709;&#x50F9;&#x503C;&#x7684;&#x3002;&#x7136;&#x800C;&#x4F60;&#x662F;&#x4E00;&#x5FC3;&#x60F3;&#x8981;&#x8FFD;&#x6C42;&#x5275;&#x696D;&#xFF0C;&#x60F3;&#x505A;&#x591A;&#x7A2E;&#x4E0D;&#x540C;&#x7522;&#x54C1;&#x7684;&#x8A71;&#xFF0C;&#x5C31;&#x7528;&#x4E0D;&#x8457;&#x5BEB;&#x9019;&#x4E9B;&#x6709;&#x8A31;&#x591A;&#x6578;&#x7406;&#x6A21;&#x578B;&#x7684;&#x5831;&#x544A;&#x4E86;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"該不該念博士","level":"1.6.1","depth":2,"previous":{"title":"給年輕人的建議","level":"1.6","depth":1,"ref":"","articles":[{"title":"該不該念博士","level":"1.6.1","depth":2,"path":"62.md","ref":"62.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"62.md","mtime":"2020-10-10T07:24:45.218Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-10-10T07:25:21.026Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

